{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 629,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 630,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 630,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 10 # number of nouns extracted from each article\n",
    "DATA = \"WIKI_P100\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Hiromu_Nonaka\"    \n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 631,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 632,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 633,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 634,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 635,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20</td>\n",
       "      <td>100</td>\n",
       "      <td>5</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       20    100          5                  100"
      ]
     },
     "execution_count": 635,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url, group: row.occupation}})\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 636,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>100</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        100                  100"
      ]
     },
     "execution_count": 636,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 637,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 637,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 638,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 639,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 639,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    name = \"Test\"\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Thierry_Henry\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Ai_Fukuhara\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 640,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese, women]</td>\n",
       "      <td>0.270833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Eiji Okada</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Eiji_Okada</td>\n",
       "      <td>actor</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kotaro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kyōka Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki</td>\n",
       "      <td>actor</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Keiji Yamada</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiji_Yamada</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Shiho Yoshimura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shiho_Yoshimura</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Antonio_Inoki</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1        Eiji Okada           https://en.wikipedia.org/wiki/Eiji_Okada   \n",
       "2     Koichi Wakata        https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "3      Kōtarō Honda         https://en.wikipedia.org/wiki/Kotaro_Honda   \n",
       "4      Kyōka Suzuki    https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki   \n",
       "5      Keiji Yamada         https://en.wikipedia.org/wiki/Keiji_Yamada   \n",
       "6   Shiho Yoshimura      https://en.wikipedia.org/wiki/Shiho_Yoshimura   \n",
       "7   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "8    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "9     Antonio Inoki        https://en.wikipedia.org/wiki/Antonio_Inoki   \n",
       "\n",
       "        Group             Common  Similarity  \n",
       "0     athlete  [Japanese, women]    0.270833  \n",
       "1       actor         [Japanese]    0.250000  \n",
       "2    engineer         [Japanese]    0.250000  \n",
       "3    engineer         [Japanese]    0.250000  \n",
       "4       actor         [Japanese]    0.250000  \n",
       "5  politician         [Japanese]    0.250000  \n",
       "6     athlete         [Japanese]    0.250000  \n",
       "7     athlete         [Japanese]    0.250000  \n",
       "8    engineer         [Japanese]    0.250000  \n",
       "9  politician         [Japanese]    0.250000  "
      ]
     },
     "execution_count": 640,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 641,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 641,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 642,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Guts Ishimatsu</td>\n",
       "      <td>[Yuji Suzuki, Ken Buchanan, Rodolfo Gato Gonzá...</td>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>0.175000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Miki Ishii</td>\n",
       "      <td>[Miki Ishii, article, Wikipedia, Japanese, Sum...</td>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>0.175000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Akane Nakashima</td>\n",
       "      <td>[goalball player, Akane Nakashima, Nakashima A...</td>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>0.105556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kyōka Suzuki</td>\n",
       "      <td>[Kyōka Suzuki, Japanese, Hepburn, article, Wik...</td>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>0.300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>[Kotaro Honda, Japanese, type, Taiichi Ohno, H...</td>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>0.300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7563</th>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>10</td>\n",
       "      <td>3</td>\n",
       "      <td>0.216667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7564</th>\n",
       "      <td>Yūji Takeda</td>\n",
       "      <td>[Yuji Yaku, Winter Olympics., bobsledder, Japa...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>4</td>\n",
       "      <td>3</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7565</th>\n",
       "      <td>Yūji Takeda</td>\n",
       "      <td>[Yuji Yaku, Winter Olympics., bobsledder, Japa...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Wikipedia</td>\n",
       "      <td>5</td>\n",
       "      <td>7</td>\n",
       "      <td>0.171429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7566</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>[Takao Doi, Japanese, missions, engineer, vete...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7567</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>[Takao Doi, Japanese, missions, engineer, vete...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>University of Tokyo</td>\n",
       "      <td>9</td>\n",
       "      <td>8</td>\n",
       "      <td>0.118056</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7568 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               a1.name                             a1.phrase[0..$nphrase]  \\\n",
       "0       Guts Ishimatsu  [Yuji Suzuki, Ken Buchanan, Rodolfo Gato Gonzá...   \n",
       "1           Miki Ishii  [Miki Ishii, article, Wikipedia, Japanese, Sum...   \n",
       "2      Akane Nakashima  [goalball player, Akane Nakashima, Nakashima A...   \n",
       "3         Kyōka Suzuki  [Kyōka Suzuki, Japanese, Hepburn, article, Wik...   \n",
       "4         Kōtarō Honda  [Kotaro Honda, Japanese, type, Taiichi Ohno, H...   \n",
       "...                ...                                                ...   \n",
       "7563  Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "7564       Yūji Takeda  [Yuji Yaku, Winter Olympics., bobsledder, Japa...   \n",
       "7565       Yūji Takeda  [Yuji Yaku, Winter Olympics., bobsledder, Japa...   \n",
       "7566         Takao Doi  [Takao Doi, Japanese, missions, engineer, vete...   \n",
       "7567         Takao Doi  [Takao Doi, Japanese, missions, engineer, vete...   \n",
       "\n",
       "               a2.name                             a2.phrase[0..$nphrase]  \\\n",
       "0     Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "1     Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "2     Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "3     Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "4     Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "...                ...                                                ...   \n",
       "7563  Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7564  Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7565  Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7566  Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7567  Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "\n",
       "              commonValue  rank1  rank2  Similarity  \n",
       "0                Japanese      4     10    0.175000  \n",
       "1                Japanese      4     10    0.175000  \n",
       "2                Japanese      9     10    0.105556  \n",
       "3                Japanese      2     10    0.300000  \n",
       "4                Japanese      2     10    0.300000  \n",
       "...                   ...    ...    ...         ...  \n",
       "7563             Japanese     10      3    0.216667  \n",
       "7564             Japanese      4      3    0.291667  \n",
       "7565            Wikipedia      5      7    0.171429  \n",
       "7566             Japanese      2      3    0.416667  \n",
       "7567  University of Tokyo      9      8    0.118056  \n",
       "\n",
       "[7568 rows x 8 columns]"
      ]
     },
     "execution_count": 642,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 643,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese, women]</td>\n",
       "      <td>0.181038</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese, team]</td>\n",
       "      <td>0.116488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.095929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kotaro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.088938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.083825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hiroaki Ōishi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroaki_Ohishi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Yūji Takeda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yuji_Yaku</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Takao_Doi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.066815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.065804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kenichi Yamamoto</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kenichi_Yamamoto...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.059942</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1     Kaoru Hoshino        https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "2    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "3      Kōtarō Honda         https://en.wikipedia.org/wiki/Kotaro_Honda   \n",
       "4      Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "5     Hiroaki Ōishi       https://en.wikipedia.org/wiki/Hiroaki_Ohishi   \n",
       "6       Yūji Takeda            https://en.wikipedia.org/wiki/Yuji_Yaku   \n",
       "7         Takao Doi            https://en.wikipedia.org/wiki/Takao_Doi   \n",
       "8   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "9  Kenichi Yamamoto  https://en.wikipedia.org/wiki/Kenichi_Yamamoto...   \n",
       "\n",
       "        Group           r.common  Similarity  \n",
       "0     athlete  [Japanese, women]    0.181038  \n",
       "1    engineer   [Japanese, team]    0.116488  \n",
       "2    engineer         [Japanese]    0.095929  \n",
       "3    engineer         [Japanese]    0.088938  \n",
       "4  politician         [Japanese]    0.083825  \n",
       "5     athlete         [Japanese]    0.070690  \n",
       "6     athlete         [Japanese]    0.070690  \n",
       "7    engineer         [Japanese]    0.066815  \n",
       "8     athlete         [Japanese]    0.065804  \n",
       "9     athlete         [Japanese]    0.059942  "
      ]
     },
     "execution_count": 643,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 644,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 19 ms\n",
      "Graph 'testgraph' node count: 804\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 645,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.03739521503448486\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 646,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Fumino Sugiyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumino_Sugiyama</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Masayuki Uemura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masayuki_Uemura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.020833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Nanako Matsushima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nanako_Matsushima</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.020408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Miki Ishii</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Miki_Ishii</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.020408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Tsutomu Yamaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.020202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yoshiko_Tanaka</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Masaaki Kanda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaaki_Kanda</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0    Fumino Sugiyama    https://en.wikipedia.org/wiki/Fumino_Sugiyama   \n",
       "1   Haruka Kitaguchi   https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "2    Masayuki Uemura    https://en.wikipedia.org/wiki/Masayuki_Uemura   \n",
       "3      Kaoru Hoshino      https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "4      Koichi Wakata      https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "5  Nanako Matsushima  https://en.wikipedia.org/wiki/Nanako_Matsushima   \n",
       "6         Miki Ishii         https://en.wikipedia.org/wiki/Miki_Ishii   \n",
       "7  Tsutomu Yamaguchi  https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi   \n",
       "8     Yoshiko Tanaka     https://en.wikipedia.org/wiki/Yoshiko_Tanaka   \n",
       "9      Masaaki Kanda      https://en.wikipedia.org/wiki/Masaaki_Kanda   \n",
       "\n",
       "        Group  Similarity  \n",
       "0     athlete    0.078431  \n",
       "1     athlete    0.078431  \n",
       "2    engineer    0.047619  \n",
       "3    engineer    0.047619  \n",
       "4    engineer    0.020833  \n",
       "5       actor    0.020408  \n",
       "6     athlete    0.020408  \n",
       "7    engineer    0.020202  \n",
       "8       actor    0.020000  \n",
       "9  politician    0.020000  "
      ]
     },
     "execution_count": 646,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 647,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0      [1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "1      [1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "2      [1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, ...\n",
      "3      [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4      [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "                             ...                        \n",
      "799    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "800    [0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, ...\n",
      "801    [0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, ...\n",
      "802    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "803    [0.0, 1.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, ...\n",
      "Name: embedding, Length: 804, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 648,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 804\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 649,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 804\n",
      "Mean similarity: 0.9269550323486329\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 650,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Sekinari Nii</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sekinari_Nii</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.806097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Masanao Ozaki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masanao_Ozaki</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.770171</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Shoichiro Irimajiri</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shoichiro_Irimajiri</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.741080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.738577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Haruka Shimazaki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Shimazaki</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.724190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Zenbee_Mizoguchi</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.700433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.691107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuya_Kitamura</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.687687</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Hideo Kobayashi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hideo_Kobayashi_...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.685692</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Masami Nagasawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masami_Nagasawa</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.667810</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Article                                                URL  \\\n",
       "0         Sekinari Nii         https://en.wikipedia.org/wiki/Sekinari_Nii   \n",
       "1        Masanao Ozaki        https://en.wikipedia.org/wiki/Masanao_Ozaki   \n",
       "2  Shoichiro Irimajiri  https://en.wikipedia.org/wiki/Shoichiro_Irimajiri   \n",
       "3         Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "4     Haruka Shimazaki     https://en.wikipedia.org/wiki/Haruka_Shimazaki   \n",
       "5     Zenbee Mizoguchi     https://en.wikipedia.org/wiki/Zenbee_Mizoguchi   \n",
       "6        Kaoru Hoshino        https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "7     Katsuya Kitamura     https://en.wikipedia.org/wiki/Katsuya_Kitamura   \n",
       "8      Hideo Kobayashi  https://en.wikipedia.org/wiki/Hideo_Kobayashi_...   \n",
       "9      Masami Nagasawa      https://en.wikipedia.org/wiki/Masami_Nagasawa   \n",
       "\n",
       "        Group  Similarity  \n",
       "0  politician    0.806097  \n",
       "1  politician    0.770171  \n",
       "2    engineer    0.741080  \n",
       "3  politician    0.738577  \n",
       "4       actor    0.724190  \n",
       "5  politician    0.700433  \n",
       "6    engineer    0.691107  \n",
       "7     athlete    0.687687  \n",
       "8     athlete    0.685692  \n",
       "9       actor    0.667810  "
      ]
     },
     "execution_count": 650,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 651,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nanako Matsushima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nanako_Matsushima</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hiroaki Ōishi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroaki_Ohishi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Masami Nagasawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masami_Nagasawa</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Rie Urata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Rie_Urata</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.916667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Yojiro Terada</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yojiro_Terada</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.916667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Toranosuke Katayama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Toranosuke_Katayama</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.908248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Yōhei Kōno</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Y%C5%8Dhei_K%C5%...</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.908248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Rina Kawaei</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Rina_Kawaei</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.908248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Hiroshi Fushida</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Fushida</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.885758</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Article                                                URL  \\\n",
       "0       Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "1    Nanako Matsushima    https://en.wikipedia.org/wiki/Nanako_Matsushima   \n",
       "2        Hiroaki Ōishi       https://en.wikipedia.org/wiki/Hiroaki_Ohishi   \n",
       "3      Masami Nagasawa      https://en.wikipedia.org/wiki/Masami_Nagasawa   \n",
       "4            Rie Urata            https://en.wikipedia.org/wiki/Rie_Urata   \n",
       "5        Yojiro Terada        https://en.wikipedia.org/wiki/Yojiro_Terada   \n",
       "6  Toranosuke Katayama  https://en.wikipedia.org/wiki/Toranosuke_Katayama   \n",
       "7           Yōhei Kōno  https://en.wikipedia.org/wiki/Y%C5%8Dhei_K%C5%...   \n",
       "8          Rina Kawaei          https://en.wikipedia.org/wiki/Rina_Kawaei   \n",
       "9      Hiroshi Fushida      https://en.wikipedia.org/wiki/Hiroshi_Fushida   \n",
       "\n",
       "        Group  Similarity  \n",
       "0    engineer    0.956435  \n",
       "1       actor    0.956435  \n",
       "2     athlete    0.956435  \n",
       "3       actor    0.956435  \n",
       "4     athlete    0.916667  \n",
       "5    engineer    0.916667  \n",
       "6  politician    0.908248  \n",
       "7  politician    0.908248  \n",
       "8       actor    0.908248  \n",
       "9    engineer    0.885758  "
      ]
     },
     "execution_count": 651,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 652,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
