{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA = \"DNP\" # DNP or WIKI\n",
    "MODE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "URL = \"\" # input data\n",
    "TEST = \"\" # test data\n",
    "name = \"\" # name of query data\n",
    "url_input = \"\" # query data\n",
    "if DATA == \"DNP\":\n",
    "    if MODE == \"TXT\":\n",
    "        URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        TEST = \"B-1.txt\"\n",
    "        name = \"C-1\"\n",
    "        url_input = URL + name + \".txt\"\n",
    "    elif MODE == \"URL\":\n",
    "        URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "        input = {\n",
    "        \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "        \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "        \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "        \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "        }\n",
    "        name = \"C-1\"\n",
    "        url_input = input[name]\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "    name = \"Thierry Henry\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Barack_Obama\"    \n",
    "    name = \"Joe Biden\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA == \"DNP\" and MODE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>130</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        130                  100"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\" and MODE == \"TXT\":\n",
    "    # # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "    #         body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name})\n",
    "\n",
    "    content = \"\"\n",
    "    with open(url_input, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (i:Input {{ name: \"{name}\", url: \"{url_input}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "\n",
    "else:\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: $url_input})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name, \"url_input\": url_input})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(i.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[パッケージ, 内容物, 以下, CO2排出量, 本社, 製品, 削減]</td>\n",
       "      <td>0.097526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[パッケージ, 以下, CO2排出量, 実現, CO2, 本社, 製品, こと, 開発, 製...</td>\n",
       "      <td>0.035080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[環境配慮型, CO2排出量, 実現, CO2, 製品, こと, 開発, 製造, 製造工程,...</td>\n",
       "      <td>0.032132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 実現, 製品, こと, 削減, 社会]</td>\n",
       "      <td>0.022266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, 本社, こと, 多く, 東京都]</td>\n",
       "      <td>0.019166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 実現, CO2, 本社, 削減]</td>\n",
       "      <td>0.017291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[実現, 製品, 開発, 製造, ブース, 社会]</td>\n",
       "      <td>0.016872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, ニュースリリース, 本社, 製品, こと, 開発, 製造]</td>\n",
       "      <td>0.014972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-97</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-97.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製品, こと, 開発, 製造, 社会]</td>\n",
       "      <td>0.014649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[環境配慮型, パッケージ, CO2排出量, ステークホルダー, 実現, 製品, ブース, ...</td>\n",
       "      <td>0.014466</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8    B-97  data/newsrelease_B-1-100_C-1-4/B-97.txt  None   None   \n",
       "9    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0               [パッケージ, 内容物, 以下, CO2排出量, 本社, 製品, 削減]    0.097526  \n",
       "1  [パッケージ, 以下, CO2排出量, 実現, CO2, 本社, 製品, こと, 開発, 製...    0.035080  \n",
       "2  [環境配慮型, CO2排出量, 実現, CO2, 製品, こと, 開発, 製造, 製造工程,...    0.032132  \n",
       "3                       [CO2排出量, 実現, 製品, こと, 削減, 社会]    0.022266  \n",
       "4                              [以下, 本社, こと, 多く, 東京都]    0.019166  \n",
       "5                      [以下, CO2排出量, 実現, CO2, 本社, 削減]    0.017291  \n",
       "6                          [実現, 製品, 開発, 製造, ブース, 社会]    0.016872  \n",
       "7                 [以下, ニュースリリース, 本社, 製品, こと, 開発, 製造]    0.014972  \n",
       "8                               [製品, こと, 開発, 製造, 社会]    0.014649  \n",
       "9  [環境配慮型, パッケージ, CO2排出量, ステークホルダー, 実現, 製品, ブース, ...    0.014466  "
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-21</td>\n",
       "      <td>[MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>0.666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-21</td>\n",
       "      <td>[MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>サービス</td>\n",
       "      <td>14</td>\n",
       "      <td>30</td>\n",
       "      <td>0.052381</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-21</td>\n",
       "      <td>[MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>出版</td>\n",
       "      <td>16</td>\n",
       "      <td>11</td>\n",
       "      <td>0.076705</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-21</td>\n",
       "      <td>[MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>コンテンツ</td>\n",
       "      <td>18</td>\n",
       "      <td>40</td>\n",
       "      <td>0.040278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-21</td>\n",
       "      <td>[MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>サービス</td>\n",
       "      <td>14</td>\n",
       "      <td>30</td>\n",
       "      <td>0.052381</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81741</th>\n",
       "      <td>B-24</td>\n",
       "      <td>[警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>こと</td>\n",
       "      <td>72</td>\n",
       "      <td>30</td>\n",
       "      <td>0.023611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81742</th>\n",
       "      <td>B-24</td>\n",
       "      <td>[警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>こと</td>\n",
       "      <td>72</td>\n",
       "      <td>30</td>\n",
       "      <td>0.023611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81743</th>\n",
       "      <td>B-24</td>\n",
       "      <td>[警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>活用</td>\n",
       "      <td>97</td>\n",
       "      <td>56</td>\n",
       "      <td>0.014083</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81744</th>\n",
       "      <td>B-24</td>\n",
       "      <td>[警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>事業</td>\n",
       "      <td>41</td>\n",
       "      <td>47</td>\n",
       "      <td>0.022833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81745</th>\n",
       "      <td>B-24</td>\n",
       "      <td>[警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>こと</td>\n",
       "      <td>72</td>\n",
       "      <td>30</td>\n",
       "      <td>0.023611</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>81746 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      a1.name                             a1.phrase[0..$nphrase] a2.name  \\\n",
       "0        B-21  [MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...     B-1   \n",
       "1        B-21  [MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...     B-1   \n",
       "2        B-21  [MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...     B-1   \n",
       "3        B-21  [MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...     B-1   \n",
       "4        B-21  [MOES, マンガ, DNP, 制作, マンガ制作, マンガ多, 着彩, マンガAI着彩機...     B-1   \n",
       "...       ...                                                ...     ...   \n",
       "81741    B-24  [警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...   B-100   \n",
       "81742    B-24  [警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...   B-100   \n",
       "81743    B-24  [警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...   B-100   \n",
       "81744    B-24  [警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...   B-100   \n",
       "81745    B-24  [警視庁サイバーセキュリティセンター, サイバーセキュリティ, DNP, 学習コンテンツ, ...   B-100   \n",
       "\n",
       "                                  a2.phrase[0..$nphrase] commonValue  rank1  \\\n",
       "0      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...         DNP      3   \n",
       "1      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...        サービス     14   \n",
       "2      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...          出版     16   \n",
       "3      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...       コンテンツ     18   \n",
       "4      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...        サービス     14   \n",
       "...                                                  ...         ...    ...   \n",
       "81741  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          こと     72   \n",
       "81742  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          こと     72   \n",
       "81743  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          活用     97   \n",
       "81744  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          事業     41   \n",
       "81745  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          こと     72   \n",
       "\n",
       "       rank2  Similarity  \n",
       "0          1    0.666667  \n",
       "1         30    0.052381  \n",
       "2         11    0.076705  \n",
       "3         40    0.040278  \n",
       "4         30    0.052381  \n",
       "...      ...         ...  \n",
       "81741     30    0.023611  \n",
       "81742     30    0.023611  \n",
       "81743     56    0.014083  \n",
       "81744     47    0.022833  \n",
       "81745     30    0.023611  \n",
       "\n",
       "[81746 rows x 8 columns]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...</td>\n",
       "      <td>0.791611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...</td>\n",
       "      <td>0.657581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...</td>\n",
       "      <td>0.603284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...</td>\n",
       "      <td>0.498526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...</td>\n",
       "      <td>0.352651</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...</td>\n",
       "      <td>0.311805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...</td>\n",
       "      <td>0.285290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]</td>\n",
       "      <td>0.267355</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...</td>\n",
       "      <td>0.255479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]</td>\n",
       "      <td>0.224865</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "2    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "7    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...    0.791611  \n",
       "1  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...    0.657581  \n",
       "2  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...    0.603284  \n",
       "3  [CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...    0.498526  \n",
       "4  [本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...    0.352651  \n",
       "5  [CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...    0.311805  \n",
       "6  [CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...    0.285290  \n",
       "7              [製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]    0.267355  \n",
       "8  [CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...    0.255479  \n",
       "9           [削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]    0.224865  "
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 76 ms\n",
      "Graph 'testgraph' node count: 4865\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 16870\n",
      "Graph 'testgraph' degree distribution: p99     255.000000\n",
      "min       0.000000\n",
      "max     294.000000\n",
      "p90       9.000000\n",
      "mean     10.402878\n",
      "p999    282.000000\n",
      "p50       3.000000\n",
      "p95      21.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.0007129165088981446\n",
      "Graph 'testgraph' size in bytes: 32977663\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.052716946601867674\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.068744</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.056868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.054220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049209</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.044348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.043223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.042806</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.040320</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.078200\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.068744\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.056868\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.054220\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.049231\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.049209\n",
       "6    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.044348\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.043223\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.042806\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.040320"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.103843355178833\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.154895</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.130541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.108577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.105455</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.101315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.094739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.079883</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.154895\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.130541\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.108577\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.105455\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.101315\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.094739\n",
       "6    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.087920\n",
       "7    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.087677\n",
       "8    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.087433\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.079883"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.11493463516235351\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.158508</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.156205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.132661</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.112778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.111239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.100785</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093086</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.091310</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.158508\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.156205\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.132661\n",
       "3    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.112778\n",
       "4    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.111239\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.100785\n",
       "6    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.098992\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.093783\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.093086\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.091310"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "1       [1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "2       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "3       [1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "                              ...                        \n",
      "4860    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4861    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4862    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4863    [0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4864    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 4865, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4865\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 4865\n",
      "Mean similarity: 0.9657943725585938\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-94</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-94.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.457417</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-76</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-76.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.424621</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.417481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-92</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-92.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.368181</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-94  data/newsrelease_B-1-100_C-1-4/B-94.txt  None   None    0.457417\n",
       "1    B-76  data/newsrelease_B-1-100_C-1-4/B-76.txt  None   None    0.424621\n",
       "2    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None    0.417481\n",
       "3    B-92  data/newsrelease_B-1-100_C-1-4/B-92.txt  None   None    0.368181"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.865252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.842092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-47</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-47.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.790112</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-41</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-41.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.788358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-31</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-31.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.754359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-30</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-30.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.751976</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-76</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-76.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.710796</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-83</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-83.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.693320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-67</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-67.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.674277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-94</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-94.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.650564</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.865252\n",
       "1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.842092\n",
       "2    B-47  data/newsrelease_B-1-100_C-1-4/B-47.txt  None   None    0.790112\n",
       "3    B-41  data/newsrelease_B-1-100_C-1-4/B-41.txt  None   None    0.788358\n",
       "4    B-31  data/newsrelease_B-1-100_C-1-4/B-31.txt  None   None    0.754359\n",
       "5    B-30  data/newsrelease_B-1-100_C-1-4/B-30.txt  None   None    0.751976\n",
       "6    B-76  data/newsrelease_B-1-100_C-1-4/B-76.txt  None   None    0.710796\n",
       "7    B-83  data/newsrelease_B-1-100_C-1-4/B-83.txt  None   None    0.693320\n",
       "8    B-67  data/newsrelease_B-1-100_C-1-4/B-67.txt  None   None    0.674277\n",
       "9    B-94  data/newsrelease_B-1-100_C-1-4/B-94.txt  None   None    0.650564"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-44</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-44.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-93</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-93.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.962910</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-82</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-82.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-43</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-43.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-22</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-22.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-87</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-87.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-21</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-21.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-55</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-55.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-54</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-54.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-44  data/newsrelease_B-1-100_C-1-4/B-44.txt  None   None    1.000000\n",
       "1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    1.000000\n",
       "2    B-93  data/newsrelease_B-1-100_C-1-4/B-93.txt  None   None    0.962910\n",
       "3    B-82  data/newsrelease_B-1-100_C-1-4/B-82.txt  None   None    0.956435\n",
       "4    B-43  data/newsrelease_B-1-100_C-1-4/B-43.txt  None   None    0.956435\n",
       "5    B-22  data/newsrelease_B-1-100_C-1-4/B-22.txt  None   None    0.956435\n",
       "6    B-87  data/newsrelease_B-1-100_C-1-4/B-87.txt  None   None    0.956435\n",
       "7    B-21  data/newsrelease_B-1-100_C-1-4/B-21.txt  None   None    0.956435\n",
       "8    B-55  data/newsrelease_B-1-100_C-1-4/B-55.txt  None   None    0.956435\n",
       "9    B-54  data/newsrelease_B-1-100_C-1-4/B-54.txt  None   None    0.956435"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
