{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 943,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 944,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 944,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 10 # number of nouns extracted from each article\n",
    "DATA = \"WIKI_P100\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "name = \"\"\n",
    "url_input = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "    name = \"Test\"\n",
    "    url_input = \"test.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "    name = \"Thierry Henry\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Barack_Obama\"    \n",
    "    name = \"Joe Biden\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 945,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 946,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 947,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 948,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 949,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20</td>\n",
       "      <td>100</td>\n",
       "      <td>8</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       20    100          8                  100"
      ]
     },
     "execution_count": 949,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "  SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "  SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 950,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>287</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        287                  100"
      ]
     },
     "execution_count": 950,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 951,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 951,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 952,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 953,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 953,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA.startswith(\"WIKI\"):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: $url_input})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name, \"url_input\": url_input})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(i.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 954,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate]</td>\n",
       "      <td>0.100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama]</td>\n",
       "      <td>0.083333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama]</td>\n",
       "      <td>0.041667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Latin American]</td>\n",
       "      <td>0.027778</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "2     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "3      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "4  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1                                Common  \\\n",
       "0  politician  United States of America  [United States Senate, Barack Obama]   \n",
       "1  politician  United States of America                [United States Senate]   \n",
       "2  politician  United States of America                        [Barack Obama]   \n",
       "3  politician  United States of America                        [Barack Obama]   \n",
       "4  politician  United States of America                      [Latin American]   \n",
       "\n",
       "   Similarity  \n",
       "0    0.333333  \n",
       "1    0.100000  \n",
       "2    0.083333  \n",
       "3    0.041667  \n",
       "4    0.027778  "
      ]
     },
     "execution_count": 954,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 955,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 955,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 956,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Roy Walter Riehlman</td>\n",
       "      <td>[Roy Walter Riehlman, member, Tully, New York,...</td>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>[The Political Obituary of Richard M. Nixon, D...</td>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>8</td>\n",
       "      <td>2</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Mark Sanford</td>\n",
       "      <td>[Marshall Clement ``Mark'' Sanford Jr., South ...</td>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>[The Political Obituary of Richard M. Nixon, D...</td>\n",
       "      <td>Congress</td>\n",
       "      <td>9</td>\n",
       "      <td>4</td>\n",
       "      <td>0.180556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ayame Goriki</td>\n",
       "      <td>[Ayame Goriki, Oscar Promotion, model, Short C...</td>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>[Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>8</td>\n",
       "      <td>2</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Akio Morita</td>\n",
       "      <td>[Akio Morita, Sony, Masaru Ibuka, radio, Japan...</td>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>[Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Shinichiro Sakurai</td>\n",
       "      <td>[Shinichiro Sakurai, automotive industry, Saku...</td>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>[Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>0.350000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3063</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>[George Walker Bush, presidency, presidency, B...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>5</td>\n",
       "      <td>4</td>\n",
       "      <td>0.225000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3064</th>\n",
       "      <td>Todd Whitting</td>\n",
       "      <td>[Todd Ross Whitting, player, American, head co...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3065</th>\n",
       "      <td>Charles Thias</td>\n",
       "      <td>[Charles Henry Robert Thias, Southwest Turnver...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>7</td>\n",
       "      <td>4</td>\n",
       "      <td>0.196429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3066</th>\n",
       "      <td>Wally Albright</td>\n",
       "      <td>[Wally Albright, water sportsman, businessman,...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>5</td>\n",
       "      <td>4</td>\n",
       "      <td>0.225000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3067</th>\n",
       "      <td>Abraham Lincoln</td>\n",
       "      <td>[Abraham Lincoln, Stephen A. Douglas, Union, R...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>9</td>\n",
       "      <td>4</td>\n",
       "      <td>0.180556</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3068 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  a1.name                             a1.phrase[0..$nphrase]  \\\n",
       "0     Roy Walter Riehlman  [Roy Walter Riehlman, member, Tully, New York,...   \n",
       "1            Mark Sanford  [Marshall Clement ``Mark'' Sanford Jr., South ...   \n",
       "2            Ayame Goriki  [Ayame Goriki, Oscar Promotion, model, Short C...   \n",
       "3             Akio Morita  [Akio Morita, Sony, Masaru Ibuka, radio, Japan...   \n",
       "4      Shinichiro Sakurai  [Shinichiro Sakurai, automotive industry, Saku...   \n",
       "...                   ...                                                ...   \n",
       "3063       George W. Bush  [George Walker Bush, presidency, presidency, B...   \n",
       "3064        Todd Whitting  [Todd Ross Whitting, player, American, head co...   \n",
       "3065        Charles Thias  [Charles Henry Robert Thias, Southwest Turnver...   \n",
       "3066       Wally Albright  [Wally Albright, water sportsman, businessman,...   \n",
       "3067      Abraham Lincoln  [Abraham Lincoln, Stephen A. Douglas, Union, R...   \n",
       "\n",
       "              a2.name                             a2.phrase[0..$nphrase]  \\\n",
       "0       Richard Nixon  [The Political Obituary of Richard M. Nixon, D...   \n",
       "1       Richard Nixon  [The Political Obituary of Richard M. Nixon, D...   \n",
       "2     Hiroshi Masuoka  [Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...   \n",
       "3     Hiroshi Masuoka  [Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...   \n",
       "4     Hiroshi Masuoka  [Hiroshi Masuoka, Japanese, 2009 Dakar Rally, ...   \n",
       "...               ...                                                ...   \n",
       "3063  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "3064  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "3065  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "3066  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "3067  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "\n",
       "               commonValue  rank1  rank2  Similarity  \n",
       "0     Dwight D. Eisenhower      8      2    0.312500  \n",
       "1                 Congress      9      4    0.180556  \n",
       "2                 Japanese      8      2    0.312500  \n",
       "3                 Japanese      6      2    0.333333  \n",
       "4                 Japanese      5      2    0.350000  \n",
       "...                    ...    ...    ...         ...  \n",
       "3063              American      5      4    0.225000  \n",
       "3064              American      3      4    0.291667  \n",
       "3065              American      7      4    0.196429  \n",
       "3066              American      5      4    0.225000  \n",
       "3067              American      9      4    0.180556  \n",
       "\n",
       "[3068 rows x 8 columns]"
      ]
     },
     "execution_count": 956,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 957,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama]</td>\n",
       "      <td>0.467595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate]</td>\n",
       "      <td>0.051510</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama]</td>\n",
       "      <td>0.012120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama]</td>\n",
       "      <td>0.011422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Latin American]</td>\n",
       "      <td>0.004580</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "2     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "3      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "4  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1                              r.common  \\\n",
       "0  politician  United States of America  [United States Senate, Barack Obama]   \n",
       "1  politician  United States of America                [United States Senate]   \n",
       "2  politician  United States of America                        [Barack Obama]   \n",
       "3  politician  United States of America                        [Barack Obama]   \n",
       "4  politician  United States of America                      [Latin American]   \n",
       "\n",
       "   Similarity  \n",
       "0    0.467595  \n",
       "1    0.051510  \n",
       "2    0.012120  \n",
       "3    0.011422  \n",
       "4    0.004580  "
      ]
     },
     "execution_count": 957,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 958,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 9 ms\n",
      "Graph 'testgraph' node count: 868\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 1970\n",
      "Graph 'testgraph' degree distribution: p99      30.000000\n",
      "min       3.000000\n",
      "max     117.000000\n",
      "p90      27.000000\n",
      "mean      6.808756\n",
      "p50       3.000000\n",
      "p999    117.000000\n",
      "p95      30.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.002617745390376264\n",
      "Graph 'testgraph' size in bytes: 6616715\n",
      "Graph 'testgraph' memory_usage: 6461 KiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 959,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 5\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.07544918060302734\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 960,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.170213</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.073684</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.057692</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.028037</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "3  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "4      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.170213  \n",
       "1  politician  United States of America    0.073684  \n",
       "2  politician  United States of America    0.057692  \n",
       "3  politician  United States of America    0.047619  \n",
       "4  politician  United States of America    0.028037  "
      ]
     },
     "execution_count": 960,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 961,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 5\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.1388782501220703\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 962,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.290909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.148936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.109091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.090909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.054545</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "3  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "4      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.290909  \n",
       "1  politician  United States of America    0.148936  \n",
       "2  politician  United States of America    0.109091  \n",
       "3  politician  United States of America    0.090909  \n",
       "4  politician  United States of America    0.054545  "
      ]
     },
     "execution_count": 962,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 963,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 5\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.16017093658447265\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 964,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.374026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.159296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.140260</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.064935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.062338</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "3  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "4      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.374026  \n",
       "1  politician  United States of America    0.159296  \n",
       "2  politician  United States of America    0.140260  \n",
       "3  politician  United States of America    0.064935  \n",
       "4  politician  United States of America    0.062338  "
      ]
     },
     "execution_count": 964,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 965,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0      [-2.7744011878967285, -0.30493491888046265, 0....\n",
      "1      [-1.5578213930130005, -0.011470677331089973, 0...\n",
      "2      [-1.661454439163208, 0.6588519215583801, 0.483...\n",
      "3      [-1.616807222366333, 0.38175928592681885, -0.2...\n",
      "4      [-0.829533576965332, 0.9676360487937927, 0.142...\n",
      "                             ...                        \n",
      "863    [-1.1448423862457275, 0.8694884181022644, 0.71...\n",
      "864    [-1.0979461669921875, 0.8633883595466614, 0.76...\n",
      "865    [-1.0041391849517822, 0.6435492634773254, 0.58...\n",
      "866    [-0.9768794775009155, 0.5719609260559082, 0.64...\n",
      "867    [-0.8028375506401062, 0.5773894786834717, 0.60...\n",
      "Name: embedding, Length: 868, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# # hashgnn\n",
    "# result = gds.beta.hashgnn.stream(\n",
    "#     G,\n",
    "#     iterations = 3,\n",
    "#     embeddingDensity = 8,\n",
    "#     generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "#     randomSeed = 42,\n",
    "# )\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 966,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 868\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 967,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 868\n",
      "Mean similarity: 0.8510005950927735\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 968,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.814627</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>David Paterson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/David_Paterson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.795460</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.749076</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Etsunobu Ebisu</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Etsunobu_Ebisu</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.729395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.714621</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Eizaburo Nishibori</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Eizaburo_Nishibori</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.693036</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Aaron Links</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aaron_Links</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.690772</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sakura Miyawaki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sakura_Miyawaki</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.683394</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mayu_Watanabe</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.682533</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Fumihiko Imamura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumihiko_Imamura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.675535</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              Article                                                URL  \\\n",
       "0     Hiroshi Masuoka  https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...   \n",
       "1      David Paterson       https://en.wikipedia.org/wiki/David_Paterson   \n",
       "2   Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "3      Etsunobu Ebisu       https://en.wikipedia.org/wiki/Etsunobu_Ebisu   \n",
       "4      George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "5  Eizaburo Nishibori   https://en.wikipedia.org/wiki/Eizaburo_Nishibori   \n",
       "6         Aaron Links          https://en.wikipedia.org/wiki/Aaron_Links   \n",
       "7     Sakura Miyawaki      https://en.wikipedia.org/wiki/Sakura_Miyawaki   \n",
       "8       Mayu Watanabe        https://en.wikipedia.org/wiki/Mayu_Watanabe   \n",
       "9    Fumihiko Imamura     https://en.wikipedia.org/wiki/Fumihiko_Imamura   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0    engineer                     Japan    0.814627  \n",
       "1  politician  United States of America    0.795460  \n",
       "2  politician  United States of America    0.749076  \n",
       "3    engineer                     Japan    0.729395  \n",
       "4  politician  United States of America    0.714621  \n",
       "5    engineer                     Japan    0.693036  \n",
       "6     athlete  United States of America    0.690772  \n",
       "7       actor                     Japan    0.683394  \n",
       "8       actor                     Japan    0.682533  \n",
       "9    engineer                     Japan    0.675535  "
      ]
     },
     "execution_count": 968,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 969,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.947761</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.929350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.906920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.904206</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.900500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.865825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>George Pataki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_Pataki</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.846691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.822047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Aaron Links</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aaron_Links</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.803167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Masaru Ibuka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaru_Ibuka</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.786106</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "2     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "3  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "4      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "5       Barack Obama       https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "6      George Pataki      https://en.wikipedia.org/wiki/George_Pataki   \n",
       "7        Gerald Ford        https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "8        Aaron Links        https://en.wikipedia.org/wiki/Aaron_Links   \n",
       "9       Masaru Ibuka       https://en.wikipedia.org/wiki/Masaru_Ibuka   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.947761  \n",
       "1  politician  United States of America    0.929350  \n",
       "2  politician  United States of America    0.906920  \n",
       "3  politician  United States of America    0.904206  \n",
       "4  politician  United States of America    0.900500  \n",
       "5  politician  United States of America    0.865825  \n",
       "6  politician  United States of America    0.846691  \n",
       "7  politician  United States of America    0.822047  \n",
       "8     athlete  United States of America    0.803167  \n",
       "9    engineer                     Japan    0.786106  "
      ]
     },
     "execution_count": 969,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 970,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Natsuna Watanabe</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Natsuna_Watanabe</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.900000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George Pataki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_Pataki</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.900000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.895285</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Alberto_Salazar</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.865148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Aya Matsuura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aya_Matsuura</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.838062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Masaru Ibuka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaru_Ibuka</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.838062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Stan Bowman</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stan_Bowman</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.838062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Tom Lichtenberg</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tom_Lichtenberg</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.835410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Tom Higgins</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tom_Higgins_(roc...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Yukina Kashiwa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yukina_Kashiwa</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Natsuna Watanabe     https://en.wikipedia.org/wiki/Natsuna_Watanabe   \n",
       "1     George Pataki        https://en.wikipedia.org/wiki/George_Pataki   \n",
       "2   Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "3   Alberto Salazar      https://en.wikipedia.org/wiki/Alberto_Salazar   \n",
       "4      Aya Matsuura         https://en.wikipedia.org/wiki/Aya_Matsuura   \n",
       "5      Masaru Ibuka         https://en.wikipedia.org/wiki/Masaru_Ibuka   \n",
       "6       Stan Bowman          https://en.wikipedia.org/wiki/Stan_Bowman   \n",
       "7   Tom Lichtenberg      https://en.wikipedia.org/wiki/Tom_Lichtenberg   \n",
       "8       Tom Higgins  https://en.wikipedia.org/wiki/Tom_Higgins_(roc...   \n",
       "9    Yukina Kashiwa       https://en.wikipedia.org/wiki/Yukina_Kashiwa   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0       actor                     Japan    0.900000  \n",
       "1  politician  United States of America    0.900000  \n",
       "2  politician  United States of America    0.895285  \n",
       "3     athlete  United States of America    0.865148  \n",
       "4       actor                     Japan    0.838062  \n",
       "5    engineer                     Japan    0.838062  \n",
       "6     athlete  United States of America    0.838062  \n",
       "7     athlete  United States of America    0.835410  \n",
       "8     athlete  United States of America    0.800000  \n",
       "9       actor                     Japan    0.800000  "
      ]
     },
     "execution_count": 970,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 971,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
