{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA_CLASS = \"DNP\" # DNP or WIKI\n",
    "DATA_TYPE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "DATA_URL = \"\" # input data\n",
    "QUERY_DICT = {} # query dict {QUERY_NAME: QUERY_URL}\n",
    "if DATA_CLASS == \"DNP\":\n",
    "    if DATA_TYPE == \"TXT\":\n",
    "        DATA_URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        QUERY_DICT[\"C-1\"] = DATA_URL + \"C-1.txt\"\n",
    "        QUERY_DICT[\"C-2\"] = DATA_URL + \"C-2.txt\"\n",
    "        QUERY_DICT[\"C-3\"] = DATA_URL + \"C-3.txt\"\n",
    "        QUERY_DICT[\"C-4\"] = DATA_URL + \"C-4.txt\"\n",
    "    elif DATA_TYPE == \"URL\":\n",
    "        DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        QUERY_DICT[\"C-1\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\"\n",
    "        QUERY_DICT[\"C-2\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\"\n",
    "        QUERY_DICT[\"C-3\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\"\n",
    "        QUERY_DICT[\"C-4\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "elif DATA_CLASS == \"WIKI_FP100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    QUERY_DICT[\"Thierry Henry\"] = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA_CLASS == \"WIKI_P100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"  \n",
    "    QUERY_DICT[\"Joe Biden\"] = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = DATA_URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{DATA_URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>94</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100         94                  100"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    content = \"\"\n",
    "    with open(QUERY_URL, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (q:Query {{ name: \"{QUERY_NAME}\", url: \"{QUERY_URL}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    query = \"\"\"\n",
    "    MERGE (q:Query {name: $name, url: $url})\n",
    "    WITH q\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH q,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET q.body = body, q.title = title\n",
    "    RETURN q.title, q.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": QUERY_NAME, \"url\": QUERY_URL})\n",
    "    \n",
    "# set phrase and salience properties (Query)\n",
    "query = f\"\"\"\n",
    "MATCH (q:Query)\n",
    "CALL apoc.nlp.gcp.entities.stream(q, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (Query)\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)\n",
    "WHERE q.processed IS NOT NULL\n",
    "FOREACH (word IN q.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (q)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(q.phrase, word) + 1\n",
    "  SET r.score = q.salience[apoc.coll.indexOf(q.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(q.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 削減, 内容物, パッケージ, 製品]</td>\n",
       "      <td>0.097526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 製造, 削減, CO2, 実現, 社会, パッケージ, 製...</td>\n",
       "      <td>0.035080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 製造, 削減, CO2, 同等, 製造工程, 実現, 環境配慮型, 製品,...</td>\n",
       "      <td>0.032132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, 実現, 社会, 製品, こと]</td>\n",
       "      <td>0.022266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[多く, 以下, 本社, 東京都, こと]</td>\n",
       "      <td>0.019166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 削減, CO2, 実現]</td>\n",
       "      <td>0.017291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 実現, 社会, ブース, 製品, 開発]</td>\n",
       "      <td>0.016868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, 本社, 製造, ニュースリリース, 製品, こと, 開発]</td>\n",
       "      <td>0.014972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-97</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-97.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 社会, 製品, こと, 開発]</td>\n",
       "      <td>0.014649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[多く, ステークホルダー, CO2排出量, 削減, 実現, 環境配慮型, 社会, 幕張メッ...</td>\n",
       "      <td>0.014466</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8    B-97  data/newsrelease_B-1-100_C-1-4/B-97.txt  None   None   \n",
       "9    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0               [以下, CO2排出量, 本社, 削減, 内容物, パッケージ, 製品]    0.097526  \n",
       "1  [以下, CO2排出量, 本社, 製造, 削減, CO2, 実現, 社会, パッケージ, 製...    0.035080  \n",
       "2  [CO2排出量, 製造, 削減, CO2, 同等, 製造工程, 実現, 環境配慮型, 製品,...    0.032132  \n",
       "3                       [CO2排出量, 削減, 実現, 社会, 製品, こと]    0.022266  \n",
       "4                              [多く, 以下, 本社, 東京都, こと]    0.019166  \n",
       "5                      [以下, CO2排出量, 本社, 削減, CO2, 実現]    0.017291  \n",
       "6                          [製造, 実現, 社会, ブース, 製品, 開発]    0.016868  \n",
       "7                 [以下, 本社, 製造, ニュースリリース, 製品, こと, 開発]    0.014972  \n",
       "8                               [製造, 社会, 製品, こと, 開発]    0.014649  \n",
       "9  [多く, ステークホルダー, CO2排出量, 削減, 実現, 環境配慮型, 社会, 幕張メッ...    0.014466  "
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#query\n",
    "query = \"\"\"\n",
    "MATCH (q:Query), (a:Article)\n",
    "WHERE any(x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (q)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...</td>\n",
       "      <td>0.791611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...</td>\n",
       "      <td>0.657581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...</td>\n",
       "      <td>0.603284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...</td>\n",
       "      <td>0.498526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...</td>\n",
       "      <td>0.352651</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...</td>\n",
       "      <td>0.311805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...</td>\n",
       "      <td>0.285290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]</td>\n",
       "      <td>0.267355</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...</td>\n",
       "      <td>0.255479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]</td>\n",
       "      <td>0.224865</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "2    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "7    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...    0.791611  \n",
       "1  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...    0.657581  \n",
       "2  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...    0.603284  \n",
       "3  [CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...    0.498526  \n",
       "4  [本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...    0.352651  \n",
       "5  [CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...    0.311805  \n",
       "6  [CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...    0.285290  \n",
       "7              [製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]    0.267355  \n",
       "8  [CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...    0.255479  \n",
       "9           [削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]    0.224865  "
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + q.salience[apoc.coll.indexOf(q.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 64 ms\n",
      "Graph 'testgraph' node count: 4860\n",
      "Graph 'testgraph' node labels: ['Query', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 16870\n",
      "Graph 'testgraph' degree distribution: p99     255.00000\n",
      "min       3.00000\n",
      "max     294.00000\n",
      "p90       9.00000\n",
      "mean     10.41358\n",
      "p999    282.00000\n",
      "p50       3.00000\n",
      "p95      21.00000\n",
      "p75       3.00000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.000714384320979185\n",
      "Graph 'testgraph' size in bytes: 32977499\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Query\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Query\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.05262758731842041\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.068744</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.056868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.054220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.048316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.044348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.043223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.042806</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.040320</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.078200\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.068744\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.056868\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.054220\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.049231\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.048316\n",
       "6    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.044348\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.043223\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.042806\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.040320"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.10369725227355957\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.154895</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.130541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.108577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.105455</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.101315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.079883</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.154895\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.130541\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.108577\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.105455\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.101315\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.093278\n",
       "6    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.087920\n",
       "7    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.087677\n",
       "8    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.087433\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.079883"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.11475157737731934\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.158508</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.156205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.132661</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.112778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.111239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093086</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.091310</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.158508\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.156205\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.132661\n",
       "3    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.112778\n",
       "4    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.111239\n",
       "5    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.098992\n",
       "6    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.098955\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.093783\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.093086\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.091310"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, ...\n",
      "1       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "2       [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "                              ...                        \n",
      "4855    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4856    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4857    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4858    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4859    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "Name: embedding, Length: 4860, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4860\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 4860\n",
      "Mean similarity: 0.9400001525878906\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.920148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-7</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-7.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.772210</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-76</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-76.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.737279</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-15</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-15.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.731383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-10</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-10.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.700913</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-100</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-100.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.691759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-4</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-4.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.685134</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-38</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-38.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.642118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-74</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-74.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.529116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-43</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-43.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.466307</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                       URL Group Group1  Similarity\n",
       "0    B-71   data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.920148\n",
       "1     B-7    data/newsrelease_B-1-100_C-1-4/B-7.txt  None   None    0.772210\n",
       "2    B-76   data/newsrelease_B-1-100_C-1-4/B-76.txt  None   None    0.737279\n",
       "3    B-15   data/newsrelease_B-1-100_C-1-4/B-15.txt  None   None    0.731383\n",
       "4    B-10   data/newsrelease_B-1-100_C-1-4/B-10.txt  None   None    0.700913\n",
       "5   B-100  data/newsrelease_B-1-100_C-1-4/B-100.txt  None   None    0.691759\n",
       "6     B-4    data/newsrelease_B-1-100_C-1-4/B-4.txt  None   None    0.685134\n",
       "7    B-38   data/newsrelease_B-1-100_C-1-4/B-38.txt  None   None    0.642118\n",
       "8    B-74   data/newsrelease_B-1-100_C-1-4/B-74.txt  None   None    0.529116\n",
       "9    B-43   data/newsrelease_B-1-100_C-1-4/B-43.txt  None   None    0.466307"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.877493</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.872907</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-25</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-25.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.823174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.808106</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-9</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-9.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.770281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-77</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-77.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.769365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-100</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-100.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.699163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-96</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-96.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.692028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-69</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-69.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.683980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-40</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-40.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.674275</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                       URL Group Group1  Similarity\n",
       "0    B-19   data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.877493\n",
       "1    B-52   data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.872907\n",
       "2    B-25   data/newsrelease_B-1-100_C-1-4/B-25.txt  None   None    0.823174\n",
       "3    B-98   data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.808106\n",
       "4     B-9    data/newsrelease_B-1-100_C-1-4/B-9.txt  None   None    0.770281\n",
       "5    B-77   data/newsrelease_B-1-100_C-1-4/B-77.txt  None   None    0.769365\n",
       "6   B-100  data/newsrelease_B-1-100_C-1-4/B-100.txt  None   None    0.699163\n",
       "7    B-96   data/newsrelease_B-1-100_C-1-4/B-96.txt  None   None    0.692028\n",
       "8    B-69   data/newsrelease_B-1-100_C-1-4/B-69.txt  None   None    0.683980\n",
       "9    B-40   data/newsrelease_B-1-100_C-1-4/B-40.txt  None   None    0.674275"
      ]
     },
     "execution_count": 108,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-44</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-44.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-6</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-6.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-77</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-77.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-94</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-94.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-86</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-86.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-82</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-82.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-3</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-3.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-1</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-1.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-91</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-91.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-44  data/newsrelease_B-1-100_C-1-4/B-44.txt  None   None         1.0\n",
       "1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None         1.0\n",
       "2     B-6   data/newsrelease_B-1-100_C-1-4/B-6.txt  None   None         1.0\n",
       "3    B-77  data/newsrelease_B-1-100_C-1-4/B-77.txt  None   None         1.0\n",
       "4    B-94  data/newsrelease_B-1-100_C-1-4/B-94.txt  None   None         0.9\n",
       "5    B-86  data/newsrelease_B-1-100_C-1-4/B-86.txt  None   None         0.9\n",
       "6    B-82  data/newsrelease_B-1-100_C-1-4/B-82.txt  None   None         0.9\n",
       "7     B-3   data/newsrelease_B-1-100_C-1-4/B-3.txt  None   None         0.9\n",
       "8     B-1   data/newsrelease_B-1-100_C-1-4/B-1.txt  None   None         0.9\n",
       "9    B-91  data/newsrelease_B-1-100_C-1-4/B-91.txt  None   None         0.9"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
