{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 926,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 927,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 927,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA = \"WIKI_P100\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "name = \"\"\n",
    "url_input = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "    name = \"Test\"\n",
    "    url_input = \"test.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "    name = \"Thierry Henry\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Barack_Obama\"    \n",
    "    name = \"Joe Biden\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 928,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 929,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 930,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 931,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 932,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20</td>\n",
       "      <td>100</td>\n",
       "      <td>14</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       20    100         14                  100"
      ]
     },
     "execution_count": 932,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "  SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "  SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 933,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>279</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        279                  100"
      ]
     },
     "execution_count": 933,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 934,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 934,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 935,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 936,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 936,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA.startswith(\"WIKI\"):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: $url_input})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name, \"url_input\": url_input})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(i.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 937,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[family, voters, troops, Donald Trump, campaig...</td>\n",
       "      <td>0.356167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Latin American, family, student, government, ...</td>\n",
       "      <td>0.124941</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[U.S. Congress, law, member, troops, administr...</td>\n",
       "      <td>0.111314</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[decision, politics, U.S. Congress, law, John ...</td>\n",
       "      <td>0.048214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[U.S. Congress, family, Democratic Party, memb...</td>\n",
       "      <td>0.044671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[President, law, family, first, campaign, pres...</td>\n",
       "      <td>0.043997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Latin American, law, politician, vice preside...</td>\n",
       "      <td>0.035194</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Andrew Cuomo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Andrew_Cuomo</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Democratic Party, administration, campaign, B...</td>\n",
       "      <td>0.033422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[decision, politics, law, Jimmy Carter, United...</td>\n",
       "      <td>0.032485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[President, Democratic Party, member, administ...</td>\n",
       "      <td>0.029319</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "2     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "3       Barack Obama       https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "4    Hillary Clinton    https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "5      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "6  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "7       Andrew Cuomo       https://en.wikipedia.org/wiki/Andrew_Cuomo   \n",
       "8     Stephen Breyer     https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "9       Bill Clinton       https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "\n",
       "        Group                    Group1  \\\n",
       "0  politician  United States of America   \n",
       "1  politician  United States of America   \n",
       "2  politician  United States of America   \n",
       "3  politician  United States of America   \n",
       "4  politician  United States of America   \n",
       "5  politician  United States of America   \n",
       "6  politician  United States of America   \n",
       "7  politician  United States of America   \n",
       "8  politician  United States of America   \n",
       "9  politician  United States of America   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0  [family, voters, troops, Donald Trump, campaig...    0.356167  \n",
       "1  [Latin American, family, student, government, ...    0.124941  \n",
       "2  [U.S. Congress, law, member, troops, administr...    0.111314  \n",
       "3  [decision, politics, U.S. Congress, law, John ...    0.048214  \n",
       "4  [U.S. Congress, family, Democratic Party, memb...    0.044671  \n",
       "5  [President, law, family, first, campaign, pres...    0.043997  \n",
       "6  [Latin American, law, politician, vice preside...    0.035194  \n",
       "7  [Democratic Party, administration, campaign, B...    0.033422  \n",
       "8  [decision, politics, law, Jimmy Carter, United...    0.032485  \n",
       "9  [President, Democratic Party, member, administ...    0.029319  "
      ]
     },
     "execution_count": 937,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 938,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 938,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 939,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>[Mayu Watanabe, AKB48, career, singles, Team B...</td>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>[Soichiro Honda, Honda Motor Co., Ltd., Mika H...</td>\n",
       "      <td>series</td>\n",
       "      <td>32</td>\n",
       "      <td>94</td>\n",
       "      <td>0.020944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>[Mayu Watanabe, AKB48, career, singles, Team B...</td>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>[Soichiro Honda, Honda Motor Co., Ltd., Mika H...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>43</td>\n",
       "      <td>20</td>\n",
       "      <td>0.036628</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>[Mayu Watanabe, AKB48, career, singles, Team B...</td>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>[Soichiro Honda, Honda Motor Co., Ltd., Mika H...</td>\n",
       "      <td>one</td>\n",
       "      <td>48</td>\n",
       "      <td>86</td>\n",
       "      <td>0.016231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>[Mayu Watanabe, AKB48, career, singles, Team B...</td>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>[Soichiro Honda, Honda Motor Co., Ltd., Mika H...</td>\n",
       "      <td>life</td>\n",
       "      <td>80</td>\n",
       "      <td>50</td>\n",
       "      <td>0.016250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mayu Watanabe</td>\n",
       "      <td>[Mayu Watanabe, AKB48, career, singles, Team B...</td>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>[Soichiro Honda, Honda Motor Co., Ltd., Mika H...</td>\n",
       "      <td>brother</td>\n",
       "      <td>85</td>\n",
       "      <td>68</td>\n",
       "      <td>0.013235</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29835</th>\n",
       "      <td>Kotono Mitsuishi</td>\n",
       "      <td>[Kotono Mitsuishi, narrator., Japanese, Arts V...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>high school</td>\n",
       "      <td>6</td>\n",
       "      <td>40</td>\n",
       "      <td>0.095833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29836</th>\n",
       "      <td>Kotono Mitsuishi</td>\n",
       "      <td>[Kotono Mitsuishi, narrator., Japanese, Arts V...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>one</td>\n",
       "      <td>56</td>\n",
       "      <td>88</td>\n",
       "      <td>0.014610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29837</th>\n",
       "      <td>Todd Whitting</td>\n",
       "      <td>[Todd Ross Whitting, player, American, head co...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>American</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>0.291667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29838</th>\n",
       "      <td>Todd Whitting</td>\n",
       "      <td>[Todd Ross Whitting, player, American, head co...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>NCAA</td>\n",
       "      <td>38</td>\n",
       "      <td>23</td>\n",
       "      <td>0.034897</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29839</th>\n",
       "      <td>Todd Whitting</td>\n",
       "      <td>[Todd Ross Whitting, player, American, head co...</td>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>[Alberto Salazar, Jose, allegations, American,...</td>\n",
       "      <td>one</td>\n",
       "      <td>17</td>\n",
       "      <td>88</td>\n",
       "      <td>0.035094</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>29840 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                a1.name                             a1.phrase[0..$nphrase]  \\\n",
       "0         Mayu Watanabe  [Mayu Watanabe, AKB48, career, singles, Team B...   \n",
       "1         Mayu Watanabe  [Mayu Watanabe, AKB48, career, singles, Team B...   \n",
       "2         Mayu Watanabe  [Mayu Watanabe, AKB48, career, singles, Team B...   \n",
       "3         Mayu Watanabe  [Mayu Watanabe, AKB48, career, singles, Team B...   \n",
       "4         Mayu Watanabe  [Mayu Watanabe, AKB48, career, singles, Team B...   \n",
       "...                 ...                                                ...   \n",
       "29835  Kotono Mitsuishi  [Kotono Mitsuishi, narrator., Japanese, Arts V...   \n",
       "29836  Kotono Mitsuishi  [Kotono Mitsuishi, narrator., Japanese, Arts V...   \n",
       "29837     Todd Whitting  [Todd Ross Whitting, player, American, head co...   \n",
       "29838     Todd Whitting  [Todd Ross Whitting, player, American, head co...   \n",
       "29839     Todd Whitting  [Todd Ross Whitting, player, American, head co...   \n",
       "\n",
       "               a2.name                             a2.phrase[0..$nphrase]  \\\n",
       "0       Sōichirō Honda  [Soichiro Honda, Honda Motor Co., Ltd., Mika H...   \n",
       "1       Sōichirō Honda  [Soichiro Honda, Honda Motor Co., Ltd., Mika H...   \n",
       "2       Sōichirō Honda  [Soichiro Honda, Honda Motor Co., Ltd., Mika H...   \n",
       "3       Sōichirō Honda  [Soichiro Honda, Honda Motor Co., Ltd., Mika H...   \n",
       "4       Sōichirō Honda  [Soichiro Honda, Honda Motor Co., Ltd., Mika H...   \n",
       "...                ...                                                ...   \n",
       "29835  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "29836  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "29837  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "29838  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "29839  Alberto Salazar  [Alberto Salazar, Jose, allegations, American,...   \n",
       "\n",
       "       commonValue  rank1  rank2  Similarity  \n",
       "0           series     32     94    0.020944  \n",
       "1         Japanese     43     20    0.036628  \n",
       "2              one     48     86    0.016231  \n",
       "3             life     80     50    0.016250  \n",
       "4          brother     85     68    0.013235  \n",
       "...            ...    ...    ...         ...  \n",
       "29835  high school      6     40    0.095833  \n",
       "29836          one     56     88    0.014610  \n",
       "29837     American      3      4    0.291667  \n",
       "29838         NCAA     38     23    0.034897  \n",
       "29839          one     17     88    0.035094  \n",
       "\n",
       "[29840 rows x 8 columns]"
      ]
     },
     "execution_count": 939,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 940,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, president...</td>\n",
       "      <td>0.492457</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, president, George W. Bu...</td>\n",
       "      <td>0.072916</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, president...</td>\n",
       "      <td>0.071420</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, Latin Ame...</td>\n",
       "      <td>0.069241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, politics, decision, Ket...</td>\n",
       "      <td>0.067648</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Furuichi Kōi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Furuichi_K%C5%8Di</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>[president, student, administration, president]</td>\n",
       "      <td>0.067158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[White House, U.S. Congress, Democratic Party,...</td>\n",
       "      <td>0.063595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Richard_Nixon</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, president, campaign, pa...</td>\n",
       "      <td>0.059792</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Charles Thias</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Charles_Thias</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[member]</td>\n",
       "      <td>0.044803</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Daiki Arioka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Daiki_Arioka</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>[member]</td>\n",
       "      <td>0.038032</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Article                                              URL  \\\n",
       "0      John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1      Gerald Ford        https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "2      Mitt Romney        https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "3  Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "4   Stephen Breyer     https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "5     Furuichi Kōi  https://en.wikipedia.org/wiki/Furuichi_K%C5%8Di   \n",
       "6     Barack Obama       https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "7    Richard Nixon      https://en.wikipedia.org/wiki/Richard_Nixon   \n",
       "8    Charles Thias      https://en.wikipedia.org/wiki/Charles_Thias   \n",
       "9     Daiki Arioka       https://en.wikipedia.org/wiki/Daiki_Arioka   \n",
       "\n",
       "        Group                    Group1  \\\n",
       "0  politician  United States of America   \n",
       "1  politician  United States of America   \n",
       "2  politician  United States of America   \n",
       "3  politician  United States of America   \n",
       "4  politician  United States of America   \n",
       "5    engineer                     Japan   \n",
       "6  politician  United States of America   \n",
       "7  politician  United States of America   \n",
       "8     athlete  United States of America   \n",
       "9       actor                     Japan   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [United States Senate, Barack Obama, president...    0.492457  \n",
       "1  [United States Senate, president, George W. Bu...    0.072916  \n",
       "2  [United States Senate, Barack Obama, president...    0.071420  \n",
       "3  [United States Senate, Barack Obama, Latin Ame...    0.069241  \n",
       "4  [United States Senate, politics, decision, Ket...    0.067648  \n",
       "5    [president, student, administration, president]    0.067158  \n",
       "6  [White House, U.S. Congress, Democratic Party,...    0.063595  \n",
       "7  [United States Senate, president, campaign, pa...    0.059792  \n",
       "8                                           [member]    0.044803  \n",
       "9                                           [member]    0.038032  "
      ]
     },
     "execution_count": 940,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 941,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 85 ms\n",
      "Graph 'testgraph' node count: 4696\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 13698\n",
      "Graph 'testgraph' degree distribution: p99     243.000000\n",
      "min       3.000000\n",
      "max     288.000000\n",
      "p90       9.000000\n",
      "mean      8.750852\n",
      "p999    276.000000\n",
      "p50       3.000000\n",
      "p95      15.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.0006212887318960873\n",
      "Graph 'testgraph' size in bytes: 32972859\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 942,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.06487801074981689\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 943,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.101635</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.091358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.073193</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.072408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.069051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.062945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.050028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.044742</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.043979</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.039442</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "3           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "8           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.101635  \n",
       "1  politician  United States of America    0.091358  \n",
       "2  politician  United States of America    0.073193  \n",
       "3  politician  United States of America    0.072408  \n",
       "4  politician  United States of America    0.069051  \n",
       "5  politician  United States of America    0.062945  \n",
       "6  politician  United States of America    0.050028  \n",
       "7  politician  United States of America    0.044742  \n",
       "8  politician  United States of America    0.043979  \n",
       "9  politician  United States of America    0.039442  "
      ]
     },
     "execution_count": 943,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 944,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.123516845703125\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 945,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.188945</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.171789</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.137717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.135813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.135597</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.119862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.097368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.085996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.085732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.076350</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "3           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "8       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.188945  \n",
       "1  politician  United States of America    0.171789  \n",
       "2  politician  United States of America    0.137717  \n",
       "3  politician  United States of America    0.135813  \n",
       "4  politician  United States of America    0.135597  \n",
       "5  politician  United States of America    0.119862  \n",
       "6  politician  United States of America    0.097368  \n",
       "7  politician  United States of America    0.085996  \n",
       "8  politician  United States of America    0.085732  \n",
       "9  politician  United States of America    0.076350  "
      ]
     },
     "execution_count": 945,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 946,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.14589304924011232\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 947,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.228747</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.205009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.169942</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.162609</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.154748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.131586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.113782</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.108196</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.095077</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.089234</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "3       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "8           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.228747  \n",
       "1  politician  United States of America    0.205009  \n",
       "2  politician  United States of America    0.169942  \n",
       "3  politician  United States of America    0.162609  \n",
       "4  politician  United States of America    0.154748  \n",
       "5  politician  United States of America    0.131586  \n",
       "6  politician  United States of America    0.113782  \n",
       "7  politician  United States of America    0.108196  \n",
       "8  politician  United States of America    0.095077  \n",
       "9  politician  United States of America    0.089234  "
      ]
     },
     "execution_count": 947,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 948,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "1       [1.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "2       [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "                              ...                        \n",
      "4691    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4692    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4693    [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4694    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4695    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 4696, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 949,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4696\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 950,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "417a277d694a4556ab8fd605046c1e91",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Knn:   0%|          | 0/100 [00:00<?, ?%/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 4696\n",
      "Mean similarity: 1.0\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 951,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.817350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sandra Day O'Connor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sandra_Day_O%27C...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.800251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ai Haruna</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ai_Haruna</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.768639</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>George Washington</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_Washington</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.707719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Christian Hosoi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Christian_Hosoi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.702277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.693428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Shintaro Uda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shintaro_Uda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.679200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.656605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Joi Ito</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Joi_Ito</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.640827</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Hideo Itokawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hideo_Itokawa</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.617541</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Article                                                URL  \\\n",
       "0      Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "1  Sandra Day O'Connor  https://en.wikipedia.org/wiki/Sandra_Day_O%27C...   \n",
       "2            Ai Haruna            https://en.wikipedia.org/wiki/Ai_Haruna   \n",
       "3    George Washington    https://en.wikipedia.org/wiki/George_Washington   \n",
       "4      Christian Hosoi      https://en.wikipedia.org/wiki/Christian_Hosoi   \n",
       "5         Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "6         Shintaro Uda         https://en.wikipedia.org/wiki/Shintaro_Uda   \n",
       "7      Hiroshi Masuoka  https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...   \n",
       "8              Joi Ito              https://en.wikipedia.org/wiki/Joi_Ito   \n",
       "9        Hideo Itokawa        https://en.wikipedia.org/wiki/Hideo_Itokawa   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.817350  \n",
       "1  politician  United States of America    0.800251  \n",
       "2       actor                     Japan    0.768639  \n",
       "3  politician  United States of America    0.707719  \n",
       "4     athlete  United States of America    0.702277  \n",
       "5  politician  United States of America    0.693428  \n",
       "6    engineer                     Japan    0.679200  \n",
       "7    engineer                     Japan    0.656605  \n",
       "8    engineer                     Japan    0.640827  \n",
       "9    engineer                     Japan    0.617541  "
      ]
     },
     "execution_count": 951,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 952,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>James Brown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/James_Brown</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.784729</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Jim Hodges</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Jim_Hodges</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.780666</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.746013</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Florence Griffith Joyner</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Florence_Griffit...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.741414</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Stan Bowman</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stan_Bowman</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.730421</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Frank Shorter</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Frank_Shorter</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.729377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mark Verstegen</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mark_Verstegen</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.686927</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Masaru Ibuka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaru_Ibuka</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.662440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Shinichiro Sakurai</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shinichiro_Sakurai</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.647643</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>August Rodenberg</td>\n",
       "      <td>https://en.wikipedia.org/wiki/August_Rodenberg</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.646271</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    Article  \\\n",
       "0               James Brown   \n",
       "1                Jim Hodges   \n",
       "2             Deval Patrick   \n",
       "3  Florence Griffith Joyner   \n",
       "4               Stan Bowman   \n",
       "5             Frank Shorter   \n",
       "6            Mark Verstegen   \n",
       "7              Masaru Ibuka   \n",
       "8        Shinichiro Sakurai   \n",
       "9          August Rodenberg   \n",
       "\n",
       "                                                 URL       Group  \\\n",
       "0          https://en.wikipedia.org/wiki/James_Brown  politician   \n",
       "1           https://en.wikipedia.org/wiki/Jim_Hodges  politician   \n",
       "2        https://en.wikipedia.org/wiki/Deval_Patrick  politician   \n",
       "3  https://en.wikipedia.org/wiki/Florence_Griffit...     athlete   \n",
       "4          https://en.wikipedia.org/wiki/Stan_Bowman     athlete   \n",
       "5        https://en.wikipedia.org/wiki/Frank_Shorter     athlete   \n",
       "6       https://en.wikipedia.org/wiki/Mark_Verstegen     athlete   \n",
       "7         https://en.wikipedia.org/wiki/Masaru_Ibuka    engineer   \n",
       "8   https://en.wikipedia.org/wiki/Shinichiro_Sakurai    engineer   \n",
       "9     https://en.wikipedia.org/wiki/August_Rodenberg     athlete   \n",
       "\n",
       "                     Group1  Similarity  \n",
       "0  United States of America    0.784729  \n",
       "1  United States of America    0.780666  \n",
       "2  United States of America    0.746013  \n",
       "3  United States of America    0.741414  \n",
       "4  United States of America    0.730421  \n",
       "5  United States of America    0.729377  \n",
       "6  United States of America    0.686927  \n",
       "7                     Japan    0.662440  \n",
       "8                     Japan    0.647643  \n",
       "9  United States of America    0.646271  "
      ]
     },
     "execution_count": 952,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 953,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Shigeru Amachi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shigeru_Amachi</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Yukio Mishima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yukio_Mishima</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Yumi Asō</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yumi_As%C5%8D</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Joey Kelly</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Joey_Kelly</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Aaron Links</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aaron_Links</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Bill Rodgers</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Rodgers_(ru...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Alberto_Salazar</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Tom Lichtenberg</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tom_Lichtenberg</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Roy Walter Riehlman</td>\n",
       "      <td>https://en.wikipedia.org/wiki/R._Walter_Riehlman</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Article                                                URL  \\\n",
       "0       Shigeru Amachi       https://en.wikipedia.org/wiki/Shigeru_Amachi   \n",
       "1        Yukio Mishima        https://en.wikipedia.org/wiki/Yukio_Mishima   \n",
       "2             Yumi Asō        https://en.wikipedia.org/wiki/Yumi_As%C5%8D   \n",
       "3          Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "4           Joey Kelly           https://en.wikipedia.org/wiki/Joey_Kelly   \n",
       "5          Aaron Links          https://en.wikipedia.org/wiki/Aaron_Links   \n",
       "6         Bill Rodgers  https://en.wikipedia.org/wiki/Bill_Rodgers_(ru...   \n",
       "7      Alberto Salazar      https://en.wikipedia.org/wiki/Alberto_Salazar   \n",
       "8      Tom Lichtenberg      https://en.wikipedia.org/wiki/Tom_Lichtenberg   \n",
       "9  Roy Walter Riehlman   https://en.wikipedia.org/wiki/R._Walter_Riehlman   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0       actor                     Japan         1.0  \n",
       "1       actor                     Japan         1.0  \n",
       "2       actor                     Japan         1.0  \n",
       "3  politician  United States of America         1.0  \n",
       "4     athlete  United States of America         1.0  \n",
       "5     athlete  United States of America         1.0  \n",
       "6     athlete  United States of America         1.0  \n",
       "7     athlete  United States of America         1.0  \n",
       "8     athlete  United States of America         1.0  \n",
       "9  politician  United States of America         1.0  "
      ]
     },
     "execution_count": 953,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 954,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
