{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA_CLASS = \"DNP\" # DNP or WIKI\n",
    "DATA_TYPE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "DATA_URL = \"\" # input data\n",
    "QUERY_DICT = {} # query dict {QUERY_NAME: QUERY_URL}\n",
    "if DATA_CLASS == \"DNP\":\n",
    "    if DATA_TYPE == \"TXT\":\n",
    "        DATA_URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        QUERY_DICT[\"C-1\"] = DATA_URL + \"C-1.txt\"\n",
    "        QUERY_DICT[\"C-2\"] = DATA_URL + \"C-2.txt\"\n",
    "        QUERY_DICT[\"C-3\"] = DATA_URL + \"C-3.txt\"\n",
    "        QUERY_DICT[\"C-4\"] = DATA_URL + \"C-4.txt\"\n",
    "    elif DATA_TYPE == \"URL\":\n",
    "        DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        QUERY_DICT[\"C-1\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\"\n",
    "        QUERY_DICT[\"C-2\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\"\n",
    "        QUERY_DICT[\"C-3\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\"\n",
    "        QUERY_DICT[\"C-4\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "elif DATA_CLASS == \"WIKI_FP100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    QUERY_DICT[\"Thierry Henry\"] = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA_CLASS == \"WIKI_P100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"  \n",
    "    QUERY_DICT[\"Joe Biden\"] = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = DATA_URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{DATA_URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>92</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100         92                  100"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    content = \"\"\n",
    "    with open(QUERY_URL, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (q:Query {{ name: \"{QUERY_NAME}\", url: \"{QUERY_URL}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    query = \"\"\"\n",
    "    MERGE (q:Query {name: $name, url: $url})\n",
    "    WITH q\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH q,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET q.body = body, q.title = title\n",
    "    RETURN q.title, q.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": QUERY_NAME, \"url\": QUERY_URL})\n",
    "    \n",
    "# set phrase and salience properties (Query)\n",
    "query = f\"\"\"\n",
    "MATCH (q:Query)\n",
    "CALL apoc.nlp.gcp.entities.stream(q, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (Query)\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)\n",
    "WHERE q.processed IS NOT NULL\n",
    "FOREACH (word IN q.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (q)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(q.phrase, word) + 1\n",
    "  SET r.score = q.salience[apoc.coll.indexOf(q.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(q.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[パッケージ, 以下, 製品, 内容物, 削減, 本社, CO2排出量]</td>\n",
       "      <td>0.097526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 社会, パッケージ, 以下, 製品, 開発, 削減, 実現, CO2, 製造, 本...</td>\n",
       "      <td>0.035080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 環境配慮型, 製造工程, 製品, 開発, 削減, 実現, 同等, CO2, 製造,...</td>\n",
       "      <td>0.032132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 社会, 製品, 削減, 実現, CO2排出量]</td>\n",
       "      <td>0.022266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 東京都, 以下, 本社, 多く]</td>\n",
       "      <td>0.019166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, 削減, 実現, CO2, 本社, CO2排出量]</td>\n",
       "      <td>0.017291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[社会, 製品, 開発, 実現, ブース, 製造]</td>\n",
       "      <td>0.016868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 以下, 製品, 開発, ニュースリリース, 製造, 本社]</td>\n",
       "      <td>0.014972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-97</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-97.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[こと, 社会, 製品, 開発, 製造]</td>\n",
       "      <td>0.014649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[社会, 環境配慮型, パッケージ, ステークホルダー, 製品, 削減, 実現, 幕張メッセ...</td>\n",
       "      <td>0.014466</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "5   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6   C-1    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "7   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8   C-1    B-97  data/newsrelease_B-1-100_C-1-4/B-97.txt  None   None   \n",
       "9   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0               [パッケージ, 以下, 製品, 内容物, 削減, 本社, CO2排出量]    0.097526  \n",
       "1  [こと, 社会, パッケージ, 以下, 製品, 開発, 削減, 実現, CO2, 製造, 本...    0.035080  \n",
       "2  [こと, 環境配慮型, 製造工程, 製品, 開発, 削減, 実現, 同等, CO2, 製造,...    0.032132  \n",
       "3                       [こと, 社会, 製品, 削減, 実現, CO2排出量]    0.022266  \n",
       "4                              [こと, 東京都, 以下, 本社, 多く]    0.019166  \n",
       "5                      [以下, 削減, 実現, CO2, 本社, CO2排出量]    0.017291  \n",
       "6                          [社会, 製品, 開発, 実現, ブース, 製造]    0.016868  \n",
       "7                 [こと, 以下, 製品, 開発, ニュースリリース, 製造, 本社]    0.014972  \n",
       "8                               [こと, 社会, 製品, 開発, 製造]    0.014649  \n",
       "9  [社会, 環境配慮型, パッケージ, ステークホルダー, 製品, 削減, 実現, 幕張メッセ...    0.014466  "
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#query\n",
    "query = \"\"\"\n",
    "MATCH (q:Query), (a:Article)\n",
    "WHERE any(x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (q)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...</td>\n",
       "      <td>0.791611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...</td>\n",
       "      <td>0.657581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...</td>\n",
       "      <td>0.603284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...</td>\n",
       "      <td>0.498526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...</td>\n",
       "      <td>0.352651</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...</td>\n",
       "      <td>0.311805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...</td>\n",
       "      <td>0.285290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]</td>\n",
       "      <td>0.267355</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...</td>\n",
       "      <td>0.255479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]</td>\n",
       "      <td>0.224865</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "1   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "2   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "3   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "5   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "7   C-1    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "8   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...    0.791611  \n",
       "1  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...    0.657581  \n",
       "2  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...    0.603284  \n",
       "3  [CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...    0.498526  \n",
       "4  [本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...    0.352651  \n",
       "5  [CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...    0.311805  \n",
       "6  [CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...    0.285290  \n",
       "7              [製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]    0.267355  \n",
       "8  [CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...    0.255479  \n",
       "9           [削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]    0.224865  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CORRELATES]-(a:Article)\n",
    "WITH q, r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + q.salience[apoc.coll.indexOf(q.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 14 ms\n",
      "Graph 'testgraph' node count: 4987\n",
      "Graph 'testgraph' node labels: ['Query', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 17354\n",
      "Graph 'testgraph' degree distribution: p99     255.000000\n",
      "min       3.000000\n",
      "max     294.000000\n",
      "p90       9.000000\n",
      "mean     10.439543\n",
      "p999    282.000000\n",
      "p50       3.000000\n",
      "p95      21.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.0006979237071339353\n",
      "Graph 'testgraph' size in bytes: 32981103\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Query\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Query\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.048873099684715274\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.068744</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.056868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.054220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.048316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.044348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.043223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.042806</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.040320</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "1   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "2   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "3   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "4   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "5   C-1    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None   \n",
       "6   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "7   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.078200  \n",
       "1    0.068744  \n",
       "2    0.056868  \n",
       "3    0.054220  \n",
       "4    0.049231  \n",
       "5    0.048316  \n",
       "6    0.044348  \n",
       "7    0.043223  \n",
       "8    0.042806  \n",
       "9    0.040320  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.09579094052314759\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.154895</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.130541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.108577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.105455</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.101315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.079883</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "1   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "2   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "3   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "4   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "5   C-1    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None   \n",
       "6   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "7   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "8   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "9   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.154895  \n",
       "1    0.130541  \n",
       "2    0.108577  \n",
       "3    0.105455  \n",
       "4    0.101315  \n",
       "5    0.093278  \n",
       "6    0.087920  \n",
       "7    0.087677  \n",
       "8    0.087433  \n",
       "9    0.079883  "
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.10873043537139893\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.158508</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.156205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.132661</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.112778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.111239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093086</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.091310</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "1   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "2   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "3   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "4   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "5   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "6   C-1    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None   \n",
       "7   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.158508  \n",
       "1    0.156205  \n",
       "2    0.132661  \n",
       "3    0.112778  \n",
       "4    0.111239  \n",
       "5    0.098992  \n",
       "6    0.098955  \n",
       "7    0.093783  \n",
       "8    0.093086  \n",
       "9    0.091310  "
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "1       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "2       [1.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "                              ...                        \n",
      "4982    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4983    [0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "4984    [0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4985    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "4986    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 4987, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4987\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4987\n",
      "Mean similarity: 0.9340716361999511\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.652053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.564967</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-79</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-79.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.540304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-78</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-78.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.474148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-61</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-61.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.442459</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-33</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-33.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.369250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-2</td>\n",
       "      <td>B-83</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-83.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.752111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-2</td>\n",
       "      <td>B-58</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-58.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.658621</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-2</td>\n",
       "      <td>B-45</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-45.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.611815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-2</td>\n",
       "      <td>B-64</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-64.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.576276</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "2   C-1    B-79  data/newsrelease_B-1-100_C-1-4/B-79.txt  None   None   \n",
       "3   C-1    B-78  data/newsrelease_B-1-100_C-1-4/B-78.txt  None   None   \n",
       "4   C-1    B-61  data/newsrelease_B-1-100_C-1-4/B-61.txt  None   None   \n",
       "5   C-1    B-33  data/newsrelease_B-1-100_C-1-4/B-33.txt  None   None   \n",
       "6   C-2    B-83  data/newsrelease_B-1-100_C-1-4/B-83.txt  None   None   \n",
       "7   C-2    B-58  data/newsrelease_B-1-100_C-1-4/B-58.txt  None   None   \n",
       "8   C-2    B-45  data/newsrelease_B-1-100_C-1-4/B-45.txt  None   None   \n",
       "9   C-2    B-64  data/newsrelease_B-1-100_C-1-4/B-64.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.652053  \n",
       "1    0.564967  \n",
       "2    0.540304  \n",
       "3    0.474148  \n",
       "4    0.442459  \n",
       "5    0.369250  \n",
       "6    0.752111  \n",
       "7    0.658621  \n",
       "8    0.611815  \n",
       "9    0.576276  "
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-30</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-30.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.782837</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-51</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-51.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.753195</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-41</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-41.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.748298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-77</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-77.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.733530</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-55</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-55.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.729335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-18</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-18.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.715064</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-4</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-4.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.713580</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.673195</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-20</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-20.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.656839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-8</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-8.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.652105</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-30  data/newsrelease_B-1-100_C-1-4/B-30.txt  None   None   \n",
       "1   C-1    B-51  data/newsrelease_B-1-100_C-1-4/B-51.txt  None   None   \n",
       "2   C-1    B-41  data/newsrelease_B-1-100_C-1-4/B-41.txt  None   None   \n",
       "3   C-1    B-77  data/newsrelease_B-1-100_C-1-4/B-77.txt  None   None   \n",
       "4   C-1    B-55  data/newsrelease_B-1-100_C-1-4/B-55.txt  None   None   \n",
       "5   C-1    B-18  data/newsrelease_B-1-100_C-1-4/B-18.txt  None   None   \n",
       "6   C-1     B-4   data/newsrelease_B-1-100_C-1-4/B-4.txt  None   None   \n",
       "7   C-1    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "8   C-1    B-20  data/newsrelease_B-1-100_C-1-4/B-20.txt  None   None   \n",
       "9   C-1     B-8   data/newsrelease_B-1-100_C-1-4/B-8.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.782837  \n",
       "1    0.753195  \n",
       "2    0.748298  \n",
       "3    0.733530  \n",
       "4    0.729335  \n",
       "5    0.715064  \n",
       "6    0.713580  \n",
       "7    0.673195  \n",
       "8    0.656839  \n",
       "9    0.652105  "
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-83</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-83.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-95</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-95.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-66</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-66.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-94</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-94.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-77</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-77.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-93</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-93.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-99</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-99.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-88</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-88.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-83  data/newsrelease_B-1-100_C-1-4/B-83.txt  None   None   \n",
       "1   C-1    B-95  data/newsrelease_B-1-100_C-1-4/B-95.txt  None   None   \n",
       "2   C-1    B-66  data/newsrelease_B-1-100_C-1-4/B-66.txt  None   None   \n",
       "3   C-1    B-94  data/newsrelease_B-1-100_C-1-4/B-94.txt  None   None   \n",
       "4   C-1    B-77  data/newsrelease_B-1-100_C-1-4/B-77.txt  None   None   \n",
       "5   C-1    B-93  data/newsrelease_B-1-100_C-1-4/B-93.txt  None   None   \n",
       "6   C-1    B-99  data/newsrelease_B-1-100_C-1-4/B-99.txt  None   None   \n",
       "7   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "8   C-1    B-88  data/newsrelease_B-1-100_C-1-4/B-88.txt  None   None   \n",
       "9   C-1    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0         1.0  \n",
       "1         1.0  \n",
       "2         1.0  \n",
       "3         1.0  \n",
       "4         1.0  \n",
       "5         1.0  \n",
       "6         1.0  \n",
       "7         1.0  \n",
       "8         1.0  \n",
       "9         1.0  "
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
