{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 582,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 583,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 583,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "URL = \"DNP\" # DNP or WIKI\n",
    "nphrase = 5 # number of nouns extracted from each article\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 584,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 585,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 586,
   "metadata": {},
   "outputs": [],
   "source": [
    "# if URL == \"DNP\": \n",
    "#     query = \"\"\"\n",
    "#     MERGE (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"})\n",
    "#     WITH a\n",
    "#     CALL apoc.load.html(a.url, {\n",
    "#     title: \"title\",\n",
    "#     h2: \"h2\",\n",
    "#     body: \"body p\"\n",
    "#     })\n",
    "#     YIELD value\n",
    "#     WITH a,\n",
    "#         reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#         value.title[0].text AS title\n",
    "#     SET a.body = body, a.title = title\n",
    "#     RETURN a.title, a.body\n",
    "#     \"\"\"\n",
    "#     gds.run_cypher(query)\n",
    "\n",
    "#     query = \"\"\"\n",
    "#     MATCH (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"})\n",
    "#     CALL apoc.nlp.gcp.entities.stream(a, {\n",
    "#     nodeProperty: 'body',\n",
    "#     key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "#     })\n",
    "#     YIELD node, value\n",
    "#     WITH node, value\n",
    "#     UNWIND value.entities AS entity\n",
    "#     RETURN entity\n",
    "#     LIMIT 5;\n",
    "#     \"\"\"\n",
    "#     gds.run_cypher(query)\n",
    "\n",
    "# elif URL == \"WIKI\":\n",
    "#     query = \"\"\"\n",
    "#     MERGE (a:Article {url: \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"})\n",
    "#     WITH a\n",
    "#     CALL apoc.load.html(a.url, {\n",
    "#     title: \"title\",\n",
    "#     h2: \"h2\",\n",
    "#     body: \"body p\"\n",
    "#     })\n",
    "#     YIELD value\n",
    "#     WITH a,\n",
    "#         reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#         value.title[0].text AS title\n",
    "#     SET a.body = body, a.title = title\n",
    "#     RETURN a.title, a.body\n",
    "#     \"\"\"\n",
    "#     gds.run_cypher(query)\n",
    "\n",
    "#     query = \"\"\"\n",
    "#     MATCH (a:Article {url: \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"})\n",
    "#     CALL apoc.nlp.gcp.entities.stream(a, {\n",
    "#     nodeProperty: 'body',\n",
    "#     key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "#     })\n",
    "#     YIELD node, value\n",
    "#     WITH node, value\n",
    "#     UNWIND value.entities AS entity\n",
    "#     RETURN entity, entity['name']\n",
    "#     LIMIT 5;\n",
    "#     \"\"\"\n",
    "#     gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, player, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 587,
   "metadata": {},
   "outputs": [],
   "source": [
    "if URL == \"DNP\":\n",
    "  query = \"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {name: row.id, url: row.url})\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'main'\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "         reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "         value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {batchSize: 5, parallel: true}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)\n",
    "elif URL == \"WIKI\":\n",
    "  query = \"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {name: row.id, url: row.url})\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "         reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "         value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {batchSize: 5, parallel: true}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 588,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0        1     10          9                   10"
      ]
     },
     "execution_count": 588,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {\n",
    "     nodeProperty: 'body',\n",
    "     key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "   })\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {batchMode: \"BATCH_SINGLE\", batchSize: 10})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 589,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 589,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 590,
   "metadata": {},
   "outputs": [],
   "source": [
    "if URL == \"DNP\":\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169882_1587.html\"})-[r:CONTAINS]-(n)\n",
    "    RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {'nphrase': nphrase})\n",
    "elif URL == \"WIKI\":\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Article {url: \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"})-[r:CONTAINS]-(n)\n",
    "    RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 591,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 591,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if URL == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    name = \"Test\"\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif URL == \"WIKI\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Thierry_Henry\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {\n",
    " nodeProperty: 'body',\n",
    " key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 592,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>[DNP, 東京都]</td>\n",
       "      <td>0.550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.125</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL      Common  \\\n",
       "0    B-10  https://www.dnp.co.jp/news/detail/20169882_158...  [DNP, 東京都]   \n",
       "1     B-1  https://www.dnp.co.jp/news/detail/20169924_158...       [DNP]   \n",
       "2     B-3  https://www.dnp.co.jp/news/detail/20169918_158...       [DNP]   \n",
       "3     B-9  https://www.dnp.co.jp/news/detail/20169860_158...       [DNP]   \n",
       "4     B-6  https://www.dnp.co.jp/news/detail/20169899_158...       [DNP]   \n",
       "5     B-7  https://www.dnp.co.jp/news/detail/20169892_158...       [DNP]   \n",
       "6     B-2  https://www.dnp.co.jp/news/detail/20169889_158...       [DNP]   \n",
       "7     B-8  https://www.dnp.co.jp/news/detail/20169884_158...       [DNP]   \n",
       "8     B-4  https://www.dnp.co.jp/news/detail/20169887_158...       [DNP]   \n",
       "\n",
       "   Similarity  \n",
       "0       0.550  \n",
       "1       0.500  \n",
       "2       0.500  \n",
       "3       0.500  \n",
       "4       0.500  \n",
       "5       0.500  \n",
       "6       0.250  \n",
       "7       0.250  \n",
       "8       0.125  "
      ]
     },
     "execution_count": 592,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 593,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 593,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 594,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-9</td>\n",
       "      <td>[DNP, Bqey, サービス, 社用車, 車両]</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[サイバー攻撃, 企業, 日本, DNP, 演習]</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, DNP, 生活者, サービス, 動画]</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>市谷の杜</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...</td>\n",
       "      <td>市谷の杜</td>\n",
       "      <td>3</td>\n",
       "      <td>2</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>76 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   a1.name                             a1.phrase[0..$nphrase] a2.name  \\\n",
       "0      B-1                  [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]     B-6   \n",
       "1      B-9                         [DNP, Bqey, サービス, 社用車, 車両]     B-6   \n",
       "2      B-4                          [サイバー攻撃, 企業, 日本, DNP, 演習]     B-6   \n",
       "3      B-2                           [生成, DNP, 生活者, サービス, 動画]     B-6   \n",
       "4      B-7          [DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]     B-6   \n",
       "..     ...                                                ...     ...   \n",
       "71     B-3  [DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...    B-10   \n",
       "72     B-6                   [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]    B-10   \n",
       "73     B-5  [緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...    B-10   \n",
       "74     B-7          [DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]    B-10   \n",
       "75    B-10                      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]     B-5   \n",
       "\n",
       "                               a2.phrase[0..$nphrase] commonValue  rank1  \\\n",
       "0                    [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]         DNP      1   \n",
       "1                    [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]         DNP      1   \n",
       "2                    [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]         DNP      4   \n",
       "3                    [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]         DNP      2   \n",
       "4                    [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]         DNP      1   \n",
       "..                                                ...         ...    ...   \n",
       "71                      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1   \n",
       "72                      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1   \n",
       "73                      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]        市谷の杜      2   \n",
       "74                      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1   \n",
       "75  [緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...        市谷の杜      3   \n",
       "\n",
       "    rank2  Similarity  \n",
       "0       1    1.000000  \n",
       "1       1    1.000000  \n",
       "2       1    0.625000  \n",
       "3       1    0.750000  \n",
       "4       1    1.000000  \n",
       "..    ...         ...  \n",
       "71      1    1.000000  \n",
       "72      1    1.000000  \n",
       "73      3    0.416667  \n",
       "74      1    1.000000  \n",
       "75      2    0.416667  \n",
       "\n",
       "[76 rows x 8 columns]"
      ]
     },
     "execution_count": 594,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 595,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>[DNP, 東京都]</td>\n",
       "      <td>0.423941</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.379044</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.335126</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.318781</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.313231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.312576</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.297496</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.283774</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.253096</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL    r.common  \\\n",
       "0    B-10  https://www.dnp.co.jp/news/detail/20169882_158...  [DNP, 東京都]   \n",
       "1     B-3  https://www.dnp.co.jp/news/detail/20169918_158...       [DNP]   \n",
       "2     B-1  https://www.dnp.co.jp/news/detail/20169924_158...       [DNP]   \n",
       "3     B-7  https://www.dnp.co.jp/news/detail/20169892_158...       [DNP]   \n",
       "4     B-6  https://www.dnp.co.jp/news/detail/20169899_158...       [DNP]   \n",
       "5     B-8  https://www.dnp.co.jp/news/detail/20169884_158...       [DNP]   \n",
       "6     B-9  https://www.dnp.co.jp/news/detail/20169860_158...       [DNP]   \n",
       "7     B-2  https://www.dnp.co.jp/news/detail/20169889_158...       [DNP]   \n",
       "8     B-4  https://www.dnp.co.jp/news/detail/20169887_158...       [DNP]   \n",
       "\n",
       "   Similarity  \n",
       "0    0.423941  \n",
       "1    0.379044  \n",
       "2    0.335126  \n",
       "3    0.318781  \n",
       "4    0.313231  \n",
       "5    0.312576  \n",
       "6    0.297496  \n",
       "7    0.283774  \n",
       "8    0.253096  "
      ]
     },
     "execution_count": 595,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 596,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 8 ms\n",
      "Graph 'testgraph' node count: 54\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 597,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 9\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.06518883175320095\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 598,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.071429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>0.071429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>0.071429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>0.034483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.034483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>0.034483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.034483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>0.034483</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.200000\n",
       "1     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.071429\n",
       "2     B-8  https://www.dnp.co.jp/news/detail/20169884_158...    0.071429\n",
       "3     B-4  https://www.dnp.co.jp/news/detail/20169887_158...    0.071429\n",
       "4     B-6  https://www.dnp.co.jp/news/detail/20169899_158...    0.034483\n",
       "5     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.034483\n",
       "6     B-7  https://www.dnp.co.jp/news/detail/20169892_158...    0.034483\n",
       "7     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.034483\n",
       "8     B-9  https://www.dnp.co.jp/news/detail/20169860_158...    0.034483"
      ]
     },
     "execution_count": 598,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 599,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0     [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "1     [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "2     [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "3     [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "4     [0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "5     [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "6     [0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "7     [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "8     [0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "9     [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, ...\n",
      "10    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "11    [0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "12    [0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "13    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "14    [0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "15    [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "16    [1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, ...\n",
      "17    [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "18    [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "19    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "20    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "21    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "22    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "23    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "24    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "25    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "26    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "27    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "28    [0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "29    [1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "30    [0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "31    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "32    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "33    [0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "34    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "35    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "36    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "37    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "38    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "39    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "40    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "41    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "42    [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "43    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "44    [0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "45    [0.0, 1.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "46    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "47    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "48    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, ...\n",
      "49    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "50    [1.0, 1.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "51    [1.0, 1.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "52    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "53    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 600,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 54\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 601,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 54\n",
      "Mean similarity: 0.6729080200195312\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 602,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.791400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>0.729533</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>0.703170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.653111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>0.635397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>0.623053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>0.539114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>0.519060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.510994</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.387510</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.791400\n",
       "1     B-4  https://www.dnp.co.jp/news/detail/20169887_158...    0.729533\n",
       "2     B-9  https://www.dnp.co.jp/news/detail/20169860_158...    0.703170\n",
       "3     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.653111\n",
       "4     B-7  https://www.dnp.co.jp/news/detail/20169892_158...    0.635397\n",
       "5     B-8  https://www.dnp.co.jp/news/detail/20169884_158...    0.623053\n",
       "6     B-5  https://www.dnp.co.jp/news/detail/20169888_158...    0.539114\n",
       "7     B-6  https://www.dnp.co.jp/news/detail/20169899_158...    0.519060\n",
       "8     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.510994\n",
       "9     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.387510"
      ]
     },
     "execution_count": 602,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 603,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>0.700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>0.629099</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>0.600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>0.600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0     B-9  https://www.dnp.co.jp/news/detail/20169860_158...    0.800000\n",
       "1    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.800000\n",
       "2     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.700000\n",
       "3     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.700000\n",
       "4     B-8  https://www.dnp.co.jp/news/detail/20169884_158...    0.700000\n",
       "5     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.700000\n",
       "6     B-4  https://www.dnp.co.jp/news/detail/20169887_158...    0.629099\n",
       "7     B-6  https://www.dnp.co.jp/news/detail/20169899_158...    0.600000\n",
       "8     B-7  https://www.dnp.co.jp/news/detail/20169892_158...    0.600000\n",
       "9     B-5  https://www.dnp.co.jp/news/detail/20169888_158...    0.500000"
      ]
     },
     "execution_count": 603,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 604,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
