{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 246,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import json"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 247,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 248,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 249,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 250,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# MERGE (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {\n",
    "#  title: \"title\",\n",
    "#  h2: \"h2\",\n",
    "#  main: \"main\"\n",
    "# })\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#      value.main[0].text AS body,\n",
    "#      value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 251,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# MATCH (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {\n",
    "#  nodeProperty: 'body',\n",
    "#  key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "# })\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url article nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 252,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0        2     10          0                   10"
      ]
     },
     "execution_count": 252,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv' AS row\n",
    "   RETURN row\",\n",
    "  \"MERGE (a:Article {name: row.id, url: row.url})\n",
    "   WITH a\n",
    "   CALL apoc.load.html(a.url, {\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    main: 'main'\n",
    "   })\n",
    "   YIELD value\n",
    "   WITH a,\n",
    "        value.main[0].text AS body,\n",
    "        value.title[0].text AS title\n",
    "   SET a.body = body, a.title = title\",\n",
    "  {batchSize: 5, parallel: true}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 253,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>10</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0        1     10         10                   10"
      ]
     },
     "execution_count": 253,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {\n",
    "     nodeProperty: 'body',\n",
    "     key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "   })\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {batchMode: \"BATCH_SINGLE\", batchSize: 10})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 254,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..5] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 255,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.processed</th>\n",
       "      <th>a.phrase[0..5]</th>\n",
       "      <th>a.salience[0..5]</th>\n",
       "      <th>collect(r.rank)</th>\n",
       "      <th>collect(r.score)</th>\n",
       "      <th>collect(n.name)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>[0.11435139, 0.081231624, 0.07722434, 0.075715...</td>\n",
       "      <td>[3, 5, 4, 1, 2]</td>\n",
       "      <td>[0.07722434, 0.051425584, 0.07571559, 0.114351...</td>\n",
       "      <td>[市谷の杜, 東京都, 保全, DNP, 自然共生サイト]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   a.processed                 a.phrase[0..5]  \\\n",
       "0         True  [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]   \n",
       "\n",
       "                                    a.salience[0..5]  collect(r.rank)  \\\n",
       "0  [0.11435139, 0.081231624, 0.07722434, 0.075715...  [3, 5, 4, 1, 2]   \n",
       "\n",
       "                                    collect(r.score)  \\\n",
       "0  [0.07722434, 0.051425584, 0.07571559, 0.114351...   \n",
       "\n",
       "                 collect(n.name)  \n",
       "0  [市谷の杜, 東京都, 保全, DNP, 自然共生サイト]  "
      ]
     },
     "execution_count": 255,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article {url: \"https://www.dnp.co.jp/news/detail/20169882_1587.html\"})-[r:CONTAINS]-(n)\n",
    "RETURN a.processed, a.phrase[0..5], a.salience[0..5], collect(r.rank), collect(r.score), collect(n.name)\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 256,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 256,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# input = {\n",
    "#     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "#     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "#     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "#     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "# }\n",
    "# name = \"C-1\"\n",
    "# url = input[name]\n",
    "\n",
    "# query = \"\"\"  \n",
    "# MERGE (i:Input {name: $name, url: $url})\n",
    "# WITH i\n",
    "# CALL apoc.load.html(i.url, {\n",
    "#    title: 'title',\n",
    "#    body: 'body'\n",
    "# })\n",
    "# YIELD value\n",
    "# WITH i,\n",
    "#      value.body[0].text AS body,\n",
    "#      value.title[0].text AS title\n",
    "# SET i.body = body, i.title = title\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "name = \"Test\"\n",
    "# 以下の単語を使って200文字の作文を作ってください：市谷の杜, DNP, 保全, 自然共生サイト, 東京都 (from B-10)\n",
    "query = \"\"\"  \n",
    "MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", body: \"東京都に位置する市谷の杜は、DNP（大日本印刷株式会社）が保全に尽力している自然共生サイトの一つです。この場所は、都心にありながら自然との調和を大切にし、美しい環境を提供しています。市谷の杜は、多くの緑と自然の美しさで知られ、東京都内でのリフレッシュやリラックスに最適な場所です。DNPの保全活動は、この特別な場所の自然の美しさを守り、将来の世代に受け継ぐことを目指しています。市谷の杜は、都市生活と自然の共生を象徴し、多くの人々に癒しと平和を提供しています。\"})\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {\"name\": name})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties (input)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 257,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 257,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input {name: $name})\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {\n",
    " nodeProperty: 'body',\n",
    " key: 'AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec'\n",
    "})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {\"name\": name})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-article relationships (input)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 258,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 258,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..5] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 259,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 東京都]</td>\n",
       "      <td>0.383333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-9</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-8</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.166667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.166667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.083333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article      Common  Similarity\n",
       "0    B-10  [DNP, 東京都]    0.383333\n",
       "1     B-9       [DNP]    0.333333\n",
       "2     B-3       [DNP]    0.333333\n",
       "3     B-7       [DNP]    0.333333\n",
       "4     B-6       [DNP]    0.333333\n",
       "5     B-1       [DNP]    0.333333\n",
       "6     B-8       [DNP]    0.166667\n",
       "7     B-2       [DNP]    0.166667\n",
       "8     B-4       [DNP]    0.083333"
      ]
     },
     "execution_count": 259,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 260,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 260,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..5] WHERE x IN a2.phrase[0..5])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..5] WHERE x IN a2.phrase[0..5]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships (input)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 261,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 261,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..5] WHERE x IN a.phrase[0..5])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..5] WHERE x IN a.phrase[0..5]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 262,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.phrase[0..5]</th>\n",
       "      <th>a2.phrase[0..5]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[サイバー攻撃, 企業, 日本, DNP, 演習]</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[DNP, Bqey, サービス, 社用車, 車両]</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[ドローン, DNP, 実証実験, 兵庫県, 株式会社DNPグラフィカ]</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>[DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>[DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>[緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>市谷の杜</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>[DNP, Bqey, サービス, 社用車, 車両]</td>\n",
       "      <td>[DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>76 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      a1.phrase[0..5]  \\\n",
       "0                       [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]   \n",
       "1                           [サイバー攻撃, 企業, 日本, DNP, 演習]   \n",
       "2                          [DNP, Bqey, サービス, 社用車, 車両]   \n",
       "3                [ドローン, DNP, 実証実験, 兵庫県, 株式会社DNPグラフィカ]   \n",
       "4   [DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...   \n",
       "..                                                ...   \n",
       "71                   [DNP, RFID, 蔵書点検サービス, 図書館, 蔵書点検]   \n",
       "72          [DNP, 社員, 食堂, 認証製品, 第1回フェアトレード・ジャパン アワード]   \n",
       "73  [緑の都市賞, 市谷の杜, 評価 環境 環境 ESG 地域創生・まちづくり 大日本印刷株式会...   \n",
       "74  [DNP, Tokyo Future Tour, 主催者プログラム, Japan Mobil...   \n",
       "75                         [DNP, Bqey, サービス, 社用車, 車両]   \n",
       "\n",
       "                      a2.phrase[0..5] commonValue  rank1  rank2  Similarity  \n",
       "0   [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]         DNP      1      1    1.000000  \n",
       "1   [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]         DNP      4      1    0.625000  \n",
       "2   [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]         DNP      1      1    1.000000  \n",
       "3   [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]         DNP      2      1    0.750000  \n",
       "4   [DNP, トーハン桶川センター, 読者, トーハン, 書籍製造]         DNP      1      1    1.000000  \n",
       "..                                ...         ...    ...    ...         ...  \n",
       "71      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1      1    1.000000  \n",
       "72      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1      1    1.000000  \n",
       "73      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]        市谷の杜      2      3    0.416667  \n",
       "74      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1      1    1.000000  \n",
       "75      [DNP, 自然共生サイト, 市谷の杜, 保全, 東京都]         DNP      1      1    1.000000  \n",
       "\n",
       "[76 rows x 6 columns]"
      ]
     },
     "execution_count": 262,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.phrase[0..5], a2.phrase[0..5], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 263,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[DNP, 東京都]</td>\n",
       "      <td>0.390133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.303329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.259411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.243066</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.237516</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-8</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.236861</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-9</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.221781</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.208059</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.177382</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article    r.common  Similarity\n",
       "0    B-10  [DNP, 東京都]    0.390133\n",
       "1     B-3       [DNP]    0.303329\n",
       "2     B-1       [DNP]    0.259411\n",
       "3     B-7       [DNP]    0.243066\n",
       "4     B-6       [DNP]    0.237516\n",
       "5     B-8       [DNP]    0.236861\n",
       "6     B-9       [DNP]    0.221781\n",
       "7     B-2       [DNP]    0.208059\n",
       "8     B-4       [DNP]    0.177382"
      ]
     },
     "execution_count": 263,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 264,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 6 ms\n",
      "Graph 'testgraph' node count: 54\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "relationship_projection = {\"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]}}\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## fastrp embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 265,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0     [0.37582167983055115, 0.15951070189476013, 0.0...\n",
      "1     [0.5726795196533203, 0.5386263132095337, -0.69...\n",
      "2     [-1.0294896364212036, -0.38753437995910645, -0...\n",
      "3     [-1.0578210353851318, 0.47846007347106934, -0....\n",
      "4     [-0.14383047819137573, -0.39948445558547974, 0...\n",
      "5     [0.023260056972503662, 0.7987784743309021, 0.7...\n",
      "6     [-0.1907520592212677, -0.34746068716049194, 0....\n",
      "7     [-0.2734028100967407, -0.9984447956085205, 0.4...\n",
      "8     [-0.707689642906189, -0.5863922834396362, -0.3...\n",
      "9     [-1.2237939834594727, -0.8258402347564697, -0....\n",
      "10    [-0.38887840509414673, -0.33519837260246277, 0...\n",
      "11    [0.2038588672876358, -0.404960572719574, 0.012...\n",
      "12    [0.203858882188797, -0.4049605131149292, 0.012...\n",
      "13    [0.2038588672876358, -0.404960572719574, 0.012...\n",
      "14    [0.203858882188797, -0.404960572719574, 0.0129...\n",
      "15    [1.042919635772705, 0.27558159828186035, -1.08...\n",
      "16    [1.042919635772705, 0.27558156847953796, -1.08...\n",
      "17    [1.042919635772705, 0.27558159828186035, -1.08...\n",
      "18    [1.042919635772705, 0.27558159828186035, -1.08...\n",
      "19    [-1.1089028120040894, -0.1899895966053009, -0....\n",
      "20    [-1.108902931213379, -0.1899895966053009, -0.1...\n",
      "21    [-1.1089028120040894, -0.1899895966053009, -0....\n",
      "22    [-1.1089028120040894, -0.1899895966053009, -0....\n",
      "23    [-0.5734413862228394, 0.2965509593486786, -1.1...\n",
      "24    [-0.5734413266181946, 0.296550989151001, -1.13...\n",
      "25    [-0.958023726940155, 0.037013716995716095, -0....\n",
      "26    [-0.5734413266181946, 0.2965509295463562, -1.1...\n",
      "27    [-0.04531431943178177, -0.19041740894317627, 1...\n",
      "28    [-0.04531432315707207, -0.19041740894317627, 1...\n",
      "29    [-0.04531431943178177, -0.19041740894317627, 1...\n",
      "30    [-0.04531431943178177, -0.19041740894317627, 1...\n",
      "31    [0.5169915556907654, 0.40971431136131287, 0.87...\n",
      "32    [0.5169914960861206, 0.40971434116363525, 0.87...\n",
      "33    [0.5169915556907654, 0.40971431136131287, 0.87...\n",
      "34    [0.5169915556907654, 0.40971431136131287, 0.87...\n",
      "35    [-0.05063697323203087, -0.1696816086769104, 0....\n",
      "36    [-0.05063697323203087, -0.1696816086769104, 0....\n",
      "37    [-0.05063696950674057, -0.1696816086769104, 0....\n",
      "38    [-0.05063696950674057, -0.1696815937757492, 0....\n",
      "39    [-0.10992994904518127, -0.49468478560447693, 0...\n",
      "40    [-0.4843326807022095, -0.4827236235141754, 0.0...\n",
      "41    [-0.10992994159460068, -0.49468475580215454, 0...\n",
      "42    [-0.10992994904518127, -0.49468478560447693, 0...\n",
      "43    [-0.10992993414402008, -0.49468475580215454, 0...\n",
      "44    [-1.0486637353897095, -0.32489195466041565, -0...\n",
      "45    [-1.0486637353897095, -0.32489195466041565, -0...\n",
      "46    [-1.0486637353897095, -0.32489192485809326, -0...\n",
      "47    [-0.6342197060585022, -0.3745920658111572, -0....\n",
      "48    [-0.6342197060585022, -0.3745920658111572, -0....\n",
      "49    [-0.5112746357917786, -0.486713171005249, 0.39...\n",
      "50    [-0.5684205293655396, -0.9586076736450195, 0.3...\n",
      "51    [-0.20936957001686096, -0.48586106300354004, 0...\n",
      "52    [-0.20936957001686096, -0.48586106300354004, 0...\n",
      "53    [-0.20936957001686096, -0.48586106300354004, 0...\n",
      "Name: embedding, dtype: object\n"
     ]
    }
   ],
   "source": [
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 54\n"
     ]
    }
   ],
   "source": [
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 54\n",
      "Mean similarity: 0.6075052261352539\n"
     ]
    }
   ],
   "source": [
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 268,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>0.792418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-4</td>\n",
       "      <td>0.688594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-5</td>\n",
       "      <td>0.680716</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-9</td>\n",
       "      <td>0.638285</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-8</td>\n",
       "      <td>0.634345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-7</td>\n",
       "      <td>0.597428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-3</td>\n",
       "      <td>0.593606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-1</td>\n",
       "      <td>0.590548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-2</td>\n",
       "      <td>0.479832</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-6</td>\n",
       "      <td>0.379283</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article  Similarity\n",
       "0    B-10    0.792418\n",
       "1     B-4    0.688594\n",
       "2     B-5    0.680716\n",
       "3     B-9    0.638285\n",
       "4     B-8    0.634345\n",
       "5     B-7    0.597428\n",
       "6     B-3    0.593606\n",
       "7     B-1    0.590548\n",
       "8     B-2    0.479832\n",
       "9     B-6    0.379283"
      ]
     },
     "execution_count": 268,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR]-(a:Article)\n",
    "RETURN a.name AS Article, r.score AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
