{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 743,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 744,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 744,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 10 # number of nouns extracted from each article\n",
    "DATA = \"WIKI_P100\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Hiromu_Nonaka\"    \n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 745,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 746,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 747,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 748,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 749,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20</td>\n",
       "      <td>100</td>\n",
       "      <td>5</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       20    100          5                  100"
      ]
     },
     "execution_count": 749,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "  SET a.group = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 750,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>110</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        110                  100"
      ]
     },
     "execution_count": 750,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 751,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 751,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 752,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 753,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 753,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    name = \"Test\"\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Thierry_Henry\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Ai_Fukuhara\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 754,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[women, Japanese]</td>\n",
       "      <td>0.270833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Antonio_Inoki</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kyōka Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki</td>\n",
       "      <td>actor</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Shiho Yoshimura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Shiho_Yoshimura</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kotaro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Masanao Ozaki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masanao_Ozaki</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yoshiko_Tanaka</td>\n",
       "      <td>actor</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1     Antonio Inoki        https://en.wikipedia.org/wiki/Antonio_Inoki   \n",
       "2   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "3      Kyōka Suzuki    https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki   \n",
       "4   Shiho Yoshimura      https://en.wikipedia.org/wiki/Shiho_Yoshimura   \n",
       "5      Kōtarō Honda         https://en.wikipedia.org/wiki/Kotaro_Honda   \n",
       "6     Koichi Wakata        https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "7    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "8     Masanao Ozaki        https://en.wikipedia.org/wiki/Masanao_Ozaki   \n",
       "9    Yoshiko Tanaka       https://en.wikipedia.org/wiki/Yoshiko_Tanaka   \n",
       "\n",
       "        Group             Common  Similarity  \n",
       "0     athlete  [women, Japanese]    0.270833  \n",
       "1  politician         [Japanese]    0.250000  \n",
       "2     athlete         [Japanese]    0.250000  \n",
       "3       actor         [Japanese]    0.250000  \n",
       "4     athlete         [Japanese]    0.250000  \n",
       "5    engineer         [Japanese]    0.250000  \n",
       "6    engineer         [Japanese]    0.250000  \n",
       "7    engineer         [Japanese]    0.250000  \n",
       "8  politician         [Japanese]    0.250000  \n",
       "9       actor         [Japanese]    0.250000  "
      ]
     },
     "execution_count": 754,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 755,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 755,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 756,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Junichi Masuda</td>\n",
       "      <td>[Junichi Masuda, employee, Pokémon, video game...</td>\n",
       "      <td>Kazuma Kaneko</td>\n",
       "      <td>[Kazuma Kaneko, Atlus, designer, characters, C...</td>\n",
       "      <td>designer</td>\n",
       "      <td>9</td>\n",
       "      <td>3</td>\n",
       "      <td>0.222222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Katsuhisa Namase</td>\n",
       "      <td>[Katsuhisa Namase, positions, Japanese, primar...</td>\n",
       "      <td>Kazuma Kaneko</td>\n",
       "      <td>[Kazuma Kaneko, Atlus, designer, characters, C...</td>\n",
       "      <td>characters</td>\n",
       "      <td>10</td>\n",
       "      <td>4</td>\n",
       "      <td>0.175000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Satoru Okada</td>\n",
       "      <td>[Satoru Okada, Nintendo, Gunpei Yokoi, Game Bo...</td>\n",
       "      <td>Kazuma Kaneko</td>\n",
       "      <td>[Kazuma Kaneko, Atlus, designer, characters, C...</td>\n",
       "      <td>games</td>\n",
       "      <td>9</td>\n",
       "      <td>6</td>\n",
       "      <td>0.138889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Takio Izawa</td>\n",
       "      <td>[Takio Izawa, article, Taiwan, Japanese, posit...</td>\n",
       "      <td>Hideo Kobayashi</td>\n",
       "      <td>[Hideo Kobayashi, Kobayashi Hideo, article, Ja...</td>\n",
       "      <td>article</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Takio Izawa</td>\n",
       "      <td>[Takio Izawa, article, Taiwan, Japanese, posit...</td>\n",
       "      <td>Hideo Kobayashi</td>\n",
       "      <td>[Hideo Kobayashi, Kobayashi Hideo, article, Ja...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7563</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>[Takao Doi, Japanese, missions, engineer, vete...</td>\n",
       "      <td>Kaoru Ishikawa</td>\n",
       "      <td>[Kaoru Ishikawa, professor, University of Toky...</td>\n",
       "      <td>University of Tokyo</td>\n",
       "      <td>9</td>\n",
       "      <td>3</td>\n",
       "      <td>0.222222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7564</th>\n",
       "      <td>Shoichiro Irimajiri</td>\n",
       "      <td>[Shoichiro Irimajiri, businessman, Japan, Koch...</td>\n",
       "      <td>Kaoru Ishikawa</td>\n",
       "      <td>[Kaoru Ishikawa, professor, University of Toky...</td>\n",
       "      <td>University of Tokyo</td>\n",
       "      <td>9</td>\n",
       "      <td>3</td>\n",
       "      <td>0.222222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7565</th>\n",
       "      <td>Masayuki Uemura</td>\n",
       "      <td>[Masayuki Uemura, Nintendo, video game produce...</td>\n",
       "      <td>Kaoru Ishikawa</td>\n",
       "      <td>[Kaoru Ishikawa, professor, University of Toky...</td>\n",
       "      <td>professor</td>\n",
       "      <td>4</td>\n",
       "      <td>2</td>\n",
       "      <td>0.375000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7566</th>\n",
       "      <td>Sekinari Nii</td>\n",
       "      <td>[Sekinari Nii, Yamaguchi Prefecture, Japan, De...</td>\n",
       "      <td>Kaoru Ishikawa</td>\n",
       "      <td>[Kaoru Ishikawa, professor, University of Toky...</td>\n",
       "      <td>University of Tokyo</td>\n",
       "      <td>10</td>\n",
       "      <td>3</td>\n",
       "      <td>0.216667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7567</th>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Kaoru Ishikawa</td>\n",
       "      <td>[Kaoru Ishikawa, professor, University of Toky...</td>\n",
       "      <td>University of Tokyo</td>\n",
       "      <td>8</td>\n",
       "      <td>3</td>\n",
       "      <td>0.229167</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7568 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  a1.name                             a1.phrase[0..$nphrase]  \\\n",
       "0          Junichi Masuda  [Junichi Masuda, employee, Pokémon, video game...   \n",
       "1        Katsuhisa Namase  [Katsuhisa Namase, positions, Japanese, primar...   \n",
       "2            Satoru Okada  [Satoru Okada, Nintendo, Gunpei Yokoi, Game Bo...   \n",
       "3             Takio Izawa  [Takio Izawa, article, Taiwan, Japanese, posit...   \n",
       "4             Takio Izawa  [Takio Izawa, article, Taiwan, Japanese, posit...   \n",
       "...                   ...                                                ...   \n",
       "7563            Takao Doi  [Takao Doi, Japanese, missions, engineer, vete...   \n",
       "7564  Shoichiro Irimajiri  [Shoichiro Irimajiri, businessman, Japan, Koch...   \n",
       "7565      Masayuki Uemura  [Masayuki Uemura, Nintendo, video game produce...   \n",
       "7566         Sekinari Nii  [Sekinari Nii, Yamaguchi Prefecture, Japan, De...   \n",
       "7567     Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "\n",
       "              a2.name                             a2.phrase[0..$nphrase]  \\\n",
       "0       Kazuma Kaneko  [Kazuma Kaneko, Atlus, designer, characters, C...   \n",
       "1       Kazuma Kaneko  [Kazuma Kaneko, Atlus, designer, characters, C...   \n",
       "2       Kazuma Kaneko  [Kazuma Kaneko, Atlus, designer, characters, C...   \n",
       "3     Hideo Kobayashi  [Hideo Kobayashi, Kobayashi Hideo, article, Ja...   \n",
       "4     Hideo Kobayashi  [Hideo Kobayashi, Kobayashi Hideo, article, Ja...   \n",
       "...               ...                                                ...   \n",
       "7563   Kaoru Ishikawa  [Kaoru Ishikawa, professor, University of Toky...   \n",
       "7564   Kaoru Ishikawa  [Kaoru Ishikawa, professor, University of Toky...   \n",
       "7565   Kaoru Ishikawa  [Kaoru Ishikawa, professor, University of Toky...   \n",
       "7566   Kaoru Ishikawa  [Kaoru Ishikawa, professor, University of Toky...   \n",
       "7567   Kaoru Ishikawa  [Kaoru Ishikawa, professor, University of Toky...   \n",
       "\n",
       "              commonValue  rank1  rank2  Similarity  \n",
       "0                designer      9      3    0.222222  \n",
       "1              characters     10      4    0.175000  \n",
       "2                   games      9      6    0.138889  \n",
       "3                 article      2      3    0.416667  \n",
       "4                Japanese      4      4    0.250000  \n",
       "...                   ...    ...    ...         ...  \n",
       "7563  University of Tokyo      9      3    0.222222  \n",
       "7564  University of Tokyo      9      3    0.222222  \n",
       "7565            professor      4      2    0.375000  \n",
       "7566  University of Tokyo     10      3    0.216667  \n",
       "7567  University of Tokyo      8      3    0.229167  \n",
       "\n",
       "[7568 rows x 8 columns]"
      ]
     },
     "execution_count": 756,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 757,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese, women]</td>\n",
       "      <td>0.181038</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese, team]</td>\n",
       "      <td>0.116488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.095929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kotaro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.088938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.083825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hiroaki Ōishi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroaki_Ohishi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Yūji Takeda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yuji_Yaku</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Takao_Doi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.066815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.065804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kenichi Yamamoto</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kenichi_Yamamoto...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.059942</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1     Kaoru Hoshino        https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "2    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "3      Kōtarō Honda         https://en.wikipedia.org/wiki/Kotaro_Honda   \n",
       "4      Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "5     Hiroaki Ōishi       https://en.wikipedia.org/wiki/Hiroaki_Ohishi   \n",
       "6       Yūji Takeda            https://en.wikipedia.org/wiki/Yuji_Yaku   \n",
       "7         Takao Doi            https://en.wikipedia.org/wiki/Takao_Doi   \n",
       "8   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "9  Kenichi Yamamoto  https://en.wikipedia.org/wiki/Kenichi_Yamamoto...   \n",
       "\n",
       "        Group           r.common  Similarity  \n",
       "0     athlete  [Japanese, women]    0.181038  \n",
       "1    engineer   [Japanese, team]    0.116488  \n",
       "2    engineer         [Japanese]    0.095929  \n",
       "3    engineer         [Japanese]    0.088938  \n",
       "4  politician         [Japanese]    0.083825  \n",
       "5     athlete         [Japanese]    0.070690  \n",
       "6     athlete         [Japanese]    0.070690  \n",
       "7    engineer         [Japanese]    0.066815  \n",
       "8     athlete         [Japanese]    0.065804  \n",
       "9     athlete         [Japanese]    0.059942  "
      ]
     },
     "execution_count": 757,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 758,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 9 ms\n",
      "Graph 'testgraph' node count: 805\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 759,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.03733459711074829\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 760,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Fumino Sugiyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumino_Sugiyama</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Masayuki Uemura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masayuki_Uemura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.020833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Nanako Matsushima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nanako_Matsushima</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.020408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Tsutomu Yamaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.020202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yoshiko_Tanaka</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Masaaki Kanda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaaki_Kanda</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Antonio_Inoki</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.019802</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0   Haruka Kitaguchi   https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1    Fumino Sugiyama    https://en.wikipedia.org/wiki/Fumino_Sugiyama   \n",
       "2      Kaoru Hoshino      https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "3    Masayuki Uemura    https://en.wikipedia.org/wiki/Masayuki_Uemura   \n",
       "4      Koichi Wakata      https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "5  Nanako Matsushima  https://en.wikipedia.org/wiki/Nanako_Matsushima   \n",
       "6  Tsutomu Yamaguchi  https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi   \n",
       "7     Yoshiko Tanaka     https://en.wikipedia.org/wiki/Yoshiko_Tanaka   \n",
       "8      Masaaki Kanda      https://en.wikipedia.org/wiki/Masaaki_Kanda   \n",
       "9      Antonio Inoki      https://en.wikipedia.org/wiki/Antonio_Inoki   \n",
       "\n",
       "        Group  Similarity  \n",
       "0     athlete    0.078431  \n",
       "1     athlete    0.078431  \n",
       "2    engineer    0.047619  \n",
       "3    engineer    0.047619  \n",
       "4    engineer    0.020833  \n",
       "5       actor    0.020408  \n",
       "6    engineer    0.020202  \n",
       "7       actor    0.020000  \n",
       "8  politician    0.020000  \n",
       "9  politician    0.019802  "
      ]
     },
     "execution_count": 760,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 761,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0      [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "1      [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "2      [0.0, 1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "3      [0.0, 1.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4      [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "                             ...                        \n",
      "800    [0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, ...\n",
      "801    [0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "802    [0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, ...\n",
      "803    [0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "804    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 805, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 762,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 805\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 763,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 805\n",
      "Mean similarity: 0.9199989318847657\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 764,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Antonio_Inoki</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.841760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Masayuki Uemura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masayuki_Uemura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.761935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nashimoto Morimasa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Prince_Nashimoto...</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.754563</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Aya Kamikawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aya_Kamikawa</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.731131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kazuma Kaneko</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kazuma_Kaneko</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.712679</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Tanaka Giichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tanaka_Giichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.703812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Rina Kawaei</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Rina_Kawaei</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.698113</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuya_Kitamura</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.679344</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Takanori Nishikawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Takanori_Nishikawa</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.673464</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Guts Ishimatsu</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Guts_Ishimatsu</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.671882</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              Article                                                URL  \\\n",
       "0       Antonio Inoki        https://en.wikipedia.org/wiki/Antonio_Inoki   \n",
       "1     Masayuki Uemura      https://en.wikipedia.org/wiki/Masayuki_Uemura   \n",
       "2  Nashimoto Morimasa  https://en.wikipedia.org/wiki/Prince_Nashimoto...   \n",
       "3        Aya Kamikawa         https://en.wikipedia.org/wiki/Aya_Kamikawa   \n",
       "4       Kazuma Kaneko        https://en.wikipedia.org/wiki/Kazuma_Kaneko   \n",
       "5       Tanaka Giichi        https://en.wikipedia.org/wiki/Tanaka_Giichi   \n",
       "6         Rina Kawaei          https://en.wikipedia.org/wiki/Rina_Kawaei   \n",
       "7    Katsuya Kitamura     https://en.wikipedia.org/wiki/Katsuya_Kitamura   \n",
       "8  Takanori Nishikawa   https://en.wikipedia.org/wiki/Takanori_Nishikawa   \n",
       "9      Guts Ishimatsu       https://en.wikipedia.org/wiki/Guts_Ishimatsu   \n",
       "\n",
       "        Group  Similarity  \n",
       "0  politician    0.841760  \n",
       "1    engineer    0.761935  \n",
       "2  politician    0.754563  \n",
       "3  politician    0.731131  \n",
       "4    engineer    0.712679  \n",
       "5  politician    0.703812  \n",
       "6       actor    0.698113  \n",
       "7     athlete    0.679344  \n",
       "8       actor    0.673464  \n",
       "9       actor    0.671882  "
      ]
     },
     "execution_count": 764,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 765,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Tanaka Giichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tanaka_Giichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chisato Mishima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Chisato_Mishima</td>\n",
       "      <td>athlete</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Toshirō Mifune</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Toshiro_Mifune</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sekinari Nii</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sekinari_Nii</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Goro Hayashibe</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Goro_Hayashibe</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Miki Matsue</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Miki_Matheson</td>\n",
       "      <td>athlete</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Kōki Hirota</td>\n",
       "      <td>https://en.wikipedia.org/wiki/K%C5%8Dki_Hirota</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Daisuke Nakajima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Daisuke_Nakajima</td>\n",
       "      <td>engineer</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Kazuki Yao</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kazuki_Yao</td>\n",
       "      <td>actor</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Nobutaka Machimura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nobutaka_Machimura</td>\n",
       "      <td>politician</td>\n",
       "      <td>0.9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              Article                                               URL  \\\n",
       "0       Tanaka Giichi       https://en.wikipedia.org/wiki/Tanaka_Giichi   \n",
       "1     Chisato Mishima     https://en.wikipedia.org/wiki/Chisato_Mishima   \n",
       "2      Toshirō Mifune      https://en.wikipedia.org/wiki/Toshiro_Mifune   \n",
       "3        Sekinari Nii        https://en.wikipedia.org/wiki/Sekinari_Nii   \n",
       "4      Goro Hayashibe      https://en.wikipedia.org/wiki/Goro_Hayashibe   \n",
       "5         Miki Matsue       https://en.wikipedia.org/wiki/Miki_Matheson   \n",
       "6         Kōki Hirota    https://en.wikipedia.org/wiki/K%C5%8Dki_Hirota   \n",
       "7    Daisuke Nakajima    https://en.wikipedia.org/wiki/Daisuke_Nakajima   \n",
       "8          Kazuki Yao          https://en.wikipedia.org/wiki/Kazuki_Yao   \n",
       "9  Nobutaka Machimura  https://en.wikipedia.org/wiki/Nobutaka_Machimura   \n",
       "\n",
       "        Group  Similarity  \n",
       "0  politician         1.0  \n",
       "1     athlete         1.0  \n",
       "2       actor         0.9  \n",
       "3  politician         0.9  \n",
       "4     athlete         0.9  \n",
       "5     athlete         0.9  \n",
       "6  politician         0.9  \n",
       "7    engineer         0.9  \n",
       "8       actor         0.9  \n",
       "9  politician         0.9  "
      ]
     },
     "execution_count": 765,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.group AS Group, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 766,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
