{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA_CLASS = \"DNP\" # DNP or WIKI\n",
    "DATA_TYPE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "DATA_URL = \"\" # input data\n",
    "DATA_TEST = \"\" # test data\n",
    "QUERY_NAME = \"\" # name of query data\n",
    "QUERY_URL = \"\" # query data\n",
    "if DATA_CLASS == \"DNP\":\n",
    "    if DATA_TYPE == \"TXT\":\n",
    "        DATA_URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        DATA_TEST = \"B-1.txt\"\n",
    "        QUERY_NAME = \"C-1\"\n",
    "        QUERY_URL = DATA_URL + QUERY_NAME + \".txt\"\n",
    "    elif DATA_TYPE == \"URL\":\n",
    "        DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        DATA_TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "        query_list = {\n",
    "        \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "        \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "        \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "        \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "        }\n",
    "        QUERY_NAME = \"C-1\"\n",
    "        QUERY_URL = query_list[QUERY_NAME]\n",
    "elif DATA_CLASS == \"WIKI_FP100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    DATA_TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "    QUERY_NAME = \"Thierry Henry\"\n",
    "    QUERY_URL = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA_CLASS == \"WIKI_P100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    DATA_TEST = \"https://en.wikipedia.org/wiki/Barack_Obama\"    \n",
    "    QUERY_NAME = \"Joe Biden\"\n",
    "    QUERY_URL = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{DATA_TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{DATA_TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = DATA_URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{DATA_URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>88</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100         88                  100"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{DATA_TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "    # # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (q:Query {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "    #         body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": QUERY_NAME})\n",
    "\n",
    "    content = \"\"\n",
    "    with open(QUERY_URL, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (q:Query {{ name: \"{QUERY_NAME}\", url: \"{QUERY_URL}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "\n",
    "else:\n",
    "    query = \"\"\"\n",
    "    MERGE (q:Query {name: $name, url: $url})\n",
    "    WITH q\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH q,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET q.body = body, q.title = title\n",
    "    RETURN q.title, q.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": QUERY_NAME, \"url\": QUERY_URL})\n",
    "    \n",
    "# set phrase and salience properties (Query)\n",
    "query = f\"\"\"\n",
    "MATCH (q:Query)\n",
    "CALL apoc.nlp.gcp.entities.stream(q, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (Query)\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)\n",
    "WHERE q.processed IS NOT NULL\n",
    "FOREACH (word IN q.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (q)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(q.phrase, word) + 1\n",
    "  SET r.score = q.salience[apoc.coll.indexOf(q.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(q.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 削減, 内容物, パッケージ, 製品]</td>\n",
       "      <td>0.097526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 製造, 削減, CO2, 実現, 社会, パッケージ, 製...</td>\n",
       "      <td>0.035080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 製造, 削減, CO2, 同等, 製造工程, 実現, 環境配慮型, 製品,...</td>\n",
       "      <td>0.032132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, 実現, 社会, 製品, こと]</td>\n",
       "      <td>0.022266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[多く, 以下, 本社, 東京都, こと]</td>\n",
       "      <td>0.019166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, CO2排出量, 本社, 削減, CO2, 実現]</td>\n",
       "      <td>0.017291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 実現, 社会, ブース, 製品, 開発]</td>\n",
       "      <td>0.016868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, 本社, 製造, ニュースリリース, 製品, こと, 開発]</td>\n",
       "      <td>0.014972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-97</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-97.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 社会, 製品, こと, 開発]</td>\n",
       "      <td>0.014649</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[多く, ステークホルダー, CO2排出量, 削減, 実現, 環境配慮型, 社会, 幕張メッ...</td>\n",
       "      <td>0.014466</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8    B-97  data/newsrelease_B-1-100_C-1-4/B-97.txt  None   None   \n",
       "9    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0               [以下, CO2排出量, 本社, 削減, 内容物, パッケージ, 製品]    0.097526  \n",
       "1  [以下, CO2排出量, 本社, 製造, 削減, CO2, 実現, 社会, パッケージ, 製...    0.035080  \n",
       "2  [CO2排出量, 製造, 削減, CO2, 同等, 製造工程, 実現, 環境配慮型, 製品,...    0.032132  \n",
       "3                       [CO2排出量, 削減, 実現, 社会, 製品, こと]    0.022266  \n",
       "4                              [多く, 以下, 本社, 東京都, こと]    0.019166  \n",
       "5                      [以下, CO2排出量, 本社, 削減, CO2, 実現]    0.017291  \n",
       "6                          [製造, 実現, 社会, ブース, 製品, 開発]    0.016868  \n",
       "7                 [以下, 本社, 製造, ニュースリリース, 製品, こと, 開発]    0.014972  \n",
       "8                               [製造, 社会, 製品, こと, 開発]    0.014649  \n",
       "9  [多く, ステークホルダー, CO2排出量, 削減, 実現, 環境配慮型, 社会, 幕張メッ...    0.014466  "
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#query\n",
    "query = \"\"\"\n",
    "MATCH (q:Query), (a:Article)\n",
    "WHERE any(x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (q)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-62</td>\n",
       "      <td>[DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-62</td>\n",
       "      <td>[DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>コンテンツ</td>\n",
       "      <td>45</td>\n",
       "      <td>40</td>\n",
       "      <td>0.023611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-62</td>\n",
       "      <td>[DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>こと</td>\n",
       "      <td>63</td>\n",
       "      <td>16</td>\n",
       "      <td>0.039187</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-38</td>\n",
       "      <td>[DNP, CGデータ, バーチャルプロダクション, CG, 神田明神, 提供, 精細, デ...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-38</td>\n",
       "      <td>[DNP, CGデータ, バーチャルプロダクション, CG, 神田明神, 提供, 精細, デ...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...</td>\n",
       "      <td>データ</td>\n",
       "      <td>8</td>\n",
       "      <td>64</td>\n",
       "      <td>0.070312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81637</th>\n",
       "      <td>B-27</td>\n",
       "      <td>[DNP, 購買システム, 導入, 対象, システム, 業務効率化, 発注, 実現 間接材,...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>強化</td>\n",
       "      <td>34</td>\n",
       "      <td>55</td>\n",
       "      <td>0.023797</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81638</th>\n",
       "      <td>B-64</td>\n",
       "      <td>[スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>6</td>\n",
       "      <td>1</td>\n",
       "      <td>0.583333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81639</th>\n",
       "      <td>B-64</td>\n",
       "      <td>[スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>サービス</td>\n",
       "      <td>48</td>\n",
       "      <td>37</td>\n",
       "      <td>0.023930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81640</th>\n",
       "      <td>B-64</td>\n",
       "      <td>[スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>画像</td>\n",
       "      <td>90</td>\n",
       "      <td>60</td>\n",
       "      <td>0.013889</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81641</th>\n",
       "      <td>B-64</td>\n",
       "      <td>[スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...</td>\n",
       "      <td>B-100</td>\n",
       "      <td>[DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...</td>\n",
       "      <td>情報</td>\n",
       "      <td>25</td>\n",
       "      <td>69</td>\n",
       "      <td>0.027246</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>81642 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      a1.name                             a1.phrase[0..$nphrase] a2.name  \\\n",
       "0        B-62  [DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...     B-1   \n",
       "1        B-62  [DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...     B-1   \n",
       "2        B-62  [DNP, GASHO2.0, 所有証明システム, デジタル, 証明, 株式会社Raptor...     B-1   \n",
       "3        B-38  [DNP, CGデータ, バーチャルプロダクション, CG, 神田明神, 提供, 精細, デ...     B-1   \n",
       "4        B-38  [DNP, CGデータ, バーチャルプロダクション, CG, 神田明神, 提供, 精細, デ...     B-1   \n",
       "...       ...                                                ...     ...   \n",
       "81637    B-27  [DNP, 購買システム, 導入, 対象, システム, 業務効率化, 発注, 実現 間接材,...   B-100   \n",
       "81638    B-64  [スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...   B-100   \n",
       "81639    B-64  [スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...   B-100   \n",
       "81640    B-64  [スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...   B-100   \n",
       "81641    B-64  [スマートグラス, 実証実験, 位置情報, 情報表示ガイダンスシステム, 貝塚博物館, DN...   B-100   \n",
       "\n",
       "                                  a2.phrase[0..$nphrase] commonValue  rank1  \\\n",
       "0      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...         DNP      1   \n",
       "1      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...       コンテンツ     45   \n",
       "2      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...          こと     63   \n",
       "3      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...         DNP      1   \n",
       "4      [DNP, トーハン桶川センター, 読者, 書籍製造, 書籍製造ライン, 製造ライン, 書籍...         データ      8   \n",
       "...                                                  ...         ...    ...   \n",
       "81637  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          強化     34   \n",
       "81638  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...         DNP      6   \n",
       "81639  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...        サービス     48   \n",
       "81640  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          画像     90   \n",
       "81641  [DNP, 生成AI, グループ社員, 価値, デジタルトランスフォーメーション, 業務, ...          情報     25   \n",
       "\n",
       "       rank2  Similarity  \n",
       "0          1    1.000000  \n",
       "1         40    0.023611  \n",
       "2         16    0.039187  \n",
       "3          1    1.000000  \n",
       "4         64    0.070312  \n",
       "...      ...         ...  \n",
       "81637     55    0.023797  \n",
       "81638      1    0.583333  \n",
       "81639     37    0.023930  \n",
       "81640     60    0.013889  \n",
       "81641     69    0.027246  \n",
       "\n",
       "[81642 rows x 8 columns]"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...</td>\n",
       "      <td>0.791611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...</td>\n",
       "      <td>0.657581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...</td>\n",
       "      <td>0.603284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...</td>\n",
       "      <td>0.498526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...</td>\n",
       "      <td>0.352651</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...</td>\n",
       "      <td>0.311805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...</td>\n",
       "      <td>0.285290</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-49</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-49.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]</td>\n",
       "      <td>0.267355</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...</td>\n",
       "      <td>0.255479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]</td>\n",
       "      <td>0.224865</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  \\\n",
       "0    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "2    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "3    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "5    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "7    B-49  data/newsrelease_B-1-100_C-1-4/B-49.txt  None   None   \n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [同等, CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量...    0.791611  \n",
       "1  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 削減...    0.657581  \n",
       "2  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, 製造, 開発, CO...    0.603284  \n",
       "3  [CO2排出量, 削減, CO2排出量, CO2排出量, 社会, 削減, 実現, 製品, こ...    0.498526  \n",
       "4  [本社, 以下, 製造, 開発, ニュースリリース, 製品, 開発, こと, こと, 製造,...    0.352651  \n",
       "5  [CO2排出量, 削減, CO2排出量, 本社, 以下, CO2排出量, CO2, 削減, ...    0.311805  \n",
       "6  [CO2排出量, 削減, CO2排出量, 環境配慮型, パッケージ, ブース, CO2排出量...    0.285290  \n",
       "7              [製造, 開発, ブース, 社会, 実現, 製品, 開発, 製造, 製造]    0.267355  \n",
       "8  [CO2排出量, CO2排出量, パッケージ, 製造, 開発, CO2排出量, 実現, パッ...    0.255479  \n",
       "9           [削減, グループ会社, 本社, 以下, 削減, 実現, 削減, 削減, 多く]    0.224865  "
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + q.salience[apoc.coll.indexOf(q.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 25 ms\n",
      "Graph 'testgraph' node count: 4860\n",
      "Graph 'testgraph' node labels: ['Query', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 16870\n",
      "Graph 'testgraph' degree distribution: p99     255.00000\n",
      "min       3.00000\n",
      "max     294.00000\n",
      "p90       9.00000\n",
      "mean     10.41358\n",
      "p999    282.00000\n",
      "p50       3.00000\n",
      "p95      21.00000\n",
      "p75       3.00000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.000714384320979185\n",
      "Graph 'testgraph' size in bytes: 32977499\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Query\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Query\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.05262758731842041\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.068744</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.056868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.054220</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.048316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.044348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.043223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.042806</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.040320</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.078200\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.068744\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.056868\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.054220\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.049231\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.048316\n",
       "6    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.044348\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.043223\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.042806\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.040320"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.10369725227355957\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.154895</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.130541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.108577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.105455</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.101315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.087433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.079883</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.154895\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.130541\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.108577\n",
       "3    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.105455\n",
       "4    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.101315\n",
       "5    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.093278\n",
       "6    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.087920\n",
       "7    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.087677\n",
       "8    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.087433\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.079883"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.11475157737731934\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.158508</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.156205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.132661</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.112778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.111239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.098955</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.093086</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.091310</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None    0.158508\n",
       "1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.156205\n",
       "2    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None    0.132661\n",
       "3    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.112778\n",
       "4    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None    0.111239\n",
       "5    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.098992\n",
       "6    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None    0.098955\n",
       "7    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None    0.093783\n",
       "8    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None    0.093086\n",
       "9    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.091310"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "1       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "2       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "                              ...                        \n",
      "4855    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4856    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, ...\n",
      "4857    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4858    [0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "4859    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 4860, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4860\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 4860\n",
      "Mean similarity: 0.9888755798339843\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-4</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-4.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.761461</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-86</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-86.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.725270</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-21</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-21.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.707814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-26</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-26.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.671619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-70</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-70.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.648673</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-2</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-2.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.617283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.611514</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.575408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-48</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-48.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.572064</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-61</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-61.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.433307</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0     B-4   data/newsrelease_B-1-100_C-1-4/B-4.txt  None   None    0.761461\n",
       "1    B-86  data/newsrelease_B-1-100_C-1-4/B-86.txt  None   None    0.725270\n",
       "2    B-21  data/newsrelease_B-1-100_C-1-4/B-21.txt  None   None    0.707814\n",
       "3    B-26  data/newsrelease_B-1-100_C-1-4/B-26.txt  None   None    0.671619\n",
       "4    B-70  data/newsrelease_B-1-100_C-1-4/B-70.txt  None   None    0.648673\n",
       "5     B-2   data/newsrelease_B-1-100_C-1-4/B-2.txt  None   None    0.617283\n",
       "6    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None    0.611514\n",
       "7    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.575408\n",
       "8    B-48  data/newsrelease_B-1-100_C-1-4/B-48.txt  None   None    0.572064\n",
       "9    B-61  data/newsrelease_B-1-100_C-1-4/B-61.txt  None   None    0.433307"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.867590</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-58</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-58.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.835216</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.835101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-10</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-10.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.796022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.794543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.786288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-25</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-25.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.775218</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-26</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-26.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.740751</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.738685</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-51</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-51.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.725711</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None    0.867590\n",
       "1    B-58  data/newsrelease_B-1-100_C-1-4/B-58.txt  None   None    0.835216\n",
       "2    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None    0.835101\n",
       "3    B-10  data/newsrelease_B-1-100_C-1-4/B-10.txt  None   None    0.796022\n",
       "4    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None    0.794543\n",
       "5    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None    0.786288\n",
       "6    B-25  data/newsrelease_B-1-100_C-1-4/B-25.txt  None   None    0.775218\n",
       "7    B-26  data/newsrelease_B-1-100_C-1-4/B-26.txt  None   None    0.740751\n",
       "8    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None    0.738685\n",
       "9    B-51  data/newsrelease_B-1-100_C-1-4/B-51.txt  None   None    0.725711"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-11</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-11.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-44</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-44.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-39</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-39.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-22</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-22.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-6</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-6.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-34</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-34.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-77</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-77.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-91</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-91.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.96291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-99</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-99.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.96291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-94</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-94.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.96291</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                      URL Group Group1  Similarity\n",
       "0    B-11  data/newsrelease_B-1-100_C-1-4/B-11.txt  None   None     1.00000\n",
       "1    B-44  data/newsrelease_B-1-100_C-1-4/B-44.txt  None   None     1.00000\n",
       "2    B-39  data/newsrelease_B-1-100_C-1-4/B-39.txt  None   None     1.00000\n",
       "3    B-22  data/newsrelease_B-1-100_C-1-4/B-22.txt  None   None     1.00000\n",
       "4     B-6   data/newsrelease_B-1-100_C-1-4/B-6.txt  None   None     1.00000\n",
       "5    B-34  data/newsrelease_B-1-100_C-1-4/B-34.txt  None   None     1.00000\n",
       "6    B-77  data/newsrelease_B-1-100_C-1-4/B-77.txt  None   None     1.00000\n",
       "7    B-91  data/newsrelease_B-1-100_C-1-4/B-91.txt  None   None     0.96291\n",
       "8    B-99  data/newsrelease_B-1-100_C-1-4/B-99.txt  None   None     0.96291\n",
       "9    B-94  data/newsrelease_B-1-100_C-1-4/B-94.txt  None   None     0.96291"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
