{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1025,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1026,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 1026,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 100 # number of nouns extracted from each article\n",
    "DATA = \"DNP\" # DNP or WIKI\n",
    "MODE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "URL = \"\" # input data\n",
    "TEST = \"\" # test data\n",
    "name = \"\" # name of query data\n",
    "url_input = \"\" # query data\n",
    "if DATA == \"DNP\":\n",
    "    if MODE == \"TXT\":\n",
    "        URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        TEST = \"B-1.txt\"\n",
    "        name = \"B-1\"\n",
    "        url_input = URL + \"C-1.txt\"\n",
    "    elif MODE == \"URL\":\n",
    "        URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "        name = \"Test\"\n",
    "        url_input = \"test.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "    name = \"Thierry Henry\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Barack_Obama\"    \n",
    "    name = \"Joe Biden\"\n",
    "    url_input = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1027,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1028,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1029,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1030,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1034,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA == \"DNP\" and MODE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 962,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>305</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        305                  100"
      ]
     },
     "execution_count": 962,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 963,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 963,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 964,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 965,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 965,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA.startswith(\"WIKI\"):\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: $url_input})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name, \"url_input\": url_input})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(i.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 966,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, voters, George W. Bush, war, Do...</td>\n",
       "      <td>0.356167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, George W. Bush, United States S...</td>\n",
       "      <td>0.124941</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, Iraq, vice president, war, Dona...</td>\n",
       "      <td>0.111314</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[vice president, George W. Bush, politician, p...</td>\n",
       "      <td>0.048214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, Donald Trump, women, member, pr...</td>\n",
       "      <td>0.044671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Deval Patrick</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Deval_Patrick</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, President, president, law, camp...</td>\n",
       "      <td>0.043997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[vice president, politician, president, law, g...</td>\n",
       "      <td>0.035188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Andrew Cuomo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Andrew_Cuomo</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, campaign, administration, Democ...</td>\n",
       "      <td>0.033422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Jimmy Carter, Ketanji Brown Jackson, United S...</td>\n",
       "      <td>0.032485</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[Barack Obama, George W. Bush, war, member, Pr...</td>\n",
       "      <td>0.029319</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0        John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1    Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "2     George W. Bush     https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "3       Barack Obama       https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "4    Hillary Clinton    https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "5      Deval Patrick      https://en.wikipedia.org/wiki/Deval_Patrick   \n",
       "6  Lyndon B. Johnson  https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "7       Andrew Cuomo       https://en.wikipedia.org/wiki/Andrew_Cuomo   \n",
       "8     Stephen Breyer     https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "9       Bill Clinton       https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "\n",
       "        Group                    Group1  \\\n",
       "0  politician  United States of America   \n",
       "1  politician  United States of America   \n",
       "2  politician  United States of America   \n",
       "3  politician  United States of America   \n",
       "4  politician  United States of America   \n",
       "5  politician  United States of America   \n",
       "6  politician  United States of America   \n",
       "7  politician  United States of America   \n",
       "8  politician  United States of America   \n",
       "9  politician  United States of America   \n",
       "\n",
       "                                              Common  Similarity  \n",
       "0  [Barack Obama, voters, George W. Bush, war, Do...    0.356167  \n",
       "1  [Barack Obama, George W. Bush, United States S...    0.124941  \n",
       "2  [Barack Obama, Iraq, vice president, war, Dona...    0.111314  \n",
       "3  [vice president, George W. Bush, politician, p...    0.048214  \n",
       "4  [Barack Obama, Donald Trump, women, member, pr...    0.044671  \n",
       "5  [Barack Obama, President, president, law, camp...    0.043997  \n",
       "6  [vice president, politician, president, law, g...    0.035188  \n",
       "7  [Barack Obama, campaign, administration, Democ...    0.033422  \n",
       "8  [Jimmy Carter, Ketanji Brown Jackson, United S...    0.032485  \n",
       "9  [Barack Obama, George W. Bush, war, member, Pr...    0.029319  "
      ]
     },
     "execution_count": 966,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 967,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 967,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 968,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Takashi Miike</td>\n",
       "      <td>[Takashi Miike, films, Audition, film producer...</td>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>[Barack Hussein Obama II, Illinois Senate, pre...</td>\n",
       "      <td>father</td>\n",
       "      <td>13</td>\n",
       "      <td>44</td>\n",
       "      <td>0.049825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Takashi Miike</td>\n",
       "      <td>[Takashi Miike, films, Audition, film producer...</td>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>[Barack Hussein Obama II, Illinois Senate, pre...</td>\n",
       "      <td>family</td>\n",
       "      <td>30</td>\n",
       "      <td>80</td>\n",
       "      <td>0.022917</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Takashi Miike</td>\n",
       "      <td>[Takashi Miike, films, Audition, film producer...</td>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>[Barack Hussein Obama II, Illinois Senate, pre...</td>\n",
       "      <td>mother</td>\n",
       "      <td>75</td>\n",
       "      <td>7</td>\n",
       "      <td>0.078095</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Wally Albright</td>\n",
       "      <td>[Wally Albright, water sportsman, businessman,...</td>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>[Barack Hussein Obama II, Illinois Senate, pre...</td>\n",
       "      <td>American</td>\n",
       "      <td>5</td>\n",
       "      <td>37</td>\n",
       "      <td>0.113514</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Charles Brown</td>\n",
       "      <td>[Charles Brown, article, American, Wikipedia, ...</td>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>[Barack Hussein Obama II, Illinois Senate, pre...</td>\n",
       "      <td>American</td>\n",
       "      <td>3</td>\n",
       "      <td>37</td>\n",
       "      <td>0.180180</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30229</th>\n",
       "      <td>Shintaro Uda</td>\n",
       "      <td>[Shintaro Uda, Hidetsugu Yagi, Yagi--Uda, Toho...</td>\n",
       "      <td>Tom Sifferman</td>\n",
       "      <td>[Tom Sifferman, National Football League, seas...</td>\n",
       "      <td>1</td>\n",
       "      <td>23</td>\n",
       "      <td>67</td>\n",
       "      <td>0.029202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30230</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>[Dwight David Eisenhower, American, Richard Ni...</td>\n",
       "      <td>Tom Sifferman</td>\n",
       "      <td>[Tom Sifferman, National Football League, seas...</td>\n",
       "      <td>game</td>\n",
       "      <td>56</td>\n",
       "      <td>15</td>\n",
       "      <td>0.042262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30231</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>[Dwight David Eisenhower, American, Richard Ni...</td>\n",
       "      <td>Tom Sifferman</td>\n",
       "      <td>[Tom Sifferman, National Football League, seas...</td>\n",
       "      <td>game</td>\n",
       "      <td>56</td>\n",
       "      <td>15</td>\n",
       "      <td>0.042262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30232</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>[Dwight David Eisenhower, American, Richard Ni...</td>\n",
       "      <td>Tom Sifferman</td>\n",
       "      <td>[Tom Sifferman, National Football League, seas...</td>\n",
       "      <td>game</td>\n",
       "      <td>56</td>\n",
       "      <td>15</td>\n",
       "      <td>0.042262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30233</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>[Dwight David Eisenhower, American, Richard Ni...</td>\n",
       "      <td>Tom Sifferman</td>\n",
       "      <td>[Tom Sifferman, National Football League, seas...</td>\n",
       "      <td>American</td>\n",
       "      <td>2</td>\n",
       "      <td>51</td>\n",
       "      <td>0.259804</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>30234 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    a1.name  \\\n",
       "0             Takashi Miike   \n",
       "1             Takashi Miike   \n",
       "2             Takashi Miike   \n",
       "3            Wally Albright   \n",
       "4             Charles Brown   \n",
       "...                     ...   \n",
       "30229          Shintaro Uda   \n",
       "30230  Dwight D. Eisenhower   \n",
       "30231  Dwight D. Eisenhower   \n",
       "30232  Dwight D. Eisenhower   \n",
       "30233  Dwight D. Eisenhower   \n",
       "\n",
       "                                  a1.phrase[0..$nphrase]        a2.name  \\\n",
       "0      [Takashi Miike, films, Audition, film producer...   Barack Obama   \n",
       "1      [Takashi Miike, films, Audition, film producer...   Barack Obama   \n",
       "2      [Takashi Miike, films, Audition, film producer...   Barack Obama   \n",
       "3      [Wally Albright, water sportsman, businessman,...   Barack Obama   \n",
       "4      [Charles Brown, article, American, Wikipedia, ...   Barack Obama   \n",
       "...                                                  ...            ...   \n",
       "30229  [Shintaro Uda, Hidetsugu Yagi, Yagi--Uda, Toho...  Tom Sifferman   \n",
       "30230  [Dwight David Eisenhower, American, Richard Ni...  Tom Sifferman   \n",
       "30231  [Dwight David Eisenhower, American, Richard Ni...  Tom Sifferman   \n",
       "30232  [Dwight David Eisenhower, American, Richard Ni...  Tom Sifferman   \n",
       "30233  [Dwight David Eisenhower, American, Richard Ni...  Tom Sifferman   \n",
       "\n",
       "                                  a2.phrase[0..$nphrase] commonValue  rank1  \\\n",
       "0      [Barack Hussein Obama II, Illinois Senate, pre...      father     13   \n",
       "1      [Barack Hussein Obama II, Illinois Senate, pre...      family     30   \n",
       "2      [Barack Hussein Obama II, Illinois Senate, pre...      mother     75   \n",
       "3      [Barack Hussein Obama II, Illinois Senate, pre...    American      5   \n",
       "4      [Barack Hussein Obama II, Illinois Senate, pre...    American      3   \n",
       "...                                                  ...         ...    ...   \n",
       "30229  [Tom Sifferman, National Football League, seas...           1     23   \n",
       "30230  [Tom Sifferman, National Football League, seas...        game     56   \n",
       "30231  [Tom Sifferman, National Football League, seas...        game     56   \n",
       "30232  [Tom Sifferman, National Football League, seas...        game     56   \n",
       "30233  [Tom Sifferman, National Football League, seas...    American      2   \n",
       "\n",
       "       rank2  Similarity  \n",
       "0         44    0.049825  \n",
       "1         80    0.022917  \n",
       "2          7    0.078095  \n",
       "3         37    0.113514  \n",
       "4         37    0.180180  \n",
       "...      ...         ...  \n",
       "30229     67    0.029202  \n",
       "30230     15    0.042262  \n",
       "30231     15    0.042262  \n",
       "30232     15    0.042262  \n",
       "30233     51    0.259804  \n",
       "\n",
       "[30234 rows x 8 columns]"
      ]
     },
     "execution_count": 968,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 969,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, president...</td>\n",
       "      <td>0.492387</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, president, George W. Bu...</td>\n",
       "      <td>0.072857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, president...</td>\n",
       "      <td>0.071351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, Barack Obama, Latin Ame...</td>\n",
       "      <td>0.069177</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, politics, decision, Ket...</td>\n",
       "      <td>0.067594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Furuichi Kōi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Furuichi_K%C5%8Di</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>[president, student, administration, president]</td>\n",
       "      <td>0.067154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[White House, U.S. Congress, Democratic Party,...</td>\n",
       "      <td>0.063575</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Richard_Nixon</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[United States Senate, president, campaign, pa...</td>\n",
       "      <td>0.059735</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Charles Thias</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Charles_Thias</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>[member]</td>\n",
       "      <td>0.044803</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Daiki Arioka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Daiki_Arioka</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>[member]</td>\n",
       "      <td>0.038032</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Article                                              URL  \\\n",
       "0      John McCain        https://en.wikipedia.org/wiki/John_McCain   \n",
       "1      Gerald Ford        https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "2      Mitt Romney        https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "3  Sonia Sotomayor    https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "4   Stephen Breyer     https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "5     Furuichi Kōi  https://en.wikipedia.org/wiki/Furuichi_K%C5%8Di   \n",
       "6     Barack Obama       https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "7    Richard Nixon      https://en.wikipedia.org/wiki/Richard_Nixon   \n",
       "8    Charles Thias      https://en.wikipedia.org/wiki/Charles_Thias   \n",
       "9     Daiki Arioka       https://en.wikipedia.org/wiki/Daiki_Arioka   \n",
       "\n",
       "        Group                    Group1  \\\n",
       "0  politician  United States of America   \n",
       "1  politician  United States of America   \n",
       "2  politician  United States of America   \n",
       "3  politician  United States of America   \n",
       "4  politician  United States of America   \n",
       "5    engineer                     Japan   \n",
       "6  politician  United States of America   \n",
       "7  politician  United States of America   \n",
       "8     athlete  United States of America   \n",
       "9       actor                     Japan   \n",
       "\n",
       "                                            r.common  Similarity  \n",
       "0  [United States Senate, Barack Obama, president...    0.492387  \n",
       "1  [United States Senate, president, George W. Bu...    0.072857  \n",
       "2  [United States Senate, Barack Obama, president...    0.071351  \n",
       "3  [United States Senate, Barack Obama, Latin Ame...    0.069177  \n",
       "4  [United States Senate, politics, decision, Ket...    0.067594  \n",
       "5    [president, student, administration, president]    0.067154  \n",
       "6  [White House, U.S. Congress, Democratic Party,...    0.063575  \n",
       "7  [United States Senate, president, campaign, pa...    0.059735  \n",
       "8                                           [member]    0.044803  \n",
       "9                                           [member]    0.038032  "
      ]
     },
     "execution_count": 969,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 970,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 40 ms\n",
      "Graph 'testgraph' node count: 4690\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 13692\n",
      "Graph 'testgraph' degree distribution: p99     243.000000\n",
      "min       3.000000\n",
      "max     288.000000\n",
      "p90       9.000000\n",
      "mean      8.758209\n",
      "p999    276.000000\n",
      "p50       3.000000\n",
      "p95      15.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.0006226067359937357\n",
      "Graph 'testgraph' size in bytes: 32972691\n",
      "Graph 'testgraph' memory_usage: 31 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 971,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.06487245559692383\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 972,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.101635</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.091369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.073201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.072416</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.069051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.062952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.050034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.044747</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.043984</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.039336</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "3           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "8           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.101635  \n",
       "1  politician  United States of America    0.091369  \n",
       "2  politician  United States of America    0.073201  \n",
       "3  politician  United States of America    0.072416  \n",
       "4  politician  United States of America    0.069051  \n",
       "5  politician  United States of America    0.062952  \n",
       "6  politician  United States of America    0.050034  \n",
       "7  politician  United States of America    0.044747  \n",
       "8  politician  United States of America    0.043984  \n",
       "9  politician  United States of America    0.039336  "
      ]
     },
     "execution_count": 972,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 973,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.12349176406860352\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_O',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 974,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.188904</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.171789</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.137717</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.135813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.135566</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.119862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.097368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.085996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.085750</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.076154</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "3           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "8       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.188904  \n",
       "1  politician  United States of America    0.171789  \n",
       "2  politician  United States of America    0.137717  \n",
       "3  politician  United States of America    0.135813  \n",
       "4  politician  United States of America    0.135566  \n",
       "5  politician  United States of America    0.119862  \n",
       "6  politician  United States of America    0.097368  \n",
       "7  politician  United States of America    0.085996  \n",
       "8  politician  United States of America    0.085750  \n",
       "9  politician  United States of America    0.076154  "
      ]
     },
     "execution_count": 974,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_O]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 975,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.145875883102417\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_C',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 976,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barack Obama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Barack_Obama</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.228745</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>George W. Bush</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_W._Bush</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.205010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>John McCain</td>\n",
       "      <td>https://en.wikipedia.org/wiki/John_McCain</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.169943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Hillary Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hillary_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.162610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bill Clinton</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bill_Clinton</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.154731</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dwight D. Eisenhower</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dwight_D._Eisenh...</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.131587</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mitt Romney</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mitt_Romney</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.113782</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sonia Sotomayor</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Sonia_Sotomayor</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.108197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.095078</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Lyndon B. Johnson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Lyndon_B._Johnson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.089078</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Article                                                URL  \\\n",
       "0          Barack Obama         https://en.wikipedia.org/wiki/Barack_Obama   \n",
       "1        George W. Bush       https://en.wikipedia.org/wiki/George_W._Bush   \n",
       "2           John McCain          https://en.wikipedia.org/wiki/John_McCain   \n",
       "3       Hillary Clinton      https://en.wikipedia.org/wiki/Hillary_Clinton   \n",
       "4          Bill Clinton         https://en.wikipedia.org/wiki/Bill_Clinton   \n",
       "5  Dwight D. Eisenhower  https://en.wikipedia.org/wiki/Dwight_D._Eisenh...   \n",
       "6           Mitt Romney          https://en.wikipedia.org/wiki/Mitt_Romney   \n",
       "7       Sonia Sotomayor      https://en.wikipedia.org/wiki/Sonia_Sotomayor   \n",
       "8           Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "9     Lyndon B. Johnson    https://en.wikipedia.org/wiki/Lyndon_B._Johnson   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.228745  \n",
       "1  politician  United States of America    0.205010  \n",
       "2  politician  United States of America    0.169943  \n",
       "3  politician  United States of America    0.162610  \n",
       "4  politician  United States of America    0.154731  \n",
       "5  politician  United States of America    0.131587  \n",
       "6  politician  United States of America    0.113782  \n",
       "7  politician  United States of America    0.108197  \n",
       "8  politician  United States of America    0.095078  \n",
       "9  politician  United States of America    0.089078  "
      ]
     },
     "execution_count": 976,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_C]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 977,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "1       [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "2       [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "                              ...                        \n",
      "4685    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "4686    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4687    [0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4688    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "4689    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 4690, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 978,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 4690\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 979,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 4690\n",
      "Mean similarity: 0.9894454956054688\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_N\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 980,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Joi Ito</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Joi_Ito</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.796359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hiroshi Masuoka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.746504</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Jim Hodges</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Jim_Hodges</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.738852</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>August Rodenberg</td>\n",
       "      <td>https://en.wikipedia.org/wiki/August_Rodenberg</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.654066</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Akio Morita</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Akio_Morita</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.623297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Alberto Salazar</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Alberto_Salazar</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.616207</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Sōichirō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Soichiro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.609846</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Christian Hosoi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Christian_Hosoi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.588501</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Roy Walter Riehlman</td>\n",
       "      <td>https://en.wikipedia.org/wiki/R._Walter_Riehlman</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.548707</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Richard_Nixon</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.547999</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Article                                                URL  \\\n",
       "0              Joi Ito              https://en.wikipedia.org/wiki/Joi_Ito   \n",
       "1      Hiroshi Masuoka  https://en.wikipedia.org/wiki/Hiroshi_Masuoka_...   \n",
       "2           Jim Hodges           https://en.wikipedia.org/wiki/Jim_Hodges   \n",
       "3     August Rodenberg     https://en.wikipedia.org/wiki/August_Rodenberg   \n",
       "4          Akio Morita          https://en.wikipedia.org/wiki/Akio_Morita   \n",
       "5      Alberto Salazar      https://en.wikipedia.org/wiki/Alberto_Salazar   \n",
       "6       Sōichirō Honda       https://en.wikipedia.org/wiki/Soichiro_Honda   \n",
       "7      Christian Hosoi      https://en.wikipedia.org/wiki/Christian_Hosoi   \n",
       "8  Roy Walter Riehlman   https://en.wikipedia.org/wiki/R._Walter_Riehlman   \n",
       "9        Richard Nixon        https://en.wikipedia.org/wiki/Richard_Nixon   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0    engineer                     Japan    0.796359  \n",
       "1    engineer                     Japan    0.746504  \n",
       "2  politician  United States of America    0.738852  \n",
       "3     athlete  United States of America    0.654066  \n",
       "4    engineer                     Japan    0.623297  \n",
       "5     athlete  United States of America    0.616207  \n",
       "6    engineer                     Japan    0.609846  \n",
       "7     athlete  United States of America    0.588501  \n",
       "8  politician  United States of America    0.548707  \n",
       "9  politician  United States of America    0.547999  "
      ]
     },
     "execution_count": 980,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 981,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Gerald Ford</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Gerald_Ford</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.857048</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.834601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Richard Nixon</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Richard_Nixon</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.812034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Masaru Ibuka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaru_Ibuka</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.780820</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Christian Hosoi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Christian_Hosoi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.728153</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Dave Bautista</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Dave_Bautista</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.720433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Robin Theryoung</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Robin_Theryoung</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.717644</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Soichi Noguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Soichi_Noguchi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.673809</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Jim Poole</td>\n",
       "      <td>https://en.wikipedia.org/wiki/James_Richard_Poole</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.646983</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Yumi Asō</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yumi_As%C5%8D</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.633809</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Article                                                URL  \\\n",
       "0      Gerald Ford          https://en.wikipedia.org/wiki/Gerald_Ford   \n",
       "1   Stephen Breyer       https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "2    Richard Nixon        https://en.wikipedia.org/wiki/Richard_Nixon   \n",
       "3     Masaru Ibuka         https://en.wikipedia.org/wiki/Masaru_Ibuka   \n",
       "4  Christian Hosoi      https://en.wikipedia.org/wiki/Christian_Hosoi   \n",
       "5    Dave Bautista        https://en.wikipedia.org/wiki/Dave_Bautista   \n",
       "6  Robin Theryoung      https://en.wikipedia.org/wiki/Robin_Theryoung   \n",
       "7   Soichi Noguchi       https://en.wikipedia.org/wiki/Soichi_Noguchi   \n",
       "8        Jim Poole  https://en.wikipedia.org/wiki/James_Richard_Poole   \n",
       "9         Yumi Asō        https://en.wikipedia.org/wiki/Yumi_As%C5%8D   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0  politician  United States of America    0.857048  \n",
       "1  politician  United States of America    0.834601  \n",
       "2  politician  United States of America    0.812034  \n",
       "3    engineer                     Japan    0.780820  \n",
       "4     athlete  United States of America    0.728153  \n",
       "5     athlete  United States of America    0.720433  \n",
       "6     athlete  United States of America    0.717644  \n",
       "7    engineer                     Japan    0.673809  \n",
       "8     athlete  United States of America    0.646983  \n",
       "9       actor                     Japan    0.633809  "
      ]
     },
     "execution_count": 981,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_N]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 982,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Fumitada Itakura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumitada_Itakura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Robin Theryoung</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Robin_Theryoung</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ayame Goriki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ayame_Goriki</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Stephen Breyer</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Stephen_Breyer</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Thomas Jefferson</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Thomas_Jefferson</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Todd Whitting</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Todd_Whitting</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Katsuji Mori</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuji_Mori</td>\n",
       "      <td>actor</td>\n",
       "      <td>Japan</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>George Pataki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/George_Pataki</td>\n",
       "      <td>politician</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Akio Morita</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Akio_Morita</td>\n",
       "      <td>engineer</td>\n",
       "      <td>Japan</td>\n",
       "      <td>0.947214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Tom Higgins</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tom_Higgins_(roc...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>0.947214</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Fumitada Itakura     https://en.wikipedia.org/wiki/Fumitada_Itakura   \n",
       "1   Robin Theryoung      https://en.wikipedia.org/wiki/Robin_Theryoung   \n",
       "2      Ayame Goriki         https://en.wikipedia.org/wiki/Ayame_Goriki   \n",
       "3    Stephen Breyer       https://en.wikipedia.org/wiki/Stephen_Breyer   \n",
       "4  Thomas Jefferson     https://en.wikipedia.org/wiki/Thomas_Jefferson   \n",
       "5     Todd Whitting        https://en.wikipedia.org/wiki/Todd_Whitting   \n",
       "6      Katsuji Mori         https://en.wikipedia.org/wiki/Katsuji_Mori   \n",
       "7     George Pataki        https://en.wikipedia.org/wiki/George_Pataki   \n",
       "8       Akio Morita          https://en.wikipedia.org/wiki/Akio_Morita   \n",
       "9       Tom Higgins  https://en.wikipedia.org/wiki/Tom_Higgins_(roc...   \n",
       "\n",
       "        Group                    Group1  Similarity  \n",
       "0    engineer                     Japan    1.000000  \n",
       "1     athlete  United States of America    1.000000  \n",
       "2       actor                     Japan    1.000000  \n",
       "3  politician  United States of America    1.000000  \n",
       "4  politician  United States of America    1.000000  \n",
       "5     athlete  United States of America    1.000000  \n",
       "6       actor                     Japan    1.000000  \n",
       "7  politician  United States of America    1.000000  \n",
       "8    engineer                     Japan    0.947214  \n",
       "9     athlete  United States of America    0.947214  "
      ]
     },
     "execution_count": 982,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1035,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
