{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 815,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 816,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 816,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 10 # number of nouns extracted from each article\n",
    "DATA = \"WIKI_P100\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Hiromu_Nonaka\"    \n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 817,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 818,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 819,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 820,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 821,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20</td>\n",
       "      <td>100</td>\n",
       "      <td>3</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       20    100          3                  100"
      ]
     },
     "execution_count": 821,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "  SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "  SET a.grpone = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 822,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>97</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100         97                  100"
      ]
     },
     "execution_count": 822,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 823,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 823,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 824,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "# RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 825,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 825,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    name = \"Test\"\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Thierry_Henry\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "\n",
    "elif DATA == \"WIKI_P100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Ai_Fukuhara\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 826,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/smallcat/anaconda3/lib/python3.10/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:125: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grpone)\n",
      "  warnings.warn(warning)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese, women]</td>\n",
       "      <td>0.270833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Takao_Doi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kyōka Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Masanao Ozaki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masanao_Ozaki</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Tsugumi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tsugumi_(actress)</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Antonio_Inoki</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yoshiko_Tanaka</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.250000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "2         Takao Doi            https://en.wikipedia.org/wiki/Takao_Doi   \n",
       "3      Kyōka Suzuki    https://en.wikipedia.org/wiki/Ky%C5%8Dka_Suzuki   \n",
       "4     Masanao Ozaki        https://en.wikipedia.org/wiki/Masanao_Ozaki   \n",
       "5           Tsugumi    https://en.wikipedia.org/wiki/Tsugumi_(actress)   \n",
       "6     Koichi Wakata        https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "7     Antonio Inoki        https://en.wikipedia.org/wiki/Antonio_Inoki   \n",
       "8    Yoshiko Tanaka       https://en.wikipedia.org/wiki/Yoshiko_Tanaka   \n",
       "9   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "\n",
       "        Group Group1             Common  Similarity  \n",
       "0     athlete   None  [Japanese, women]    0.270833  \n",
       "1    engineer   None         [Japanese]    0.250000  \n",
       "2    engineer   None         [Japanese]    0.250000  \n",
       "3       actor   None         [Japanese]    0.250000  \n",
       "4  politician   None         [Japanese]    0.250000  \n",
       "5       actor   None         [Japanese]    0.250000  \n",
       "6    engineer   None         [Japanese]    0.250000  \n",
       "7  politician   None         [Japanese]    0.250000  \n",
       "8       actor   None         [Japanese]    0.250000  \n",
       "9     athlete   None         [Japanese]    0.250000  "
      ]
     },
     "execution_count": 826,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grpone AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 827,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 827,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 828,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Yukiko Kada</td>\n",
       "      <td>[Yukiko Kada, father, Team Shiga, member, memb...</td>\n",
       "      <td>Yūgō Shinohara</td>\n",
       "      <td>[Yugo Shinohara, Winter Olympics., short track...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>8</td>\n",
       "      <td>6</td>\n",
       "      <td>0.145833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>[Koichi Wakata, Japanese, Expedition 39, astro...</td>\n",
       "      <td>Yūgō Shinohara</td>\n",
       "      <td>[Yugo Shinohara, Winter Olympics., short track...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Akane Nakashima</td>\n",
       "      <td>[goalball player, Akane Nakashima, Nakashima A...</td>\n",
       "      <td>Yūgō Shinohara</td>\n",
       "      <td>[Yugo Shinohara, Winter Olympics., short track...</td>\n",
       "      <td>article</td>\n",
       "      <td>4</td>\n",
       "      <td>9</td>\n",
       "      <td>0.180556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Akane Nakashima</td>\n",
       "      <td>[goalball player, Akane Nakashima, Nakashima A...</td>\n",
       "      <td>Yūgō Shinohara</td>\n",
       "      <td>[Yugo Shinohara, Winter Olympics., short track...</td>\n",
       "      <td>article</td>\n",
       "      <td>4</td>\n",
       "      <td>9</td>\n",
       "      <td>0.180556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Akane Nakashima</td>\n",
       "      <td>[goalball player, Akane Nakashima, Nakashima A...</td>\n",
       "      <td>Yūgō Shinohara</td>\n",
       "      <td>[Yugo Shinohara, Winter Olympics., short track...</td>\n",
       "      <td>Wikipedia</td>\n",
       "      <td>7</td>\n",
       "      <td>5</td>\n",
       "      <td>0.171429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7555</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>[Yoshiko Tanaka, Japanese, group, Masako Natsu...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7556</th>\n",
       "      <td>Dan Takuma</td>\n",
       "      <td>[Dan Takuma, Frank A. Vanderlip, Japanese, Jap...</td>\n",
       "      <td>Zenbee Mizoguchi</td>\n",
       "      <td>[Zenbee Mizoguchi, governor, Japanese, Shimane...</td>\n",
       "      <td>Japanese</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7557</th>\n",
       "      <td>Hibari Misora</td>\n",
       "      <td>[Hibari Misora, songs, renditions, mother, Kaz...</td>\n",
       "      <td>Takanori Nishikawa</td>\n",
       "      <td>[Takanori Nishikawa, charts, Resonance, anime ...</td>\n",
       "      <td>songs</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>0.305556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7558</th>\n",
       "      <td>Antonio Inoki</td>\n",
       "      <td>[Muhammad Hussain Inoki, Japanese, fight, Muha...</td>\n",
       "      <td>Noboru Kurakawa</td>\n",
       "      <td>[Noboru Kurakawa, Joker, Zeus, All Japan Pro W...</td>\n",
       "      <td>wrestler</td>\n",
       "      <td>9</td>\n",
       "      <td>5</td>\n",
       "      <td>0.155556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7559</th>\n",
       "      <td>Katsuya Kitamura</td>\n",
       "      <td>[Katsuya Kitamura, Senshu University, New Japa...</td>\n",
       "      <td>Noboru Kurakawa</td>\n",
       "      <td>[Noboru Kurakawa, Joker, Zeus, All Japan Pro W...</td>\n",
       "      <td>wrestler</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>0.225000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7560 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               a1.name                             a1.phrase[0..$nphrase]  \\\n",
       "0          Yukiko Kada  [Yukiko Kada, father, Team Shiga, member, memb...   \n",
       "1        Koichi Wakata  [Koichi Wakata, Japanese, Expedition 39, astro...   \n",
       "2      Akane Nakashima  [goalball player, Akane Nakashima, Nakashima A...   \n",
       "3      Akane Nakashima  [goalball player, Akane Nakashima, Nakashima A...   \n",
       "4      Akane Nakashima  [goalball player, Akane Nakashima, Nakashima A...   \n",
       "...                ...                                                ...   \n",
       "7555    Yoshiko Tanaka  [Yoshiko Tanaka, Japanese, group, Masako Natsu...   \n",
       "7556        Dan Takuma  [Dan Takuma, Frank A. Vanderlip, Japanese, Jap...   \n",
       "7557     Hibari Misora  [Hibari Misora, songs, renditions, mother, Kaz...   \n",
       "7558     Antonio Inoki  [Muhammad Hussain Inoki, Japanese, fight, Muha...   \n",
       "7559  Katsuya Kitamura  [Katsuya Kitamura, Senshu University, New Japa...   \n",
       "\n",
       "                 a2.name                             a2.phrase[0..$nphrase]  \\\n",
       "0         Yūgō Shinohara  [Yugo Shinohara, Winter Olympics., short track...   \n",
       "1         Yūgō Shinohara  [Yugo Shinohara, Winter Olympics., short track...   \n",
       "2         Yūgō Shinohara  [Yugo Shinohara, Winter Olympics., short track...   \n",
       "3         Yūgō Shinohara  [Yugo Shinohara, Winter Olympics., short track...   \n",
       "4         Yūgō Shinohara  [Yugo Shinohara, Winter Olympics., short track...   \n",
       "...                  ...                                                ...   \n",
       "7555    Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7556    Zenbee Mizoguchi  [Zenbee Mizoguchi, governor, Japanese, Shimane...   \n",
       "7557  Takanori Nishikawa  [Takanori Nishikawa, charts, Resonance, anime ...   \n",
       "7558     Noboru Kurakawa  [Noboru Kurakawa, Joker, Zeus, All Japan Pro W...   \n",
       "7559     Noboru Kurakawa  [Noboru Kurakawa, Joker, Zeus, All Japan Pro W...   \n",
       "\n",
       "     commonValue  rank1  rank2  Similarity  \n",
       "0       Japanese      8      6    0.145833  \n",
       "1       Japanese      2      6    0.333333  \n",
       "2        article      4      9    0.180556  \n",
       "3        article      4      9    0.180556  \n",
       "4      Wikipedia      7      5    0.171429  \n",
       "...          ...    ...    ...         ...  \n",
       "7555    Japanese      2      3    0.416667  \n",
       "7556    Japanese      3      3    0.333333  \n",
       "7557       songs      2      9    0.305556  \n",
       "7558    wrestler      9      5    0.155556  \n",
       "7559    wrestler      4      5    0.225000  \n",
       "\n",
       "[7560 rows x 8 columns]"
      ]
     },
     "execution_count": 828,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 829,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/smallcat/anaconda3/lib/python3.10/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:125: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grpone)\n",
      "  warnings.warn(warning)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese, women]</td>\n",
       "      <td>0.181038</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese, team]</td>\n",
       "      <td>0.116488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.095929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kōtarō Honda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kotaro_Honda</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.088938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.083825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hiroaki Ōishi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroaki_Ohishi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Yūji Takeda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yuji_Yaku</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.070690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Takao Doi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Takao_Doi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.066815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Katsuyuki Kondo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.065804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kenichi Yamamoto</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kenichi_Yamamoto...</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>[Japanese]</td>\n",
       "      <td>0.059942</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1     Kaoru Hoshino        https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "2    Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "3      Kōtarō Honda         https://en.wikipedia.org/wiki/Kotaro_Honda   \n",
       "4      Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "5     Hiroaki Ōishi       https://en.wikipedia.org/wiki/Hiroaki_Ohishi   \n",
       "6       Yūji Takeda            https://en.wikipedia.org/wiki/Yuji_Yaku   \n",
       "7         Takao Doi            https://en.wikipedia.org/wiki/Takao_Doi   \n",
       "8   Katsuyuki Kondo  https://en.wikipedia.org/wiki/Katsuyuki_Kond%C...   \n",
       "9  Kenichi Yamamoto  https://en.wikipedia.org/wiki/Kenichi_Yamamoto...   \n",
       "\n",
       "        Group Group1           r.common  Similarity  \n",
       "0     athlete   None  [Japanese, women]    0.181038  \n",
       "1    engineer   None   [Japanese, team]    0.116488  \n",
       "2    engineer   None         [Japanese]    0.095929  \n",
       "3    engineer   None         [Japanese]    0.088938  \n",
       "4  politician   None         [Japanese]    0.083825  \n",
       "5     athlete   None         [Japanese]    0.070690  \n",
       "6     athlete   None         [Japanese]    0.070690  \n",
       "7    engineer   None         [Japanese]    0.066815  \n",
       "8     athlete   None         [Japanese]    0.065804  \n",
       "9     athlete   None         [Japanese]    0.059942  "
      ]
     },
     "execution_count": 829,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grpone AS Group1, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 830,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 12 ms\n",
      "Graph 'testgraph' node count: 804\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 831,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.03737459182739258\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 832,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/smallcat/anaconda3/lib/python3.10/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:125: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grpone)\n",
      "  warnings.warn(warning)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Fumino Sugiyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumino_Sugiyama</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.078431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Masayuki Uemura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masayuki_Uemura</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kaoru Hoshino</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kaoru_Hoshino</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koichi Wakata</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Koichi_Wakata</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Nanako Matsushima</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nanako_Matsushima</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Tsutomu Yamaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Miki Ishii</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Miki_Ishii</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Masaaki Kanda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaaki_Kanda</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Yoshiko Tanaka</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yoshiko_Tanaka</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.020000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Article                                              URL  \\\n",
       "0   Haruka Kitaguchi   https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "1    Fumino Sugiyama    https://en.wikipedia.org/wiki/Fumino_Sugiyama   \n",
       "2    Masayuki Uemura    https://en.wikipedia.org/wiki/Masayuki_Uemura   \n",
       "3      Kaoru Hoshino      https://en.wikipedia.org/wiki/Kaoru_Hoshino   \n",
       "4      Koichi Wakata      https://en.wikipedia.org/wiki/Koichi_Wakata   \n",
       "5  Nanako Matsushima  https://en.wikipedia.org/wiki/Nanako_Matsushima   \n",
       "6  Tsutomu Yamaguchi  https://en.wikipedia.org/wiki/Tsutomu_Yamaguchi   \n",
       "7         Miki Ishii         https://en.wikipedia.org/wiki/Miki_Ishii   \n",
       "8      Masaaki Kanda      https://en.wikipedia.org/wiki/Masaaki_Kanda   \n",
       "9     Yoshiko Tanaka     https://en.wikipedia.org/wiki/Yoshiko_Tanaka   \n",
       "\n",
       "        Group Group1  Similarity  \n",
       "0     athlete   None    0.078431  \n",
       "1     athlete   None    0.078431  \n",
       "2    engineer   None    0.047619  \n",
       "3    engineer   None    0.047619  \n",
       "4    engineer   None    0.020833  \n",
       "5       actor   None    0.020408  \n",
       "6    engineer   None    0.020202  \n",
       "7     athlete   None    0.020202  \n",
       "8  politician   None    0.020000  \n",
       "9       actor   None    0.020000  "
      ]
     },
     "execution_count": 832,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grpone AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 833,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0      [1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "1      [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "2      [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, ...\n",
      "3      [1.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "4      [1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, ...\n",
      "                             ...                        \n",
      "799    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "800    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "801    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 1.0, ...\n",
      "802    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, ...\n",
      "803    [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, ...\n",
      "Name: embedding, Length: 804, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 834,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 804\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 835,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 804\n",
      "Mean similarity: 0.9017574310302734\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 836,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/smallcat/anaconda3/lib/python3.10/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:125: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grpone)\n",
      "  warnings.warn(warning)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hiroshi Fushida</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Fushida</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.814331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Fumino Sugiyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Fumino_Sugiyama</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.787246</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.786454</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Motoi Oyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Motoi_Oyama</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.782978</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Guts Ishimatsu</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Guts_Ishimatsu</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.779125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Kyoko Fukada</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kyoko_Fukada</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.746837</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Seizō Kobayashi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Seiz%C5%8D_Kobay...</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.745791</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Zeami Motokiyo</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Zeami_Motokiyo</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.743403</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Yukiko Kada</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Yukiko_Kada</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.737976</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Haruka Kitaguchi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Haruka_Kitaguchi</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.724242</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Article                                                URL  \\\n",
       "0   Hiroshi Fushida      https://en.wikipedia.org/wiki/Hiroshi_Fushida   \n",
       "1   Fumino Sugiyama      https://en.wikipedia.org/wiki/Fumino_Sugiyama   \n",
       "2      Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "3       Motoi Oyama          https://en.wikipedia.org/wiki/Motoi_Oyama   \n",
       "4    Guts Ishimatsu       https://en.wikipedia.org/wiki/Guts_Ishimatsu   \n",
       "5      Kyoko Fukada         https://en.wikipedia.org/wiki/Kyoko_Fukada   \n",
       "6   Seizō Kobayashi  https://en.wikipedia.org/wiki/Seiz%C5%8D_Kobay...   \n",
       "7    Zeami Motokiyo       https://en.wikipedia.org/wiki/Zeami_Motokiyo   \n",
       "8       Yukiko Kada          https://en.wikipedia.org/wiki/Yukiko_Kada   \n",
       "9  Haruka Kitaguchi     https://en.wikipedia.org/wiki/Haruka_Kitaguchi   \n",
       "\n",
       "        Group Group1  Similarity  \n",
       "0    engineer   None    0.814331  \n",
       "1     athlete   None    0.787246  \n",
       "2  politician   None    0.786454  \n",
       "3     athlete   None    0.782978  \n",
       "4       actor   None    0.779125  \n",
       "5       actor   None    0.746837  \n",
       "6  politician   None    0.745791  \n",
       "7       actor   None    0.743403  \n",
       "8  politician   None    0.737976  \n",
       "9     athlete   None    0.724242  "
      ]
     },
     "execution_count": 836,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grpone AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 837,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/smallcat/anaconda3/lib/python3.10/site-packages/graphdatascience/query_runner/neo4j_query_runner.py:125: RuntimeWarning: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: grpone)\n",
      "  warnings.warn(warning)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Masaaki Kanda</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Masaaki_Kanda</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.962910</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Keiichi Suzuki</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...</td>\n",
       "      <td>engineer</td>\n",
       "      <td>None</td>\n",
       "      <td>0.956435</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Uchida Kakichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Uchida_Kakichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.916667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Mai Hatsune</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Mai_Hatsune</td>\n",
       "      <td>athlete</td>\n",
       "      <td>None</td>\n",
       "      <td>0.908248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hiroshi Moriyama</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hiroshi_Moriyama</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.885758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hibari Misora</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Hibari_Misora</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.885758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Kazuki Yao</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kazuki_Yao</td>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "      <td>0.885758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Nobutaka Machimura</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Nobutaka_Machimura</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.885758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Aya Kamikawa</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Aya_Kamikawa</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.865148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kuki Ryūichi</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi</td>\n",
       "      <td>politician</td>\n",
       "      <td>None</td>\n",
       "      <td>0.865148</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              Article                                                URL  \\\n",
       "0       Masaaki Kanda        https://en.wikipedia.org/wiki/Masaaki_Kanda   \n",
       "1      Keiichi Suzuki  https://en.wikipedia.org/wiki/Keiichi_Suzuki_(...   \n",
       "2      Uchida Kakichi       https://en.wikipedia.org/wiki/Uchida_Kakichi   \n",
       "3         Mai Hatsune          https://en.wikipedia.org/wiki/Mai_Hatsune   \n",
       "4    Hiroshi Moriyama     https://en.wikipedia.org/wiki/Hiroshi_Moriyama   \n",
       "5       Hibari Misora        https://en.wikipedia.org/wiki/Hibari_Misora   \n",
       "6          Kazuki Yao           https://en.wikipedia.org/wiki/Kazuki_Yao   \n",
       "7  Nobutaka Machimura   https://en.wikipedia.org/wiki/Nobutaka_Machimura   \n",
       "8        Aya Kamikawa         https://en.wikipedia.org/wiki/Aya_Kamikawa   \n",
       "9        Kuki Ryūichi    https://en.wikipedia.org/wiki/Kuki_Ry%C5%ABichi   \n",
       "\n",
       "        Group Group1  Similarity  \n",
       "0  politician   None    0.962910  \n",
       "1    engineer   None    0.956435  \n",
       "2  politician   None    0.916667  \n",
       "3     athlete   None    0.908248  \n",
       "4  politician   None    0.885758  \n",
       "5       actor   None    0.885758  \n",
       "6       actor   None    0.885758  \n",
       "7  politician   None    0.885758  \n",
       "8  politician   None    0.865148  \n",
       "9  politician   None    0.865148  "
      ]
     },
     "execution_count": 837,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, a.grp AS Group, a.grpone AS Group1, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 838,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
