{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 792,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 793,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 793,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 10 # number of nouns extracted from each article\n",
    "DATA = \"DNP\" # DNP or WIKI\n",
    "URL = \"\"\n",
    "TEST = \"\"\n",
    "if DATA == \"DNP\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "    TEST = \"https://www.dnp.co.jp/news/detail/20169924_1587.html\"\n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    TEST = \"https://en.wikipedia.org/wiki/Zinedine_Zidane\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-Article (Star) Graph　"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 794,
   "metadata": {},
   "outputs": [],
   "source": [
    "# with open(\"data/data.json\", \"r\") as file:\n",
    "#     data = json.load(file)\n",
    "# for key in data:\n",
    "#     for element0 in data[key]:\n",
    "#         for element1 in data[key][element0]:\n",
    "#             node = element0 + \"-\" + element1\n",
    "#             if \"tfidf\" not in data[key][element0][element1]:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"]}\n",
    "#                 gds.run_cypher(query, params)\n",
    "#             else:\n",
    "#                 query = \"\"\"\n",
    "#                 MERGE (n:Noun {name:$key})\n",
    "#                 MERGE (a:Article {name:$node, lines:$lines, tfidf:$tfidf})\n",
    "#                 MERGE (n)-[l:APPEAR_IN]-(a)\n",
    "#                 \"\"\"\n",
    "#                 params = {'key': key, 'node': node, 'lines': data[key][element0][element1][\"lines\"], 'tfidf': data[key][element0][element1][\"tfidf\"]}\n",
    "#                 gds.run_cypher(query, params)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Noun-[Verb]-Noun Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 795,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///noun-verb.csv' AS row\n",
    "# MERGE (s:Noun {name:row.source})\n",
    "# MERGE (t:Noun {name:row.target})\n",
    "# MERGE (s)-[i:INTERACTS {name:row.edge}]->(t)\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 796,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MERGE (a:Article {{url: \"{TEST}\"}})\n",
    "# WITH a\n",
    "# CALL apoc.load.html(a.url, {{\n",
    "# title: \"title\",\n",
    "# h2: \"h2\",\n",
    "# body: \"body p\"\n",
    "# }})\n",
    "# YIELD value\n",
    "# WITH a,\n",
    "#     reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "#     value.title[0].text AS title\n",
    "# SET a.body = body, a.title = title\n",
    "# RETURN a.title, a.body\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 797,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = f\"\"\"\n",
    "# MATCH (a:Article {{url: \"{TEST}\"}})\n",
    "# CALL apoc.nlp.gcp.entities.stream(a, {{\n",
    "# nodeProperty: 'body',\n",
    "# key: '{KEY}'\n",
    "# }})\n",
    "# YIELD node, value\n",
    "# WITH node, value\n",
    "# UNWIND value.entities AS entity\n",
    "# RETURN entity\n",
    "# LIMIT 5;\n",
    "# \"\"\"\n",
    "# gds.run_cypher(query)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, player, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 798,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0        2     10          0                   10"
      ]
     },
     "execution_count": 798,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"LOAD CSV WITH HEADERS FROM '{URL}' AS row\n",
    "  RETURN row\",\n",
    "  \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "  WITH a\n",
    "  CALL apoc.load.html(a.url, {{\n",
    "    title: 'title',\n",
    "    h2: 'h2',\n",
    "    body: 'body p'\n",
    "  }})\n",
    "  YIELD value\n",
    "  WITH a,\n",
    "        reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "        value.title[0].text AS title\n",
    "  SET a.body = body, a.title = title\",\n",
    "  {{batchSize: 5, parallel: true}}\n",
    ")\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 799,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>10</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0        1     10         10                   10"
      ]
     },
     "execution_count": 799,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 800,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 800,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 801,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.processed</th>\n",
       "      <th>a.phrase[0..$nphrase]</th>\n",
       "      <th>a.salience[0..$nphrase]</th>\n",
       "      <th>collect(r.rank)</th>\n",
       "      <th>collect(r.score)</th>\n",
       "      <th>collect(n.name)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>[DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...</td>\n",
       "      <td>[0.12794738, 0.0794702, 0.06718063, 0.06280609...</td>\n",
       "      <td>[9, 2, 5, 3, 8, 6, 10, 7, 1, 4]</td>\n",
       "      <td>[0.030609066, 0.0794702, 0.06272191, 0.0671806...</td>\n",
       "      <td>[株式会社トーハン, 読者, 製造ライン, 書籍製造, 埼玉県, トーハン, 書籍製造ライン...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   a.processed                              a.phrase[0..$nphrase]  \\\n",
       "0         True  [DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...   \n",
       "\n",
       "                             a.salience[0..$nphrase]  \\\n",
       "0  [0.12794738, 0.0794702, 0.06718063, 0.06280609...   \n",
       "\n",
       "                   collect(r.rank)  \\\n",
       "0  [9, 2, 5, 3, 8, 6, 10, 7, 1, 4]   \n",
       "\n",
       "                                    collect(r.score)  \\\n",
       "0  [0.030609066, 0.0794702, 0.06272191, 0.0671806...   \n",
       "\n",
       "                                     collect(n.name)  \n",
       "0  [株式会社トーハン, 読者, 製造ライン, 書籍製造, 埼玉県, トーハン, 書籍製造ライン...  "
      ]
     },
     "execution_count": 801,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "MATCH (a:Article {{url: \"{TEST}\"}})-[r:CONTAINS]-(n)\n",
    "RETURN a.processed, a.phrase[0..$nphrase], a.salience[0..$nphrase], collect(r.rank), collect(r.score), collect(n.name)\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 802,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 802,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA == \"DNP\":\n",
    "    # input = {\n",
    "    #     \"C-1\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\",\n",
    "    #     \"C-2\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\",\n",
    "    #     \"C-3\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\",\n",
    "    #     \"C-4\": \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "    # }\n",
    "    # name = \"C-1\"\n",
    "    # url = input[name]\n",
    "\n",
    "    # query = \"\"\"  \n",
    "    # MERGE (i:Input {name: $name, url: $url})\n",
    "    # WITH i\n",
    "    # CALL apoc.load.html(i.url, {\n",
    "    #    title: 'title',\n",
    "    #    h2: \"h2\",\n",
    "    #    body: 'body p'\n",
    "    # })\n",
    "    # YIELD value\n",
    "    # WITH i,\n",
    "    #      reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "    #      value.title[0].text AS title\n",
    "    # SET i.body = body, i.title = title\n",
    "    # \"\"\"\n",
    "    # gds.run_cypher(query, {\"name\": name, \"url\": url})\n",
    "\n",
    "    name = \"Test\"\n",
    "    # 以下の単語を使って200文字の作文を作ってください：東京都, DNP, 自然共生サイト, 市谷の杜, 保全 (from B-10)\n",
    "    query = \"\"\"  \n",
    "    MERGE (i:Input {name: $name, url: \"test.html\", title: \"For Test\", \n",
    "            body: \"東京都内に広がる市谷の杜はDNPが運営する自然共生サイトで、ここでは豊かな生態系と調和した環境が保全されています。DNPは、この地域の美しい自然を守り、持続可能な未来を築くために積極的に取り組んでいます。市谷の杜では、植物や動物が調和し、緑豊かなエリアが市民に開かれています。DNPは、地域社会と協力して環境保護に努め、市谷の杜が未来世代にも継承されるよう努力しています。\"})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "elif DATA == \"WIKI_FP100\":\n",
    "    name = \"Thierry Henry\"\n",
    "    query = \"\"\"\n",
    "    MERGE (i:Input {name: $name, url: \"https://en.wikipedia.org/wiki/Thierry_Henry\"})\n",
    "    WITH i\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH i,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET i.body = body, i.title = title\n",
    "    RETURN i.title, i.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": name})\n",
    "    \n",
    "# set phrase and salience properties (input)\n",
    "query = f\"\"\"\n",
    "MATCH (i:Input)\n",
    "CALL apoc.nlp.gcp.entities.stream(i, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (input)\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)\n",
    "WHERE i.processed IS NOT NULL\n",
    "FOREACH (word IN i.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (i)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(i.phrase, word) + 1\n",
    "  SET r.score = i.salience[apoc.coll.indexOf(i.phrase, word)]\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 803,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.125000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>[東京都]</td>\n",
       "      <td>0.041667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>[自然共生サイト]</td>\n",
       "      <td>0.033333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL     Common  \\\n",
       "0     B-3  https://www.dnp.co.jp/news/detail/20169918_158...      [DNP]   \n",
       "1     B-1  https://www.dnp.co.jp/news/detail/20169924_158...      [DNP]   \n",
       "2     B-2  https://www.dnp.co.jp/news/detail/20169889_158...      [DNP]   \n",
       "3     B-5  https://www.dnp.co.jp/news/detail/20169888_158...      [東京都]   \n",
       "4    B-10  https://www.dnp.co.jp/news/detail/20169882_158...  [自然共生サイト]   \n",
       "\n",
       "   Similarity  \n",
       "0    0.500000  \n",
       "1    0.500000  \n",
       "2    0.125000  \n",
       "3    0.041667  \n",
       "4    0.033333  "
      ]
     },
     "execution_count": 803,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 804,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 804,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#input\n",
    "query = \"\"\"\n",
    "MATCH (i:Input), (a:Article)\n",
    "WHERE any(x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (i)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN i.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 805,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a1.name</th>\n",
       "      <th>a1.phrase[0..$nphrase]</th>\n",
       "      <th>a2.name</th>\n",
       "      <th>a2.phrase[0..$nphrase]</th>\n",
       "      <th>commonValue</th>\n",
       "      <th>rank1</th>\n",
       "      <th>rank2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>6</td>\n",
       "      <td>1</td>\n",
       "      <td>0.583333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...</td>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...</td>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>企業</td>\n",
       "      <td>3</td>\n",
       "      <td>2</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>企業</td>\n",
       "      <td>8</td>\n",
       "      <td>2</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>社員</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "      <td>0.550000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>企業</td>\n",
       "      <td>3</td>\n",
       "      <td>8</td>\n",
       "      <td>0.229167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>企業</td>\n",
       "      <td>2</td>\n",
       "      <td>8</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>B-1</td>\n",
       "      <td>[DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...</td>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>B-3</td>\n",
       "      <td>[DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...</td>\n",
       "      <td>DNP</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>0.583333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>0.583333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>6</td>\n",
       "      <td>1</td>\n",
       "      <td>0.583333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>B-2</td>\n",
       "      <td>[生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>企業</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>0.416667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>企業</td>\n",
       "      <td>8</td>\n",
       "      <td>3</td>\n",
       "      <td>0.229167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>B-9</td>\n",
       "      <td>[日本印刷株式会社 株式会社東海理化 大日本印刷株式会社, 課題, 車両, サービス, 用車...</td>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>サービス</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>0.225000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-9</td>\n",
       "      <td>[日本印刷株式会社 株式会社東海理化 大日本印刷株式会社, 課題, 車両, サービス, 用車...</td>\n",
       "      <td>サービス</td>\n",
       "      <td>5</td>\n",
       "      <td>4</td>\n",
       "      <td>0.225000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>市谷の杜</td>\n",
       "      <td>3</td>\n",
       "      <td>8</td>\n",
       "      <td>0.229167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>都市</td>\n",
       "      <td>9</td>\n",
       "      <td>2</td>\n",
       "      <td>0.305556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>森づくり</td>\n",
       "      <td>10</td>\n",
       "      <td>4</td>\n",
       "      <td>0.175000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>B-7</td>\n",
       "      <td>[社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...</td>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>社員</td>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>0.550000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>市谷の杜</td>\n",
       "      <td>8</td>\n",
       "      <td>3</td>\n",
       "      <td>0.229167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>都市</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>0.305556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>B-5</td>\n",
       "      <td>[緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>森づくり</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>0.175000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>B-6</td>\n",
       "      <td>[日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>B-4</td>\n",
       "      <td>[日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>B-8</td>\n",
       "      <td>[ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...</td>\n",
       "      <td>B-10</td>\n",
       "      <td>[保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...</td>\n",
       "      <td>日本印刷株式会社</td>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   a1.name                             a1.phrase[0..$nphrase] a2.name  \\\n",
       "0      B-8  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...     B-6   \n",
       "1     B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-6   \n",
       "2      B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...     B-6   \n",
       "3      B-3  [DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...     B-1   \n",
       "4      B-2  [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...     B-1   \n",
       "5      B-3  [DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...     B-2   \n",
       "6      B-1  [DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...     B-2   \n",
       "7      B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...     B-2   \n",
       "8      B-7  [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...     B-2   \n",
       "9      B-5  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...     B-7   \n",
       "10     B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...     B-7   \n",
       "11     B-2  [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...     B-7   \n",
       "12     B-1  [DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...     B-3   \n",
       "13     B-2  [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...     B-3   \n",
       "14     B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...     B-8   \n",
       "15     B-6  [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...     B-8   \n",
       "16    B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-8   \n",
       "17     B-8  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...     B-4   \n",
       "18    B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-4   \n",
       "19     B-6  [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...     B-4   \n",
       "20     B-2  [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...     B-4   \n",
       "21     B-7  [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...     B-4   \n",
       "22     B-9  [日本印刷株式会社 株式会社東海理化 大日本印刷株式会社, 課題, 車両, サービス, 用車...     B-4   \n",
       "23     B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...     B-9   \n",
       "24    B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-5   \n",
       "25    B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-5   \n",
       "26    B-10  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...     B-5   \n",
       "27     B-7  [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...     B-5   \n",
       "28     B-5  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...    B-10   \n",
       "29     B-5  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...    B-10   \n",
       "30     B-5  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...    B-10   \n",
       "31     B-6  [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...    B-10   \n",
       "32     B-4  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...    B-10   \n",
       "33     B-8  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...    B-10   \n",
       "\n",
       "                               a2.phrase[0..$nphrase] commonValue  rank1  \\\n",
       "0   [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...    日本印刷株式会社      6   \n",
       "1   [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...    日本印刷株式会社      2   \n",
       "2   [日本印刷株式会社, 蔵書点検サービス, RFID, 蔵書点検, 作業時間, 図書館, 富士...    日本印刷株式会社      1   \n",
       "3   [DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...         DNP      1   \n",
       "4   [DNP, 読者, 書籍製造, トーハン桶川センター, 製造ライン, トーハン, 需要, 埼...         DNP      4   \n",
       "5   [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...         DNP      1   \n",
       "6   [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...         DNP      1   \n",
       "7   [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...          企業      3   \n",
       "8   [生成, 企業, 生活者, DNP, 属性, 情報, 動画, パーソナライズド動画, 動画,...          企業      8   \n",
       "9   [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...          社員     10   \n",
       "10  [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...          企業      3   \n",
       "11  [社員, 取り組み, フェアトレード製品, オフィス, コーヒー, 認証製品, 食堂, 企業...          企業      2   \n",
       "12  [DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...         DNP      1   \n",
       "13  [DNP, Tokyo Future Tour, 主催者プログラム, 東京モーターショー, ...         DNP      4   \n",
       "14  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...    日本印刷株式会社      1   \n",
       "15  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...    日本印刷株式会社      1   \n",
       "16  [ドローン, 実証実験, 兵庫県, 株式会社DNPグラフィカ, 社会インフラ実装, 日本印刷...    日本印刷株式会社      2   \n",
       "17  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...    日本印刷株式会社      6   \n",
       "18  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...    日本印刷株式会社      2   \n",
       "19  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...    日本印刷株式会社      1   \n",
       "20  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...          企業      2   \n",
       "21  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...          企業      8   \n",
       "22  [日本印刷株式会社, サイバー攻撃, 企業, 体験型実践演習, サービス, 検知・対応, 日...        サービス      4   \n",
       "23  [日本印刷株式会社 株式会社東海理化 大日本印刷株式会社, 課題, 車両, サービス, 用車...        サービス      5   \n",
       "24  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...        市谷の杜      3   \n",
       "25  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...          都市      9   \n",
       "26  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...        森づくり     10   \n",
       "27  [緑の都市賞, 都市, 緑, 森づくり, 本社, 東京都, 敷地, 市谷の杜, 公益財団法人...          社員      1   \n",
       "28  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...        市谷の杜      8   \n",
       "29  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...          都市      2   \n",
       "30  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...        森づくり      4   \n",
       "31  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...    日本印刷株式会社      1   \n",
       "32  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...    日本印刷株式会社      1   \n",
       "33  [保全, 日本印刷株式会社, 市谷の杜, 生物多様性, 自然共生サイト, 環境省, 市谷地区...    日本印刷株式会社      6   \n",
       "\n",
       "    rank2  Similarity  \n",
       "0       1    0.583333  \n",
       "1       1    0.750000  \n",
       "2       1    1.000000  \n",
       "3       1    1.000000  \n",
       "4       1    0.625000  \n",
       "5       4    0.625000  \n",
       "6       4    0.625000  \n",
       "7       2    0.416667  \n",
       "8       2    0.312500  \n",
       "9       1    0.550000  \n",
       "10      8    0.229167  \n",
       "11      8    0.312500  \n",
       "12      1    1.000000  \n",
       "13      1    0.625000  \n",
       "14      6    0.583333  \n",
       "15      6    0.583333  \n",
       "16      6    0.333333  \n",
       "17      1    0.583333  \n",
       "18      1    0.750000  \n",
       "19      1    1.000000  \n",
       "20      3    0.416667  \n",
       "21      3    0.229167  \n",
       "22      5    0.225000  \n",
       "23      4    0.225000  \n",
       "24      8    0.229167  \n",
       "25      2    0.305556  \n",
       "26      4    0.175000  \n",
       "27     10    0.550000  \n",
       "28      3    0.229167  \n",
       "29      9    0.305556  \n",
       "30     10    0.175000  \n",
       "31      2    0.750000  \n",
       "32      2    0.750000  \n",
       "33      2    0.333333  "
      ]
     },
     "execution_count": 805,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article)-[r:CORRELATES]-(a2:Article)\n",
    "WITH a1, a2, r.common AS commonValues\n",
    "UNWIND commonValues AS commonValue\n",
    "WITH a1, a2, commonValue, \n",
    "     apoc.coll.indexOf(a1.phrase, commonValue) + 1 AS rank1, \n",
    "     apoc.coll.indexOf(a2.phrase, commonValue) + 1 AS rank2\n",
    "RETURN a1.name, a1.phrase[0..$nphrase], a2.name, a2.phrase[0..$nphrase], commonValue, rank1, rank2, (1.0/rank1 + 1.0/rank2) * 0.5 AS Similarity\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 806,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.399428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.315840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>[DNP]</td>\n",
       "      <td>0.276036</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>[自然共生サイト]</td>\n",
       "      <td>0.117703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>[東京都]</td>\n",
       "      <td>0.106223</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL   r.common  \\\n",
       "0     B-3  https://www.dnp.co.jp/news/detail/20169918_158...      [DNP]   \n",
       "1     B-1  https://www.dnp.co.jp/news/detail/20169924_158...      [DNP]   \n",
       "2     B-2  https://www.dnp.co.jp/news/detail/20169889_158...      [DNP]   \n",
       "3    B-10  https://www.dnp.co.jp/news/detail/20169882_158...  [自然共生サイト]   \n",
       "4     B-5  https://www.dnp.co.jp/news/detail/20169888_158...      [東京都]   \n",
       "\n",
       "   Similarity  \n",
       "0    0.399428  \n",
       "1    0.315840  \n",
       "2    0.276036  \n",
       "3    0.117703  \n",
       "4    0.106223  "
      ]
     },
     "execution_count": 806,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:CORRELATES]-(a:Article)\n",
    "WITH r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + i.salience[apoc.coll.indexOf(i.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN a.name AS Article, a.url AS URL, r.common, Similarity \n",
    "ORDER BY Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 807,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 8 ms\n",
      "Graph 'testgraph' node count: 104\n",
      "Graph 'testgraph' node labels: ['Input', 'Article', 'Noun']\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Input\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Input\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "G, result = gds.graph.project(\"testgraph\", node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 808,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 5\n",
      "Nodes compared: 1\n",
      "Mean similarity: 0.025235068798065186\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    writeRelationshipType='SIMILAR_J',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 809,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.047619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>0.037736</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.022472</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.009174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.009174</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.047619\n",
       "1     B-5  https://www.dnp.co.jp/news/detail/20169888_158...    0.037736\n",
       "2     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.022472\n",
       "3     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.009174\n",
       "4     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.009174"
      ]
     },
     "execution_count": 809,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_J]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 810,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0      [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "1      [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, ...\n",
      "2      [0.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, ...\n",
      "3      [0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 1.0, ...\n",
      "4      [0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, ...\n",
      "                             ...                        \n",
      "99     [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "100    [0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "101    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "102    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "103    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 104, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 811,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 104\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"rank\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 812,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 10\n",
      "Nodes compared: 104\n",
      "Mean similarity: 0.7297950744628906\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_F\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_H\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Input\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 813,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>0.719788</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.550983</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>0.548000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>0.503237</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>0.467755</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.459090</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>0.450805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>0.392644</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.369289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.293785</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0     B-6  https://www.dnp.co.jp/news/detail/20169899_158...    0.719788\n",
       "1     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.550983\n",
       "2     B-8  https://www.dnp.co.jp/news/detail/20169884_158...    0.548000\n",
       "3     B-7  https://www.dnp.co.jp/news/detail/20169892_158...    0.503237\n",
       "4     B-9  https://www.dnp.co.jp/news/detail/20169860_158...    0.467755\n",
       "5    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.459090\n",
       "6     B-5  https://www.dnp.co.jp/news/detail/20169888_158...    0.450805\n",
       "7     B-4  https://www.dnp.co.jp/news/detail/20169887_158...    0.392644\n",
       "8     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.369289\n",
       "9     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.293785"
      ]
     },
     "execution_count": 813,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_F]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 814,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>B-1</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169924_158...</td>\n",
       "      <td>0.835410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>B-3</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169918_158...</td>\n",
       "      <td>0.806186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B-6</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169899_158...</td>\n",
       "      <td>0.783473</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B-4</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169887_158...</td>\n",
       "      <td>0.783473</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>B-7</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169892_158...</td>\n",
       "      <td>0.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>B-2</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169889_158...</td>\n",
       "      <td>0.704124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>B-8</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169884_158...</td>\n",
       "      <td>0.704124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>B-10</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169882_158...</td>\n",
       "      <td>0.704124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>B-5</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169888_158...</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>B-9</td>\n",
       "      <td>https://www.dnp.co.jp/news/detail/20169860_158...</td>\n",
       "      <td>0.602062</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Article                                                URL  Similarity\n",
       "0     B-1  https://www.dnp.co.jp/news/detail/20169924_158...    0.835410\n",
       "1     B-3  https://www.dnp.co.jp/news/detail/20169918_158...    0.806186\n",
       "2     B-6  https://www.dnp.co.jp/news/detail/20169899_158...    0.783473\n",
       "3     B-4  https://www.dnp.co.jp/news/detail/20169887_158...    0.783473\n",
       "4     B-7  https://www.dnp.co.jp/news/detail/20169892_158...    0.750000\n",
       "5     B-2  https://www.dnp.co.jp/news/detail/20169889_158...    0.704124\n",
       "6     B-8  https://www.dnp.co.jp/news/detail/20169884_158...    0.704124\n",
       "7    B-10  https://www.dnp.co.jp/news/detail/20169882_158...    0.704124\n",
       "8     B-5  https://www.dnp.co.jp/news/detail/20169888_158...    0.625000\n",
       "9     B-9  https://www.dnp.co.jp/news/detail/20169860_158...    0.602062"
      ]
     },
     "execution_count": 814,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (i:Input)-[r:SIMILAR_H]-(a:Article)\n",
    "RETURN a.name AS Article, a.url AS URL, r.score AS Similarity\n",
    "ORDER BY Similarity DESC\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 815,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
