{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "import sys\n",
    "import re\n",
    "\n",
    "# import streamlit as st\n",
    "# from streamlit_jupyter import StreamlitPatcher, tqdm\n",
    "# StreamlitPatcher().jupyter()  # register streamlit with jupyter-compatible wrappers"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# neo4j desktop v5.11.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.5.4\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "host = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password= \"j4oenj4oen\"\n",
    "\n",
    "gds = GraphDataScience(host, auth=(user, password))\n",
    "print(gds.version())\n",
    "# st.write(gds.version())\n",
    "\n",
    "# params\n",
    "KEY = \"AIzaSyAPQNUpCCFrsJhX2A-CgvOG4fDWlxuA8ec\" # api key\n",
    "nphrase = 50 # number of nouns extracted from each article\n",
    "DATA_CLASS = \"DNP\" # DNP or WIKI\n",
    "DATA_TYPE = \"TXT\" # TXT or URL (currently txt is used for dnp data)\n",
    "DATA_URL = \"\" # input data\n",
    "QUERY_DICT = {} # query dict {QUERY_NAME: QUERY_URL}\n",
    "if DATA_CLASS == \"DNP\":\n",
    "    if DATA_TYPE == \"TXT\":\n",
    "        DATA_URL = \"data/newsrelease_B-1-100_C-1-4/\"\n",
    "        QUERY_DICT[\"C-1\"] = DATA_URL + \"C-1.txt\"\n",
    "        QUERY_DICT[\"C-2\"] = DATA_URL + \"C-2.txt\"\n",
    "        QUERY_DICT[\"C-3\"] = DATA_URL + \"C-3.txt\"\n",
    "        QUERY_DICT[\"C-4\"] = DATA_URL + \"C-4.txt\"\n",
    "    elif DATA_TYPE == \"URL\":\n",
    "        DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/articles.csv\"\n",
    "        QUERY_DICT[\"C-1\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_1.html\"\n",
    "        QUERY_DICT[\"C-2\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_2.html\"\n",
    "        QUERY_DICT[\"C-3\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231004_3.html\"\n",
    "        QUERY_DICT[\"C-4\"] = \"https://www.holdings.toppan.com/ja/news/2023/10/newsrelease231003_1.html\"\n",
    "elif DATA_CLASS == \"WIKI_FP100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_footballplayer_100.csv\"\n",
    "    QUERY_DICT[\"Thierry Henry\"] = \"https://en.wikipedia.org/wiki/Thierry_Henry\"\n",
    "elif DATA_CLASS == \"WIKI_P100\":\n",
    "    DATA_URL = \"https://raw.githubusercontent.com/smallcat9603/graph/main/dnp/kg/data/wikidata_persons_100.csv\"  \n",
    "    QUERY_DICT[\"Joe Biden\"] = \"https://en.wikipedia.org/wiki/Joe_Biden\"\n",
    "else:\n",
    "    print(\"DATA ERROR\")\n",
    "    sys.exit(1)\n",
    "\n",
    "query = \"\"\"\n",
    "CREATE CONSTRAINT id_unique IF NOT EXISTS \n",
    "For (a:Article) REQUIRE a.url IS UNIQUE;\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Article-[Noun]-Article Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create url nodes (article, person, ...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for idx in range(1, 101):\n",
    "    node = \"B-\" + str(idx)\n",
    "    file = DATA_URL + node + \".txt\"\n",
    "    content = \"\"\n",
    "    with open(file, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (a:Article {{ name: \"{node}\", url: \"{file}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  query = f\"\"\"\n",
    "  CALL apoc.periodic.iterate(\n",
    "    \"LOAD CSV WITH HEADERS FROM '{DATA_URL}' AS row\n",
    "    RETURN row\",\n",
    "    \"MERGE (a:Article {{name: row.id, url: row.url}})\n",
    "    SET a.grp = CASE WHEN 'occupation' IN keys(row) THEN row.occupation ELSE null END\n",
    "    SET a.grp1 = CASE WHEN 'nationality' IN keys(row) THEN row.nationality ELSE null END\n",
    "    WITH a\n",
    "    CALL apoc.load.html(a.url, {{\n",
    "      title: 'title',\n",
    "      h2: 'h2',\n",
    "      body: 'body p'\n",
    "    }})\n",
    "    YIELD value\n",
    "    WITH a,\n",
    "          reduce(texts = '', n IN range(0, size(value.body)-1) | texts + ' ' + coalesce(value.body[n].text, '')) AS body,\n",
    "          value.title[0].text AS title\n",
    "    SET a.body = body, a.title = title\",\n",
    "    {{batchSize: 5, parallel: true}}\n",
    "  )\n",
    "  YIELD batches, total, timeTaken, committedOperations\n",
    "  RETURN batches, total, timeTaken, committedOperations\n",
    "  \"\"\"\n",
    "  gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## set phrase and salience properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>batches</th>\n",
       "      <th>total</th>\n",
       "      <th>timeTaken</th>\n",
       "      <th>committedOperations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "      <td>100</td>\n",
       "      <td>113</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   batches  total  timeTaken  committedOperations\n",
       "0       10    100        113                  100"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "CALL apoc.periodic.iterate(\n",
    "  \"MATCH (a:Article)\n",
    "   WHERE a.processed IS NULL\n",
    "   RETURN a\",\n",
    "  \"CALL apoc.nlp.gcp.entities.stream([item in $_batch | item.a], {{\n",
    "     nodeProperty: 'body',\n",
    "     key: '{KEY}'\n",
    "   }})\n",
    "   YIELD node, value\n",
    "   SET node.processed = true\n",
    "   WITH node, value\n",
    "   UNWIND value.entities AS entity\n",
    "   SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "   SET node.salience = coalesce(node.salience, []) + entity['salience']\",\n",
    "  {{batchMode: \"BATCH_SINGLE\", batchSize: 10}})\n",
    "YIELD batches, total, timeTaken, committedOperations\n",
    "RETURN batches, total, timeTaken, committedOperations\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create noun-url relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)\n",
    "WHERE a.processed IS NOT NULL\n",
    "FOREACH (word IN a.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (a)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(a.phrase, word) + 1\n",
    "  SET r.score = a.salience[apoc.coll.indexOf(a.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(a.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if DATA_CLASS == \"DNP\" and DATA_TYPE == \"TXT\":\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    content = \"\"\n",
    "    with open(QUERY_URL, 'r') as f:\n",
    "      content = f.read()\n",
    "      content = re.sub('\\n+', ' ', content)\n",
    "    query = f\"\"\"\n",
    "    MERGE (q:Query {{ name: \"{QUERY_NAME}\", url: \"{QUERY_URL}\", body: \"{content}\" }})\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query)\n",
    "else:\n",
    "  for QUERY_NAME, QUERY_URL in QUERY_DICT.items():\n",
    "    query = \"\"\"\n",
    "    MERGE (q:Query {name: $name, url: $url})\n",
    "    WITH q\n",
    "    CALL apoc.load.html(i.url, {\n",
    "    title: \"title\",\n",
    "    h2: \"h2\",\n",
    "    body: \"body p\"\n",
    "    })\n",
    "    YIELD value\n",
    "    WITH q,\n",
    "        reduce(texts = \"\", n IN range(0, size(value.body)-1) | texts + \" \" + coalesce(value.body[n].text, \"\")) AS body,\n",
    "        value.title[0].text AS title\n",
    "    SET q.body = body, q.title = title\n",
    "    RETURN q.title, q.body\n",
    "    \"\"\"\n",
    "    gds.run_cypher(query, {\"name\": QUERY_NAME, \"url\": QUERY_URL})\n",
    "    \n",
    "# set phrase and salience properties (Query)\n",
    "query = f\"\"\"\n",
    "MATCH (q:Query)\n",
    "CALL apoc.nlp.gcp.entities.stream(q, {{\n",
    " nodeProperty: 'body',\n",
    " key: '{KEY}'\n",
    "}})\n",
    "YIELD node, value\n",
    "SET node.processed = true\n",
    "WITH node, value\n",
    "UNWIND value.entities AS entity\n",
    "SET node.phrase = coalesce(node.phrase, []) + entity['name']\n",
    "SET node.salience = coalesce(node.salience, []) + entity['salience']\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "\n",
    "# create noun-article relationships (Query)\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)\n",
    "WHERE q.processed IS NOT NULL\n",
    "FOREACH (word IN q.phrase[0..$nphrase] |\n",
    "  MERGE (n:Noun {name: word})\n",
    "  MERGE (q)-[r:CONTAINS]-(n)\n",
    "  SET r.rank = apoc.coll.indexOf(q.phrase, word) + 1\n",
    "  SET r.score = q.salience[apoc.coll.indexOf(q.phrase, word)]\n",
    "  SET r.weight = $nphrase - apoc.coll.indexOf(q.phrase, word)\n",
    ")\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (naive by rank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, パッケージ, 以下, 削減, 本社]</td>\n",
       "      <td>0.094219</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[パッケージ, 製造, 以下, 削減, 本社, 開発]</td>\n",
       "      <td>0.031610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 製造, 削減, 環境配慮型, 開発]</td>\n",
       "      <td>0.025126</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減]</td>\n",
       "      <td>0.018691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[以下, 東京都, 本社]</td>\n",
       "      <td>0.018670</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 以下, 本社]</td>\n",
       "      <td>0.015085</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[製造, 以下, 本社, 開発]</td>\n",
       "      <td>0.013842</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[グループ会社, 以下, 削減, 本社]</td>\n",
       "      <td>0.012094</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[代表取締役, 以下, 東京都, 本社, 開発]</td>\n",
       "      <td>0.010256</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, ブース, 幕張メッセ, 社会]</td>\n",
       "      <td>0.009834</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "4   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "5   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "6   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "7   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "8   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "9   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "\n",
       "                        Common  Similarity  \n",
       "0  [CO2排出量, パッケージ, 以下, 削減, 本社]    0.094219  \n",
       "1  [パッケージ, 製造, 以下, 削減, 本社, 開発]    0.031610  \n",
       "2  [CO2排出量, 製造, 削減, 環境配慮型, 開発]    0.025126  \n",
       "3                 [CO2排出量, 削減]    0.018691  \n",
       "4                [以下, 東京都, 本社]    0.018670  \n",
       "5             [CO2排出量, 以下, 本社]    0.015085  \n",
       "6             [製造, 以下, 本社, 開発]    0.013842  \n",
       "7         [グループ会社, 以下, 削減, 本社]    0.012094  \n",
       "8     [代表取締役, 以下, 東京都, 本社, 開発]    0.010256  \n",
       "9     [CO2排出量, ブース, 幕張メッセ, 社会]    0.009834  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CONTAINS]-(n:Noun)-[c:CONTAINS]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, collect(n.name) AS Common, SUM((1.0/r.rank)*(1.0/c.rank)) AS Similarity \n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## create article-article relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a1:Article), (a2:Article)\n",
    "WHERE a1 <> a2 AND any(x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase])\n",
    "MERGE (a1)-[r:CORRELATES]-(a2)\n",
    "SET r.common = [x IN a1.phrase[0..$nphrase] WHERE x IN a2.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})\n",
    "\n",
    "#query\n",
    "query = \"\"\"\n",
    "MATCH (q:Query), (a:Article)\n",
    "WHERE any(x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase])\n",
    "MERGE (q)-[r:CORRELATES]-(a)\n",
    "SET r.common = [x IN q.phrase[0..$nphrase] WHERE x IN a.phrase[0..$nphrase]]\n",
    "\"\"\"\n",
    "gds.run_cypher(query, {'nphrase': nphrase})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (still naive by salience)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>r.common</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量]</td>\n",
       "      <td>0.387933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量]</td>\n",
       "      <td>0.367524</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, 削減, CO2排出量, CO2排出量]</td>\n",
       "      <td>0.278183</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[削減, 本社, 以下, パッケージ, 製造, 開発]</td>\n",
       "      <td>0.203138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, 本社, 以下, CO2排出量]</td>\n",
       "      <td>0.177760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[本社, 以下, 製造, 開発]</td>\n",
       "      <td>0.142443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, ブース, CO2排出量, 社会, 幕張メッセ]</td>\n",
       "      <td>0.139062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-71</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-71.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 社会]</td>\n",
       "      <td>0.117298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[CO2排出量, CO2排出量, パッケージ, 開発, CO2排出量]</td>\n",
       "      <td>0.116453</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>[東京都, 本社, 以下]</td>\n",
       "      <td>0.111021</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "2   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "3   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "4   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "5   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "6   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "7   C-1    B-71  data/newsrelease_B-1-100_C-1-4/B-71.txt  None   None   \n",
       "8   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "9   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "\n",
       "                                      r.common  Similarity  \n",
       "0  [CO2排出量, 削減, CO2排出量, 本社, 以下, パッケージ, CO2排出量]    0.387933  \n",
       "1  [CO2排出量, 削減, CO2排出量, 環境配慮型, 製造, 開発, CO2排出量]    0.367524  \n",
       "2                 [CO2排出量, 削減, CO2排出量, CO2排出量]    0.278183  \n",
       "3                  [削減, 本社, 以下, パッケージ, 製造, 開発]    0.203138  \n",
       "4             [CO2排出量, CO2排出量, 本社, 以下, CO2排出量]    0.177760  \n",
       "5                             [本社, 以下, 製造, 開発]    0.142443  \n",
       "6     [CO2排出量, CO2排出量, ブース, CO2排出量, 社会, 幕張メッセ]    0.139062  \n",
       "7  [CO2排出量, CO2排出量, 本社, 以下, パッケージ, CO2排出量, 社会]    0.117298  \n",
       "8          [CO2排出量, CO2排出量, パッケージ, 開発, CO2排出量]    0.116453  \n",
       "9                                [東京都, 本社, 以下]    0.111021  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:CORRELATES]-(a:Article)\n",
    "WITH q, r, a, reduce(s = 0.0, word IN r.common | \n",
    "s + q.salience[apoc.coll.indexOf(q.phrase, word)] + a.salience[apoc.coll.indexOf(a.phrase, word)]) AS Similarity\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.common, Similarity \n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project graph to memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The projection took 13 ms\n",
      "Graph 'testgraph' node count: 2966\n",
      "Graph 'testgraph' node labels: ['Query', 'Article', 'Noun']\n",
      "Graph 'testgraph' relationship count: 9328\n",
      "Graph 'testgraph' degree distribution: p99     141.000000\n",
      "min       3.000000\n",
      "max     261.000000\n",
      "mean      9.434929\n",
      "p90       9.000000\n",
      "p999    150.000000\n",
      "p50       3.000000\n",
      "p95      27.000000\n",
      "p75       3.000000\n",
      "dtype: float64\n",
      "Graph 'testgraph' density: 0.001060700303268408\n",
      "Graph 'testgraph' size in bytes: 19816411\n",
      "Graph 'testgraph' memory_usage: 18 MiB\n"
     ]
    }
   ],
   "source": [
    "node_projection = [\"Query\", \"Article\", \"Noun\"]\n",
    "# # why raising error \"java.lang.UnsupportedOperationException: Loading of values of type StringArray is currently not supported\" ???\n",
    "# node_projection = {\"Query\": {\"properties\": 'phrase'}, \"Article\": {\"properties\": 'phrase'}, \"Noun\": {}}\n",
    "relationship_projection = {\n",
    "    \"CONTAINS\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"rank\", \"score\", \"weight\"]},\n",
    "    # \"CORRELATES\": {\"orientation\": \"UNDIRECTED\", \"properties\": [\"common\"]} # Unsupported type [TEXT_ARRAY] of value StringArray[DNP]. Please use a numeric property.\n",
    "    }\n",
    "# # how to project node properties???\n",
    "# node_properties = { \n",
    "#     \"nodeProperties\": {\n",
    "#         \"phrase\": {\"defaultValue\": []},\n",
    "#         \"salience\": {\"defaultValue\": []}\n",
    "#     }\n",
    "# }\n",
    "graph_name = \"testgraph\"\n",
    "exists_result = gds.graph.exists(graph_name)\n",
    "if exists_result[\"exists\"]:\n",
    "    G = gds.graph.get(graph_name)\n",
    "    G.drop()\n",
    "G, result = gds.graph.project(graph_name, node_projection, relationship_projection)\n",
    "print(f\"The projection took {result['projectMillis']} ms\")\n",
    "print(f\"Graph '{G.name()}' node count: {G.node_count()}\")\n",
    "print(f\"Graph '{G.name()}' node labels: {G.node_labels()}\")\n",
    "print(f\"Graph '{G.name()}' relationship count: {G.relationship_count()}\")\n",
    "print(f\"Graph '{G.name()}' degree distribution: {G.degree_distribution()}\")\n",
    "print(f\"Graph '{G.name()}' density: {G.density()}\")\n",
    "print(f\"Graph '{G.name()}' size in bytes: {G.size_in_bytes()}\")\n",
    "print(f\"Graph '{G.name()}' memory_usage: {G.memory_usage()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (JACCARD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.041773059964179994\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='JACCARD', # default\n",
    "    writeRelationshipType='SIMILAR_JACCARD',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (jaccard similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.060440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.057193</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.049610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.047939</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.041741</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-54</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-54.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.033241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.033118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.030973</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.030688</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.030290</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "3   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "4   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "5   C-1    B-54  data/newsrelease_B-1-100_C-1-4/B-54.txt  None   None   \n",
       "6   C-1    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None   \n",
       "7   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "8   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "9   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.060440  \n",
       "1    0.057193  \n",
       "2    0.049610  \n",
       "3    0.047939  \n",
       "4    0.041741  \n",
       "5    0.033241  \n",
       "6    0.033118  \n",
       "7    0.030973  \n",
       "8    0.030688  \n",
       "9    0.030290  "
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_JACCARD]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (OVERLAP)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.08149468898773193\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='OVERLAP',\n",
    "    writeRelationshipType='SIMILAR_OVERLAP',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (overlap similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.114088</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.112360</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.095745</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.092481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.080380</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-54</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-54.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.066605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.066551</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.061366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-95</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-95.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.061366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.060501</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "3   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "4   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "5   C-1    B-54  data/newsrelease_B-1-100_C-1-4/B-54.txt  None   None   \n",
       "6   C-1    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None   \n",
       "7   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "8   C-1    B-95  data/newsrelease_B-1-100_C-1-4/B-95.txt  None   None   \n",
       "9   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.114088  \n",
       "1    0.112360  \n",
       "2    0.095745  \n",
       "3    0.092481  \n",
       "4    0.080380  \n",
       "5    0.066605  \n",
       "6    0.066551  \n",
       "7    0.061366  \n",
       "8    0.061366  \n",
       "9    0.060501  "
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_OVERLAP]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## node similarity (COSINE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 4\n",
      "Mean similarity: 0.0887689471244812\n"
     ]
    }
   ],
   "source": [
    "result = gds.nodeSimilarity.filtered.write(\n",
    "    G,\n",
    "    similarityMetric='COSINE',\n",
    "    writeRelationshipType='SIMILAR_COSINE',\n",
    "    writeProperty='score',\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (cosine similarity)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.126199</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.104104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.099071</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.095018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.086985</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-5</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-5.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.069384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.067478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.063633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.059378</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-72</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-72.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.056054</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "1   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "2   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "3   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "4   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "5   C-1     B-5   data/newsrelease_B-1-100_C-1-4/B-5.txt  None   None   \n",
       "6   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "7   C-1    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None   \n",
       "8   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "9   C-1    B-72  data/newsrelease_B-1-100_C-1-4/B-72.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.126199  \n",
       "1    0.104104  \n",
       "2    0.099071  \n",
       "3    0.095018  \n",
       "4    0.086985  \n",
       "5    0.069384  \n",
       "6    0.067478  \n",
       "7    0.063633  \n",
       "8    0.059378  \n",
       "9    0.056054  "
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_COSINE]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## ppr (personalized pagerank)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties written: 2966\n",
      "Mean: 0.0003240621538858453\n",
      "Node properties written: 2966\n",
      "Mean: 0.00032406426363880387\n",
      "Node properties written: 2966\n",
      "Mean: 0.00032406917958461597\n",
      "Node properties written: 2966\n",
      "Mean: 0.00032405480290595727\n"
     ]
    }
   ],
   "source": [
    "for idx, name in enumerate(list(QUERY_DICT.keys())):\n",
    "    nodeid = gds.find_node_id(labels=[\"Query\"], properties={\"name\": name})\n",
    "    result = gds.pageRank.write(\n",
    "        G,\n",
    "        writeProperty=\"pr\"+str(idx),\n",
    "        maxIterations=20,\n",
    "        dampingFactor=0.85,\n",
    "        relationshipWeightProperty='weight',\n",
    "        sourceNodes=[nodeid]\n",
    "    )   \n",
    "    print(f\"Node properties written: {result['nodePropertiesWritten']}\")\n",
    "    print(f\"Mean: {result['centralityDistribution']['mean']}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (ppr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>ppr</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-52</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-52.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.010232</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-75</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-75.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.007261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.006450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-27</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-27.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.005489</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-17</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-17.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.004911</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.004668</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-50</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-50.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.004248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-13</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-13.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.004067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.003645</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-55</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-55.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.003284</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-52  data/newsrelease_B-1-100_C-1-4/B-52.txt  None   None   \n",
       "1   C-1    B-75  data/newsrelease_B-1-100_C-1-4/B-75.txt  None   None   \n",
       "2   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "3   C-1    B-27  data/newsrelease_B-1-100_C-1-4/B-27.txt  None   None   \n",
       "4   C-1    B-17  data/newsrelease_B-1-100_C-1-4/B-17.txt  None   None   \n",
       "5   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "6   C-1    B-50  data/newsrelease_B-1-100_C-1-4/B-50.txt  None   None   \n",
       "7   C-1    B-13  data/newsrelease_B-1-100_C-1-4/B-13.txt  None   None   \n",
       "8   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "9   C-1    B-55  data/newsrelease_B-1-100_C-1-4/B-55.txt  None   None   \n",
       "\n",
       "        ppr  \n",
       "0  0.010232  \n",
       "1  0.007261  \n",
       "2  0.006450  \n",
       "3  0.005489  \n",
       "4  0.004911  \n",
       "5  0.004668  \n",
       "6  0.004248  \n",
       "7  0.004067  \n",
       "8  0.003645  \n",
       "9  0.003284  "
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_idx = 0 \n",
    "query_one = list(QUERY_DICT.keys())[query_idx]\n",
    "query = f\"\"\"\n",
    "MATCH (q:Query)-[r:CORRELATES]-(a:Article) WHERE q.name = \"{query_one}\"\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, a.pr{query_idx} AS ppr\n",
    "ORDER BY Query, ppr DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. node embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Embedding vectors: 0       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "1       [0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "2       [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "3       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "4       [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 1.0, 0.0, ...\n",
      "                              ...                        \n",
      "2961    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "2962    [0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "2963    [0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, ...\n",
      "2964    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "2965    [0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 1.0, 0.0, 0.0, ...\n",
      "Name: embedding, Length: 2966, dtype: object\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.stream(\n",
    "    G,\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.stream(\n",
    "    G,\n",
    "    iterations = 3,\n",
    "    embeddingDensity = 8,\n",
    "    generateFeatures = {\"dimension\": 16, \"densityLevel\": 1},\n",
    "    randomSeed = 42,\n",
    ")\n",
    "\n",
    "print(f\"Embedding vectors: {result['embedding']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of embedding vectors produced: 2966\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.fastRP.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_fastrp\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\", # each relationship should have\n",
    "    iterationWeights=[1, 1, 1],\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.node2vec.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_node2vec\",\n",
    "    randomSeed=42,\n",
    "    embeddingDimension=16,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    "    iterations=3,\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.beta.hashgnn.mutate(\n",
    "    G,\n",
    "    mutateProperty=\"embedding_hashgnn\",\n",
    "    randomSeed=42,\n",
    "    heterogeneous=True,\n",
    "    iterations=3,\n",
    "    embeddingDensity=8,\n",
    "    # opt1\n",
    "    generateFeatures={\"dimension\": 16, \"densityLevel\": 1},\n",
    "    # # opt2 not work\n",
    "    # binarizeFeatures={\"dimension\": 16, \"threshold\": 0},\n",
    "    # featureProperties=['phrase', 'salience'], # each node should have\n",
    ")\n",
    "\n",
    "print(f\"Number of embedding vectors produced: {result['nodePropertiesWritten']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. kNN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships produced: 40\n",
      "Nodes compared: 2966\n",
      "Mean similarity: 0.9916296005249023\n"
     ]
    }
   ],
   "source": [
    "# fastrp\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_fastrp\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_FASTRP\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# node2vec\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_node2vec\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_NODE2VEC\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "# hashgnn\n",
    "result = gds.knn.filtered.write(\n",
    "    G,\n",
    "    topK=10,\n",
    "    nodeProperties=[\"embedding_hashgnn\"],\n",
    "    randomSeed=42, # Note that concurrency must be set to 1 when setting this parameter.\n",
    "    concurrency=1,\n",
    "    sampleRate=1.0,\n",
    "    deltaThreshold=0.0,\n",
    "    writeRelationshipType=\"SIMILAR_HASHGNN\",\n",
    "    writeProperty=\"score\",\n",
    "    sourceNodeFilter=\"Query\",\n",
    "    targetNodeFilter=\"Article\",\n",
    ")\n",
    "\n",
    "print(f\"Relationships produced: {result['relationshipsWritten']}\")\n",
    "print(f\"Nodes compared: {result['nodesCompared']}\")\n",
    "print(f\"Mean similarity: {result['similarityDistribution']['mean']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## evaluate (node embedding + knn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-58</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-58.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.751734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-85</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-85.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.672669</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-19</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-19.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.661049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-62</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-62.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.620701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-99</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-99.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.586150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-70</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-70.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.516265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-74</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-74.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.514406</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-53</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-53.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.502302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-33</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-33.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.484571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-45</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-45.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.481028</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-58  data/newsrelease_B-1-100_C-1-4/B-58.txt  None   None   \n",
       "1   C-1    B-85  data/newsrelease_B-1-100_C-1-4/B-85.txt  None   None   \n",
       "2   C-1    B-19  data/newsrelease_B-1-100_C-1-4/B-19.txt  None   None   \n",
       "3   C-1    B-62  data/newsrelease_B-1-100_C-1-4/B-62.txt  None   None   \n",
       "4   C-1    B-99  data/newsrelease_B-1-100_C-1-4/B-99.txt  None   None   \n",
       "5   C-1    B-70  data/newsrelease_B-1-100_C-1-4/B-70.txt  None   None   \n",
       "6   C-1    B-74  data/newsrelease_B-1-100_C-1-4/B-74.txt  None   None   \n",
       "7   C-1    B-53  data/newsrelease_B-1-100_C-1-4/B-53.txt  None   None   \n",
       "8   C-1    B-33  data/newsrelease_B-1-100_C-1-4/B-33.txt  None   None   \n",
       "9   C-1    B-45  data/newsrelease_B-1-100_C-1-4/B-45.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.751734  \n",
       "1    0.672669  \n",
       "2    0.661049  \n",
       "3    0.620701  \n",
       "4    0.586150  \n",
       "5    0.516265  \n",
       "6    0.514406  \n",
       "7    0.502302  \n",
       "8    0.484571  \n",
       "9    0.481028  "
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# fastrp\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_FASTRP]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-84</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-84.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.869317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-36</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-36.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.813916</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-98</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-98.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.796198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-54</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-54.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.755824</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-73</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-73.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.734588</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-33</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-33.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.731524</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-78</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-78.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.724026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-39</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-39.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.704462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-93</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-93.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.698007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-11</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-11.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>0.636260</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-84  data/newsrelease_B-1-100_C-1-4/B-84.txt  None   None   \n",
       "1   C-1    B-36  data/newsrelease_B-1-100_C-1-4/B-36.txt  None   None   \n",
       "2   C-1    B-98  data/newsrelease_B-1-100_C-1-4/B-98.txt  None   None   \n",
       "3   C-1    B-54  data/newsrelease_B-1-100_C-1-4/B-54.txt  None   None   \n",
       "4   C-1    B-73  data/newsrelease_B-1-100_C-1-4/B-73.txt  None   None   \n",
       "5   C-1    B-33  data/newsrelease_B-1-100_C-1-4/B-33.txt  None   None   \n",
       "6   C-1    B-78  data/newsrelease_B-1-100_C-1-4/B-78.txt  None   None   \n",
       "7   C-1    B-39  data/newsrelease_B-1-100_C-1-4/B-39.txt  None   None   \n",
       "8   C-1    B-93  data/newsrelease_B-1-100_C-1-4/B-93.txt  None   None   \n",
       "9   C-1    B-11  data/newsrelease_B-1-100_C-1-4/B-11.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0    0.869317  \n",
       "1    0.813916  \n",
       "2    0.796198  \n",
       "3    0.755824  \n",
       "4    0.734588  \n",
       "5    0.731524  \n",
       "6    0.724026  \n",
       "7    0.704462  \n",
       "8    0.698007  \n",
       "9    0.636260  "
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# node2vec\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_NODE2VEC]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Query</th>\n",
       "      <th>Article</th>\n",
       "      <th>URL</th>\n",
       "      <th>Group</th>\n",
       "      <th>Group1</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-48</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-48.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-53</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-53.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-89</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-89.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-31</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-31.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-97</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-97.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-76</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-76.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-43</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-43.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-86</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-86.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-66</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-66.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>C-1</td>\n",
       "      <td>B-64</td>\n",
       "      <td>data/newsrelease_B-1-100_C-1-4/B-64.txt</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Query Article                                      URL Group Group1  \\\n",
       "0   C-1    B-48  data/newsrelease_B-1-100_C-1-4/B-48.txt  None   None   \n",
       "1   C-1    B-53  data/newsrelease_B-1-100_C-1-4/B-53.txt  None   None   \n",
       "2   C-1    B-89  data/newsrelease_B-1-100_C-1-4/B-89.txt  None   None   \n",
       "3   C-1    B-31  data/newsrelease_B-1-100_C-1-4/B-31.txt  None   None   \n",
       "4   C-1    B-97  data/newsrelease_B-1-100_C-1-4/B-97.txt  None   None   \n",
       "5   C-1    B-76  data/newsrelease_B-1-100_C-1-4/B-76.txt  None   None   \n",
       "6   C-1    B-43  data/newsrelease_B-1-100_C-1-4/B-43.txt  None   None   \n",
       "7   C-1    B-86  data/newsrelease_B-1-100_C-1-4/B-86.txt  None   None   \n",
       "8   C-1    B-66  data/newsrelease_B-1-100_C-1-4/B-66.txt  None   None   \n",
       "9   C-1    B-64  data/newsrelease_B-1-100_C-1-4/B-64.txt  None   None   \n",
       "\n",
       "   Similarity  \n",
       "0         1.0  \n",
       "1         1.0  \n",
       "2         1.0  \n",
       "3         1.0  \n",
       "4         1.0  \n",
       "5         1.0  \n",
       "6         1.0  \n",
       "7         1.0  \n",
       "8         1.0  \n",
       "9         1.0  "
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# hashgnn\n",
    "query = \"\"\"\n",
    "MATCH (q:Query)-[r:SIMILAR_HASHGNN]-(a:Article)\n",
    "RETURN q.name AS Query, a.name AS Article, a.url AS URL, a.grp AS Group, a.grp1 AS Group1, r.score AS Similarity\n",
    "ORDER BY Query, Similarity DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "gds.run_cypher(query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# (postprocessing) free up memory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "G.drop()\n",
    "query = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "gds.run_cypher(query)\n",
    "gds.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
